[
{"name": "Mai Tai Cocktail", "ingredients": "McDowell's No.1; Celebration Dark; Rum; -30 ml; McDowell's No. 1 Caribbean White Rum - 30 ml; Lime juice -15 ml; Orange Curacao - 15 ml; Orgeat syrup -15 ml; Ice cubes, maraschino cherry or mint for garnish", "description": "The classic Mai Tai cocktail recipe is simple to make and takes just a few minutes to prepare. To make the cocktail, take a shaker with ice cubes, and add the lime juice, orange curacao, orgeat syrup, and white rum into the shaker. Strain the content into a glass half filled with ice and top it with the dark rum. Add maraschino cherry or mint to garnish the cocktail."},
{"name": "Banana Daiquiri Jello Shots", "ingredients": "30 ml Lime Juice; 30 ml Simple Syrup; 30 ml Water; 1 Package Unflavored Gelatin; 90 ml; McDowell's; Celebration Rum; 90 ml Crme de Banane; Yellow food colouring (optional)", "description": "In order to make the Banana Daiquiri Jello Shot, you need to pour the lime juice, simple syrup or sugar, and water into a glass container along with the gelatine. Place it in the microwave for about 30 seconds. You would need to stir the contents to ensure that the gelatine is dissolved completely. Add the white rum and banana liqueur into the mix and stir thoroughly. Pour the mix into moulds and refrigerate it to let it set. Keeping it overnight to cool in the refrigerator is the recommended to get the best results."},
{"name": "Be Mine Mojito", "ingredients": "1 1/2 ounces rum (optional); 1 ounce simple sugar syrup; 1/2 lime, freshly squeezed; 12 to 14 fresh mint leaves; 4 raspberries; 4 blackberries; Sprig of mint", "description": "In a tall glass, lightly muddle the lime juice, 3 raspberries, 3 blackberries, simple syrup and mint leaves. The trick is to muddle just enough to release the oils from the mint leaves while leaving them intact. Add crushed ice and rum, and top with soda. Stir until the outside of the glass begins to frost. Garnish with the leftover berries speared with a mint sprig. Now Be mine Mojito is ready to serve."},
{"name": "Strawberry Colada", "ingredients": "Crushed ice cubes; 3 measures of Celebration Rum; 4 measures of pineapple juice; 1 measure of coconut cream; 6 hulled strawberries; Pineapple wedges and strawberries for decoration", "description": "Mix some crushed ice in a blender with the liquid ingredients and the strawberries. Blend until smooth. Then pour - without straining - into a tall chilled tumbler. Dress with pineapple wedges and strawberries. Serve Strawberry Colada Rum Cocktail chill."},
{"name": "Cricket Twister Cocktail", "ingredients": "Celebration rum - 45 ml; Royal Challenge whiskey - A dash; Galliano - 15 ml; Orange juice to top up; Lime Juice - 5 ml; Cherry for garnish", "description": "Squeeze the lime juice into a shaker with ice. Top up with all of the remaining ingredients. Shake well. Strain into a poco grande with crushed ice. Garnish with a cherry. Serve Cricket Twister Rum Cocktail chill."},
{"name": "Mojito", "ingredients": "The mojito cocktail recipe includes:; McDowells No. 1; Caribbean White Rum -about 60 ml(For an English Mojito, you may use 30 ml of Gin); 1 teaspoon icing sugar; Mint leaves; Lime juice; Soda water (Use Sprite instead for an English Mojito, also acts as a sweetner); Ice cubes; Mint sprigs", "description": "Making a mojito cocktail drink requires less time than you think it would. All you need do is add some lime juice, sugar, and mint leaves in a jar and crush the mint leaves using a rolling pin or any object that would serve the purpose. This would give the lime juice a more minty flavour. Pour the contents of the jar into a glass and add some ice cubes into the glass. Add 60 ml McDowells No. 1 Caribbean White Rum to the glass while stirring it with a long-handled spoon. Pour some soda water to the mix along with some mint sprigs to garnish your mojito. Serve chilled. For an English Mojito (popular variant) replace the White Rum with Gin and add Sprite instead of Soda. If you're using Sprite, you might want to cut down on the icing sugar as Sprite is quite sweet by itself."},
{"name": "Yuletide Mule", "ingredients": "60ml Lagavulin 16 year-old; 15ml fresh Ginger Juice; 20ml Lemon Juice; 15ml Sugar syrup; Top with either soda or hot water depending on your taste", "description": "Either shake the first four ingredients and strain over ice into a highball glass and top with soda or add the first four ingredients into a wine glass and top with boiling water."},
{"name": "Guava & Blueberry Martini", "ingredients": "60 ml Tanqueray No.10 Gin; 40 ml Guava Juice; 40 ml Blueberry Puree; 10 ml Lemon Juice; 5 ml Sugar Syrup; 2 dashes of Orange Blossom Water", "description": "Add all the ingredients in a shaker and shake well. Strain the content in a chilled martini glass and garnish with a sweet lime zest."},
{"name": "Pomegranate Martini", "ingredients": "60 mlCrocVodka; 15mlLime Juice; 30 ml Lemon Grass Syrup; Fresh Pomegranate", "description": "Add all the ingredients in a shaker and shake well. Strain the content in a chilled martini glass and garnish with a lemon grass stick."},
{"name": "Cuba Libre", "ingredients": "Cola -60 ml; McDowells No.1; Celebration Dark Rum -; 3; 0ml; ,; 1/3rd Fresh lime juice; Lime wedges to garnish; Ice", "description": "To make the cocktail, you can follow this simple Cuba Libre cocktail recipe . Put some ice, crushed or cubes, into a highball glass. Pour the cola, McDowells No. 1 Celebration Dark Rum, and fresh lime juice into the highball glass. Stir the drink well. You can use lime wedges to add an extra touch into the cocktail. You can also use the lime wedge as garnish to your Cuba Libre cocktail. Considered as the worlds second most popular drink, The Cuba Libre Cocktail would undoubtedly make for both a refreshing and appealing drink to savour."},
{"name": "Bonito-Jito", "ingredients": "1 part Pinky Vodka; 3 sprigs of fresh mint; 1 teaspoon of brown sugar; 11 blueberries; 1/2 part fresh lime juice", "description": "Muddle(crush) the mint leaves, blueberries, brown sugar and lime juice in a glass. Add Pink and ice to nearly fill the glass. Place a cocktail shaker over the glass and shake thoroughly. Top off the glass with sparkling water. Garnish with a lime wedge and mint leaf. Serve Bonito Jito Vodka Cocktail chill."},
{"name": "Sink The Pink Cocktail", "ingredients": "1 part Pinky Vodka; 1 part Grapefruit Juice; A splash of Simple Syrup", "description": "This cocktail is served shaken in a Highball Glass. Take a Cocktail Shaker and pour 3 to 4 ice cubes into it. Pour the mentioned quantities of Pinky Vodka, Grapefruit Juice and Simple Syrup into the cocktail shaker. Shake the ingredients vigorously, until the mix gets a light orange hue. Strain and pour the mix into a chilled Highball Glass. Garnish the cocktail with a raspberry or a strawberry."},
{"name": "Clover Club", "ingredients": "60 ml gin; 1 egg white; 15 ml lemon juice; 3 dashes raspberry syrup", "description": "Shake well with cracked ice, then strain into a chilled cocktail glass.Serve Clover Club Gin Cocktail chill."},
{"name": "Blue Hawaiian", "ingredients": "Ice; 2 measures of Celebration Rum; 1/2 measure blue Curacao syrup; 1 measure of pineapple juice; 1/2 measure coconut cream; A pineapple wedge to decorate", "description": "Place a handful of ice in the cocktail shaker and pour in the liquid ingredients. Shake vigorously over ice and strain into a wine goblet. Dress with a small wedge of pineapple. Serve Blue Hawaiian Rum Cocktail chill."},
{"name": "Cupid's Kiss Cocktail", "ingredients": "1 1/2 ounces Irish cream liqueur; 1/2 ounce dark crme de cocoa; 1 ounce amaretto; Hot chocolate; Whipped cream; Chocolate; A dash of rum", "description": "Pour all the spiritz in a mug. Top it with the hot chocolate. Garnish with the fresh whipped cream and chocolate flakes. Serve Cupid's Kiss Rum Cocktail chill."},
{"name": "Coco Roco", "ingredients": "2 measures fresh coconut juice; 1/2 measure white rum; 1/2 measure apricot brandy; 1/2 measure coconut milk; Crushed ice", "description": "Blend all the ingredients in a blender for about 5 seconds. Serve in a coconut shell or chilled tumbler and drink through a straw! Serve Coco Roco Rum Cocktail chilled."},
{"name": "Resolution Martini", "ingredients": "90 ml gin; 30 ml apricot brandy; 15 ml fresh lemon juice", "description": "Pour the ingredients into a cocktail shaker or mixing glass filled with ice. Stir Well and strain into a chilled cocktail glass. Serve Resolution Martini Gin Cocktail chill."},
{"name": "Orange Blossom Cocktail", "ingredients": "30 ml gin; 30 ml sweet vermouth; 30 ml orange juice", "description": "This cocktail is served stirred with cracked ice. Take a Mixing Glass or Cocktail Shaker and pour lots of cracked ice into it. Pour the mentioned quantities of Gin, Sweet Vermouth and Orange Juice into the shaker and stir the ingredients thoroughly. Strain and pour the mixture into a chilled Martini Glass. Garnish the mix with an Orange Slice. You can add cracked ice to the cocktail to keep it chilled for a longer time. For a larger serving, a Highball Glass is recommended."},
{"name": "Rum Toddy", "ingredients": "6 parts dark rum; 1 part simple syrup; Boiling water; 1 wedge lemon", "description": "Add dark rum and simple syrup into a rocks galss. Topup with boiling water. Garnish with lemon. Serve Rum Toddy Rum Cocktail chill."},
{"name": "Ankle Breaker", "ingredients": "60 ml dark rum; 50 ml Pomegranate juice; 1 tsp lime juice; 1 tsp sugar syrup; Ice", "description": "Shake the rum, pomegranate, lime juice and sugar syrup over ice until well frosted. Strain into a chilled tumbler. Serve Ankle Breaker Rum Cocktail chill."},
{"name": "Dark and Stormy", "ingredients": "Ice cubes; 24 ml ginger beer, chilled; 6 ml dark rum; 2 ml fresh lime juice; 1 tablespoon grated ginger, plus 4 slices for garnish (optional); 2 lime slices, halved (optional)", "description": "Fill a large pitcher with ice. Stir in beer, rum, juice and grated ginger. Divide evenly among 4 glasses; garnish each with 1 slice ginger and 1 slice lime, if desired. Serve Dark and Stormy Cocktail chill."},
{"name": "Traditional Eggnog", "ingredients": "1 Whole Egg; 5 ml Milk; 2 ml Light Rum; 1 tsp; Powdered Sugar", "description": "Fill a shaker half full with ice cubes. Pour all ingredients into shaker and shake. Strain drink into a Collins glass, dust with Nutmeg. Serve Traditional Eggnog Cocktail chilled."},
{"name": "Long Beach Cocktail", "ingredients": "50 ml rum; 50 ml vodka; 50 ml gin; 50 ml tequila; 50 ml oz triple; 50 ml whisky sec fill with sweet and sour mix; 1 splash Cranberry juice", "description": "Mix as a long island ice tea. Serve Long Beach Rum Cocktail Chilled."},
{"name": "Overcast Condition Cocktail ", "ingredients": "60ml; Johnnie Walker Red Label; 45ml; Sweet lime juice; 1 nos; Egg white; Top; Ginger ale top", "description": "Garnish your cocktail with Sweet lime or orange & Ginger juliens Glassware: Tall"},
{"name": "Celebration Planter's Punch", "ingredients": "60 ml rum; 10 ml Lemon Juice; 15 ml Strawberry flavour; 60 ml Pineapple juice; 60 ml Orange juice; 60 ml Guava juice; 65 ml Cola; 2 slices Cucumber; Fresh milk to add", "description": "Mix everything in a shaker and top up with grenadine syrup and crushed ice. Serve Celebration Planters Punch Rum Cocktail chill."},
{"name": "Dark 'n Stormy", "ingredients": "60 ml dark rum; 300 ml ginger beer; Ice; Garnish  Lime wedge", "description": "Fill a 360 ml glass with ice. Squeeze the lime wedge over the ice in the glass. Drop the wedge into the glass. Pour the rum into the glass. Add the ginger beer. Stir lightly and garnish with another lime wedge, if desired. Sever Dark n Stormy Rum Cocktail Chill."},
{"name": "Team Jersey Cocktail", "ingredients": "60ml; Black & White whisky; 90ml; Pineapple juice; 30ml; Cranberry juice; 2tbsp; Blackberry jam", "description": "Layer all the 3 ingredients"},
{"name": "The Royal Mix Cocktail", "ingredients": "60ml; Royal Challenge; 15ml; Cinnamon syrup; 90ml; Apple Juice; 10ml; Lime Juice", "description": "Fill a glass with ice. Pour whisky and cinnamon syrup. Top it up with apple juice and stir"},
{"name": "Willow Bat Cocktail", "ingredients": "60ml; Vat 69; 45ml; Camomile Tea; Cinnamon stick", "description": "Take all the ingredients and stir with ice cubes"},
{"name": "Captain's Table", "ingredients": "2 parts gin; 1/2 part Campari; 1 tsp grenadine; 1 part orange juice; 4 parts ginger ale; 1 maraschino cherry; Glass: Tall", "description": "Half fill the shaker with ice cubes."},
{"name": "Jamaican Rose Cocktail", "ingredients": "1 1/2 parts Pinky Vodka; 1 part Passoa (Passion fruit liqueur); 1/4 part Rose water; 3 parts Hibiscus drink; 3 freshly squeezed Lemon wedges", "description": "This cocktail is served shaken in a Martini Glass. Take a Cocktail Shaker and fill it with 3 to 4 ice cubes. Pour the mentioned measures of Pinky Vodka, Rose Water, Passoa and Hibiscus drink in the shaker. Shake the ingredients vigorously, until the mix becomes chilled and gets a reddish hue. Strain and pour the mix into a chilled Martini Glass. Garnish the mix with mint leaves, Rose petals, a lemon wedge and a raspberry flower."},
{"name": "RC Time Out Cocktail", "ingredients": "45ml; Royal Challenge; 90ml; Tender coconut water; 10ml; Lime Juice", "description": "Mix all ingredients in a shaker with lots of ice. Strain into a green coconut / Pilsner glass"},
{"name": "Tom Collins Cocktail", "ingredients": "2 tbsp lemon juice; 2 tsp fine sugar; 60 ml gin; mint sprig or lemon wedge for garnish", "description": "To make the Tom Collins Cocktail, add the sugar syrup (or powdered sugar as substitute) along with lemon juice in a Collins glass. Pour the gin into the mix. Add in some ice in the glass and garnish the cocktail with mint sprigs, lemon wedge, or maraschino cherries. You can also add some soda into the mix as an alternative recipe."},
{"name": "Teardrop Cocktail", "ingredients": "60ml Gin; 60ml Apricot or Peach nectar; 30ml Single Cream; Crushed ice; 20ml Strawberry Syrup", "description": "This cocktail is served blended in a Highball Glass. Fill a blender with 60ml Gin, 60ml Peach Nectar and 30ml Single Cream. Blend the ingredients for 10 to 20 seconds, until the mix becomes thick and frothy. Fill a Highball Glass with crushed ice and pour the ingredients from the blender into it. Stir the mix and top it with a splash of Strawberry Syrup. Garnish the drink with mint leaves and strawberry pieces. You can also rim the glass with powdered sugar, before you pour the blended ingredients into it."},
{"name": "The Spray Cocktail", "ingredients": "1 measure Raspberry Vodka; 1 measure Framboise; 1/2 measure Cointreau; 3/4 measure Cranberry Juice; 2 dashes of Orange Bitters; 1 dash of Lime Cordial; Ice; 1 Raspberry", "description": "This cocktail is served shaken in a chilled Martini Glass. Take 3 to 4 ice cubes in a Cocktail Shaker. Add the mentioned quantities of Vodka, Framboise, Cointreau, Cranberry Juice, Lime Cordial and Orange Bitters to it. Shake the ingredients thoroughly, until the drink gets a dark pink hue. Strain and pour the mix into a chilled Martini Glass. Garnish the cocktail with a whole raspberry."},
{"name": "The Last Ball Cocktail", "ingredients": "60ml; Black Dog Triple Gold Reserve; 2 nos; Star Anise; 5ml; Sugar syrup", "description": "Take a tall glass and add all the ingredients with ice cubes and stir 50 times."},
{"name": "Delft Donkey", "ingredients": "20 ml vodka; 10 ml lime juice; Cubed and cracked ice; Ginger beer; Lime slice, to decorate", "description": "Shake the vodka and lime juice vigorously over ice until well frosted. Half fill a chilled tall glass with cracked ice and strain the cocktail over. Top up with ginger beer and dress with a slice of lime. Serve Delft Donkey Vodka Cocktail chill."},
{"name": "Flying Grasshopper", "ingredients": "Cracked Ice; 10 ml vodka; 10 ml green crme de; menthe; 10 ml white crme de; menthe", "description": "Put the cracked ice into a mixing glass or jug and pour in the vodka and crme the menthe. Stir well and strain into a cocktail glass."},
{"name": "Adam’s Surprise", "ingredients": "60 ml vodka; 120 ml lemonade concentrate; 120 ml water; 10 teaspoon sugar", "description": "Fill up the blender with ice and vodka. Add the sugar, lemonade concentrate and fill it with water if required. Blend for half a minute and serve Adams Surprise Vodka Cocktail chill."},
{"name": "McDowell’s No. 1 Simply Silk", "ingredients": "McDowells No. 1 Silk Honey  180ml; Soda  360ml; Ice  3 to 4 cubes per glass", "description": "Pour 60ml each into 3 tall glasses, add 120ml of chilled soda along with 3-4 cubes of ice in each glass. Clink the glasses and enjoy the unmatched smoothness of Silk along with your friends. Simple isnt it, thats why we call it Simply Silk!"},
{"name": "Heads or Tails Cocktail", "ingredients": "45ml; Black & White whisky; 30ml; Chenin blanc; Top Sprite or Cranberry juice", "description": "Garnish your cocktail with mint sprigs & grapes. Glassware : Bowl glass or whisky"},
{"name": "The Outfield Cocktail", "ingredients": "60ml; Johnnie Walker Red Label; 1 Stick; Chopped Lemon grass; 15ml; Honey syrup; Top Soda", "description": "Garnish your cocktail with Lemon grass Juliens and Lemon grass straw Glassware:Hard base glass"},
{"name": "Black Dog Berry Nice", "ingredients": "Black Dog Black Reserve; 60ml; Blueberry Jam; 2 tsp; Lime Wedge; 2", "description": "Begin by muddling your ingredients well, shake well till all ingredients blend together with the liquid and pour over your glass with crushed ice. Serve Black Dog Berry Nice Cocktail chill."},
{"name": "Black Dog Blacksmith", "ingredients": "This season is all about warm; flavours; coming together tocreate harmony. Here is a drink packed with; flavours; of the season!; Black Dog Black Reserve; 60ml; Fresh Mint; 5 springs; Orange Peel; 2; Sugar Syrup; 10ml; Ginger Ale to top", "description": "Muddle the mint, orange peel, sugar syrup and the liquid together. Build it up in your glass over ice and top it up with some ginger ale and youre ready to serve Black Dog Black Smith Cocktail chill."},
{"name": "Illusions", "ingredients": "1 ml vodka; 1 ml Malibu; ml Midori; ml blue curaao; Ice; Fresh orange juice; Melon slices, to decorate", "description": "Stir the first four ingredients over ice until frosted. Strain into a chilled highball glass or large cocktail or wine glass, and top up with more ice and orange juice to taste. Dress with slices of melon. Serve Illusion Vodka Cocktail chill."},
{"name": "Pinky No.1", "ingredients": "1 part Pinky Vodka; 1 part cranberry juice; 1 part sparkling water", "description": "Serve over ice and garnish with fresh mint. For a sweeter version, replace sparkling water with lemon-lime soda. Serve Pinky No.1 Cocktail chill."},
{"name": "Perfect Pair Cocktail", "ingredients": "1 1/2 parts Vodka; 3/4 parts Pineapple Juice; 1 part Pomegranate Juice; 1/2 part Lime Juice; 1/4 part Simple Syrup; Pink Rimming Sugar", "description": "This cocktail is served shaken in a Martini Glass. Take a Cocktail Shaker and add 4 to 5 ice cubes to it. Pour the mentioned quantities of Vodka, Pineapple Juice, Pomegranate Juice, Lime Juice and Simple Syrup into the Shaker. Shake the ingredients vigorously, until the drink becomes pinkish red in colour. Take a Martini Glass and coat its rim with Pink Rimming Sugar. Strain and pour the ingredients into the prepared glass. You can garnish the concoction with a lime wedge."},
{"name": "Black Dog Caffeine Kick", "ingredients": "This one is for the winter evening where you need the coffee but also a kick.; Black Dog Triple Gold Reserve; 45ml; Black Coffee (cold); 60ml; Caster Sugar; 1 tsp; Single Cream; 15ml; Monin Vanilla Syrup; A Dash", "description": "Add all your ingredients together in a shaker and mix them up until all the ingredients have blended. Top the glass with ice and pour your concoction over it and youre ready to serve Black Dog Caffeine Kick chill."},
{"name": "Strawberry Moon", "ingredients": "1 part Pinky Vodka; 1 part pina colada mix; 2 parts pineapple juice; 2 fresh strawberries", "description": "Muddle the strawberries at the bottom of a mixing glass and add the remaining ingredients. Shake over ice until light and fluffy, and strain into a martini glass. Garnish with a strawberry. Serve Strawberry Moon Vodka Cocktail chill."},
{"name": "Pinky Prosecco", "ingredients": "1 part Pinky Vodka; 1/2 part raspberry puree; champagne", "description": "Pour the raspberry puree into a champagne flute. Using a spoon, layer the Pinky over the puree. Top off with champagne, pouring delicately down the side of the glass to preserve the layer between the Pinky and the puree"},
{"name": "Black Dog Happyness", "ingredients": "Nothing spells the holiday season like apple and cinnamon, and when mixed with Scotch Whisky, it warms the chilly winter evenings.; Black Dog Black Reserve; 60ml; Apple Juice; 90ml; Cinnamon Stick; 1 to 2; Lime Wedge; 1; Sugar Syrup; 10ml", "description": "Muddle the cinnamon stick and lime wedge with some sugar syrup to bring out the beautiful flavours. Proceed to shake it with the apple juice and Black Dog Black Reserve Scotch Whisky and serve it in a glass with ice."},
{"name": "Earl’s Choice", "ingredients": "Black Dog Triple Gold Reserve; 45ml; Earl Grey Tea Liquor; 90ml; Monin Mojito Mint; 10ml; Lime Juice; 5ml", "description": "Begin by topping the glass with ice and proceed to build it up with each ingredient over the ice. Give it a quick stir and youre good to go!"},
{"name": "Vanilla Sky", "ingredients": "Black Dog Black Reserve; 60ml; Monin Vanilla Syrup; 10ml; Orange Wedge; 1 piece; Single Cream; 15ml", "description": "Begin with muddling all the ingredients together to bring out the flavours that will eventually complement each other. Top a glass with ice, pour the mixture over the ice and stir."},
{"name": "Gin and Tonic", "ingredients": "60 ml gin; 100 ml tonic water; Lime wedge for garnish", "description": "Pour the ingredients in a highball glass with ice cubes. Stir well and granish with a lime wedge. Serve Gin and Tonic Cocktail Drink chilled."},
{"name": "Golden Dawn", "ingredients": "1/2 parts gin; 1/2 parts Calvados; 1/2 parts apricot brandy; 1/2 parts mango juice; Ice; Dash of Grenadine", "description": "Mix the first four ingredients together over ice. Strain into a cocktail glass and gradually add a dash of grenadine so that the colour ripples through. Serve Golden Dawn Gin Cocktail Recipe chilled."},
{"name": "Ginger Blaster Cocktail", "ingredients": "60ml; Royal Challenge; 90ml; Tonic water; 2 slice; Lime slice; 10ml; Ginger syrup; 2 nos; Star Anise; 3pc; Dried Apricot", "description": "Fill a glass with ice. Pour Royal Challenge and then the rest of the ingredients. Stir. Top up with Tonic water."},
{"name": "Velvet Cobbler", "ingredients": "60 ml of Clynelish 14-year-old Single Malt Scotch Whisky; 15ml Cherry Liquor; 2 Orange Wedges; 3 Bar Spoons Vanilla & Chili Sugar", "description": "In a cocktail shaker, muddle the vanilla & chili sugar with citrus wedges over crushed ice and stir. Add the Cherry Liquor and Single Malt; shake well. Strain and pour into a glass topped with crushed ice and garnish with seasonal berries and a mint spring."},
{"name": "Claret Lemonade Cocktail", "ingredients": "240 ml Four Seasons Wine; 60 ml Simple Syrup; 30 ml Fresh Lemon Juice", "description": "This cocktail is served shaken in a Wine Goblet. Take a Cocktail Shaker and fill it with 3 to 4 ice cubes. Pour the mentioned measures of Wine, Simple Syrup and Lemon Juice in the shaker. Shake the ingredients vigorously, until the concoction becomes red in colour. Strain and pour the drink into a chilled Wine Glass. Garnish the cocktail with a lemon wheel or a lime wedge. Ice cubes can be added to keep the cocktail chilled for a longer time."},
{"name": "Casablanca", "ingredients": "60 ml white rum; 60 ml white wine; 20 ml ginger syrup; 30 ml fresh lime juice; 2 thin ginger slices; Pineapple chunks; Top with sparkling white wine; Pineapple stick for garnishing; Crushed ice", "description": "Mix-up ginger, pineapple & and ginger syrup in shaker and add fresh lime juice and rum & shake again. Strain into a glass filled with crushed ice and top with sparkling white wine. Garnish with pineapple stick and the leaf. Serve Casablanca Wine Cocktail Recipe chill."},
{"name": "Sweet Lady", "ingredients": "45 ml red wine; 1 splash Cranberry juice; 1 splash Lime juice; 1 splash Sugar syrup; 1 splash Strawberry crush; Sprite as required", "description": "Mix everything in a shaker with ice cubes and top up with Sprite."},
{"name": "Ginger Space", "ingredients": "Black Dog Black Reserve; 45ml; Ginger Syrup; 15ml; Lime Wedge; 1; Thin cucumber slices; 2 to 3; Soda to top", "description": "Shake 45ml of Black Dog Black Reserve well with the ginger syrup and lime wedge, fill your glass with ice and the cucumber slices. Pour the shaken mixture over ice and top the drink with soda."},
{"name": "Moscow Mule Cocktail", "ingredients": "60 ml Smirnoff Vodka; 10 ml Lime Juice; Cracked ice; Ginger beer; Lime slice for decoration", "description": "This drink is either served built-up or shaken. Fill the Cocktail Shaker with lots of ice and add 60 ml Smirnoff Vodka and 10 ml Lime juice to it. Shake the mix rigorously, until the outside of the shaker becomes frosted. Strain and pour the mix into a Highball Glass filled with cracked ice up to the brim. Top up the mix with Ginger Beer and stir the ingredients well. Garnish the cocktail with herbs, sprigs and a slice of lime."},
{"name": "Metropolitan", "ingredients": "1 lemon wedge; 1 tablespoon castor sugar; Cracked ice; part vodka; part framboise; part cranberry juice; part orange juice", "description": "This fruity mix is best served chilled. Fill the shaker with lots of cracked ice and then pour the mentioned quantities of Vodka, Framboise, Cranberry Juice and Orange Juice in it. Shake vigorously until the outside of the shaker appears misted. Rub the rim of a glass with a lemon wedge and then dip it in powdered Caster Sugar. Strain and pour the drink intothe rimmed glass. Cracked Ice is used to chill the drink faster"},
{"name": "Vodka Esppresso", "ingredients": "2 ml espresso; 1 ml vodka; 2 teaspoon castor sugar; 1 ml Amarula", "description": "Put the cracked ice into a cocktail shaker, pour in the coffee and vodka and add the sugar. Cover and shake vigoroursly, until the shaker is misted. Strain into a cocktail glass, then float the Amarula on top. Serve Vodka Esppresso Cocktail chill."},
{"name": "Self Destruct Cocktail", "ingredients": "30 ml Vodka; teaspoon Lime Juice; teaspoon Triple Sec; Ice", "description": "This cocktail is served shaken in a chilled Martini Glass. Fill a Cocktail Shaker with ice and pour 30ml Vodka, 1 teaspoon Lime Juice and 1 Teaspoon Triple Sec into it. Shake the ingredients thoroughly, until the mixture becomes hazy white and frosted. Strain and pour the mix into a chilled Martini Glass. Garnish the drink with a lime peel. Other sweet liqueurs or Curacao Liqueurs can also be used instead of Triple Sec."},
{"name": "Vesper Martini Cocktail", "ingredients": "90ml Dry Gin; 30ml Vodka; 15ml Lillet; Cracked Ice", "description": "This cocktail is served shaken in a Martini Glass. Fill a Cocktail Shaker with lots of cracked ice and add 3 parts of Dry Gin, 1 part of Vodka and half part of Lillet to the mix. Shake the ingredients thoroughly, until the Shaker becomes misted from the outside. Strain and pour the mix into a chilled Martini Glass. Garnish the cocktail with a lime peel or an Olive."},
{"name": "Woo Woo Cocktail", "ingredients": "Cracked Ice; 20ml Vodka; 20ml Peach Schnapps; 40ml Cranberry Juice; Cape gooseberry to decorate", "description": "This cocktail is served built-up in a Highball Glass. Take a chilled Highball Glass and half fill it with cracked ice. Pour the mentioned measures of Vodka, Peach Schnapps and Cranberry Juice into the glass. Stir the ingredients thoroughly, until the drink develops a light orange hue. Garnish the mix with a cape gooseberry and lime peels. You can use Pernod, instead of Peach Schnapps to make this concoction sweet."},
{"name": "Cool Yule Martini", "ingredients": "20 ml vodka; 10 ml of dry vermouth; 2 tsp peppermint schnapps; Ice; Fresh mint spring to decorate", "description": "Shake the liquid ingredients over ice until well frosted. Strain into a chilled cocktail glass and dress with a spring of mint. Serve Cool Yule Martini Vodka Cocktail chill."},
{"name": "Blue Monday", "ingredients": "Cracked Ice; 1 part vodka; 1/2 part cointreau; 1 tablespoon blue curaao", "description": "Put the cracked ice into a mixing glass or jug and pour in the vodka, cointreau and curaao. Stir well and strain into a cocktail glass. Serve Blue Monday Vodka Cocktail Recipe chill."},
{"name": "Wine Spritzer Cocktail", "ingredients": "To make the wine spritzer cocktail, you would need:; Four Seasons Red or White Wine; (about 120 ml); Chilled club soda or sparkling water (about 60 ml); Fruits to garnish; Some Ice", "description": "To prepare the cocktail, you need to half fill a glass with ice, crushed or cube. Add chilled Four Seasons Red Wine or White Wine, whichever you prefer more, to the glass. Add chilled club soda or sparkling water to the mix. You can garnish the cocktail or give it an appealing touch by adding some fruits into the drink. This wine spritzer cocktail recipe is easy to make and can be prepared within a few minutes, making it the perfect drink to be served at house parties."},
{"name": "Toast To Pals", "ingredients": "45ml - McDowell's No. 1; 20ml - Ginger Lime Cordial; 10ml - Lime Juice (lemoneeze); Soda; Sprite", "description": "Freshly squeezed ginger and lime juice mixed with lemoneeze, topped with soda and sprite, finished with McDowell's No. 1 whisky. Serve Toast to Pals Scotch and Whisky Cocktail chill."},
{"name": "The Awol Cocktail", "ingredients": "1 part melon liqueur, iced; part lime juice, chilled; part vodka, iced; part white rum, iced; Ice", "description": "This tropical cocktail is served chilled in a Martini Glass. Take a Cocktail Shaker and fill it with lots of ice and pour the mentioned quantities of Melon Liqueur, Lime Juice, Vodka and White Rum into it. Stir the ingredients vigorously, until the mix becomes light green in colour. Strain and pour the mix into a chilled Martini Glass. Garnish the cocktail with lime wedges and cherries."},
{"name": "Set Alight", "ingredients": "Signature Premier Whisky - 45ml; Monin Passion Fruit Syrup - 15ml; Monin Peach Iced Tea - 15ml; Lime Juice - 15ml; Soda - Topped; Glass - Collin Glass; Garnish - Mint and orange wedge", "description": "Fill the collins glass with ice. Pour 45ml Signature Premier Whisky. Follow it up with the passion fruit and peach iced tea syrup. And then, add some lime juice and soda. Add the stirrer straw and garnish with an orange wedge to complete the cocktail. Serve Set Alight Scotch and Whisky Cocktail chill."},
{"name": "McDowell's No1 Fizzky", "ingredients": "McDowells No. 1 Whisky  240 ml; Soda  600 ml; Coke  120 ml; Ice  16 to 20 cubes; Lime Wedge  1 no; Salt  pinch", "description": "4 Old Fashioned glasses are placed in the tray/holder, glasses filled with 4-5 cubes of ice each.Pitcher is filled with McDowells, soda and coke.Lime wedge is coated with pinch of salt Service Ritual Tray/holder placed in the centre of table along with the pitcher. Either server or guest drops lime wedge coated with salt into pitcher. This causes an immediate release of fizz in the pitcher indicating that the drink is ready to be served Drinks are poured over ice in each glass. Clink the glasses & enjoy"},
{"name": "Zingria", "ingredients": "1 liter jug of ice cubes; 90 ml vodka; Wine; 1 can of Sprite / 7UP; 1 cup of chopped fruits (your choice); 4 cinnamon sticks; 10 cloves; Glass - Tall", "description": "Take the jug filled with ice cubes. Pour in vodka and a can of Sprite or 7UP. Toss in chopped fruits (apples, orange, grapes or whatever you like!) and top up the jug with wine. Add in large cinnamon sticks and cloves. Garnish with a slice of citrus and serve in a tall glass. Yummy!"},
{"name": "Pina Vina", "ingredients": "120 ml white wine; 15 ml lemon juice; 100 gm pineapple chunks", "description": "Blend the whole lot until smooth. Pour into a wine glass and garnish with a pineapple chunk and a slice of lemon. Serve Pina Vina Wine Cocktail chill."},
{"name": "Zinzito", "ingredients": "1 liter jug of ice cubes; 90 ml vodka; White wine; 1 can of Sprite; Mint leaves and sprigs; Crushed ice; Glass - Tall", "description": "Take the jug filled with ice cubes. Pour in vodka and Sprite. Toss in a cup of crushed / muddled mint leaves and top up the jug with wine. Add crushed ice. Garnish with mint sprigs and serve... Serve chilled!"},
{"name": "Zinshots", "ingredients": "30 ml vodka; 60 ml wine; Glass  Shot glass", "description": "Get those shot glasses (90ml) out. Pour out a small measure (30ml) of vodka and 60ml of wine. Knock back! You could also pour the shot onto an ice lolly or even freeze the shot and serve Zinshots Wine Cocktail chill."},
{"name": "Chill Pill", "ingredients": "60 ml white wine; 2 ginger slices; Pineapple chunks; 1 tsp ginger syrup; Half lime squeezed; Pineapple stick and lemon leaf for garnishing; Crushed ice", "description": "Use a shaker to muddle ginger, pineapple & ginger syrup. Pour some fresh lime juice and shake. Strain into a glass filled with crushed ice and top up with sparkling white wine. Garnish with pineapple stick and the lemon leaf. Serve Chill Pill Wine Cocktail Drink chill."},
{"name": "Silver Berry", "ingredients": "10 ml raspberry vodka, iced; 10 ml cassis, iced; 10 ml Cointreau, iced; Frozen berry to decorate", "description": "Carefully layer the first three liqueurs in the order that they listed. Once they settle gently drop a berry to decorate. Serve Silver Berry Vodka Cocktail chill."},
{"name": "Bali Hai Cocktail", "ingredients": "30ml Light Rum; 10ml Lime Juice; 1 tsp Orgeat Syrup; 1 tsp Grenadine Syrup; Sparkling White Wine", "description": "This cocktail is served shaken in a Highball Glassfilled with lots of ice cubes. Take a Cocktail Shaker and fill it with 4 to 5 ice cubes. Pour the mentioned measures of Light Rum, Lime Juice, Orgeat Syrup and Grenadine Syrup into the Shaker. Shake the ingredients vigorously and pour the mix into a Collins Glass. Drop 3 to 4 ice cubes into the glass and top up the cocktail with Sparkling Wine."},
{"name": "80s Wine Cooler", "ingredients": "60 ml white wine; 50 ml 7-Up soda; 20 ml grapefruit juice; 20 ml pineapple juice; 20 ml lime juice; 20 ml lemon juice", "description": "Mix lemon, lime, grapefruit and pineapple juice together in a mixing glass. Pour white wine into a tall cocktail glass and top up with 7-Up. Add the juice mixture, and serve 80S Wine Cooler Cocktail Recipe chill."},
{"name": "Chocolate Diva", "ingredients": "4 squares of good quality milk melted chocolate; 20 ml vodka; 10 ml crme de cacao; 1 tablespoon fresh orange juice", "description": "Mix the melted chocolate gently with the liqueur and the juice until well blended. Pour into a cocktail glass and serve Chocolate Diva Vodka Cocktail Drink chill."},
{"name": "Brain Storm", "ingredients": "1 part Signaturewhisky; 2 dashes Benedictine; 2 dashes of dry vermouth", "description": "Stir the ingredients together with ice in a shaker or jug and strain into a cocktail glass. Decorate with a twist of orange peel. Serve Brain Storm Scotch and Whisky Cocktail Recipe chill."},
{"name": "Cowboy", "ingredients": "2 parts whisky; 1 part double cream", "description": "Shake the ingredients together vigorously with cracked ice and strain into a cocktail glass. Serve Cowboy scotch and whisky cocktail recipe chill."},
{"name": "Bishop’s Cocktail", "ingredients": "60ml Four Seasons Wine; 40ml Orange Juice; 30ml Lemon Juice; 1 tsp Powdered Sugar", "description": "This drink is served shaken with ice cubes. Fill the Mixing Glass with 3 to 4 ice cubes and pour the mentioned measures of fruit juices and sugar into it. Shake the ingredients thoroughly, until the mix becomes golden orange in colour. Strain and pour the ingredients into a Highball Glass. Drop 2 ice cubes in the glass and pour Wine into the cocktail. Stir the ingredients, until the cocktail gets an orange hue. Garnish the drink with a lime wedge or a Maraschino Cherry."},
{"name": "Empire Glory", "ingredients": "30 ml whisky; 15 ml ginger wine; 15 ml lemon juice; 2 dashes grenadine syrup; Glass: Cocktail", "description": "Pour all ingredients into a cocktail shaker half-filled with ice cubes. Shake well, strain into a cocktail glass and serve Empire Glory Scotch and Whisky Cocktail chill."},
{"name": "Last Mango in Paris", "ingredients": "20 ml vodka; 10 ml raspberry liqueur; 10 ml fresh lime juice; 1/2 fresh mango, peeled, pitted, and chopped; 2 fresh strawberries, hulled and halved; Fresh slice of lime, for garnish; 1 whole fresh strawberry, for garnish", "description": "Blend vodka, raspberry liqueur, fresh lime juice, fresh mango, and fresh halved strawberries until it gets slushy. Pour it in a chilled cocktail glass and decorate using a slice lime and garnish with fresh strawberry. Serve Last Mango In Paris Vodka Cocktail chill."},
{"name": "Seeing Red Cocktail", "ingredients": "10 ml Vodka; 10 ml Peach Schnapps; 30 ml Cranberry Juice; Crushed Ice; Soda; Frozen cranberries to garnish", "description": "This cocktail is served shaken and topped up with soda water. Take a Cocktail Shaker and fill it with lots of ice. Pour mentioned quantities of Vodka, Peach Schnapps and Cranberry Juice into the Shaker. Shake the ingredients vigorously, until the drink becomes light pink or pinkish red in colour. Strain and pour the mix into a chilled Martini Glass. Top up the drink with Soda and garnish with frozen cranberries."},
{"name": "Road Runner", "ingredients": "1 part Smirnoff Vodka; part white rum; part amaretto; Ice", "description": "Shake all the liquid ingredients vigorously over ice until well frosted. Strain into a chilled cocktail glass and sip carefully! Serve Road Runner Vodka Cocktail chill."},
{"name": "Black Swan", "ingredients": "30 ml Vodka; 10 ml Black Raspberry liqueur; Lemon twist for garnish", "description": "This cocktail is served shaken, not stirred. Fill a cocktail shaker with 3 to 4 ice cubes or crushed ice. Carefully pour the stated quantity of Vodka and Raspberry liqueur in the shaker, and mix the ingredients rigorously for about 3 minutes. Raspberry liqueur takes time to blend well with other spirits. So, shake the ingredients thoroughly, until you get a uniform, light pink colour. Strain and pour the mix carefully in a chilled Cocktail or Martini glass. If Black Raspberry Liqueur is not available, then you can also use 20 ml Raspberry juice along with 45 ml Vodka. Garnish the drink by sticking a lemon wedge on the rim of glass or by dropping a piece of fresh raspberry in it."},
{"name": "Classic Martini", "ingredients": "20 ml Smirnoff Vodka; cup dry vermouth; 4 green olives; Ice", "description": "Blend the Smirnoff Vodka and ice in a shake. Pour it into the martini glass and add dry vermouth. Decorate with green olives. Serve Classic Martini Cocktail Drink chilled."},
{"name": "Bay Breeze", "ingredients": "15 ml vodka; 50 ml pineapple juice; 50 ml white cranberry and apple juice; Ice; Tonic water; Lime and pineapple slices to decorate", "description": "Shake the first three ingredients well over ice until frosted. Strain into a tall glass and top up with tonic to taste. Dress with slices of lime and pineapple. Serve Bay Breeze Vodka Cocktail chill"},
{"name": "Is That All?", "ingredients": "2 ml vodka; 1 ml triple sec; 1 ml fresh lime juice; 1 ml egg white; Cracked ice", "description": "Shake the liquid ingredients with the egg white over ice until well frosted. Strain into a chilled cocktail glass to serve your guests."},
{"name": "Like Lighting", "ingredients": "10 ml vodka; 10 ml kmmel; Ice; Tonic water; Red berries, to decorate", "description": "Stir the vodka and kummel together with ice in a tall glass. Top up with tonic water to taste and dress it up with berries. Serve Like Lighting Vodka Cocktail chill."},
{"name": "Rompope Cocktail", "ingredients": "350 ml Sweetened Condensed Milk; 300 ml Chilled Milk; 4 Egg Yolks; 1/4 tsp Vanilla Extract; 150 ml Vodka; 1/4 tsp Cinnamon Powder for Dusting; Cinnamon stick to decorate", "description": "This milky cocktail is served shaken in a Martini Glass. Pour lots of ice in a blender and add the mentioned quantities of Milk, Egg Yolks, Vanilla Extract and Vodka to it. Blend the ingredients, on high, for about 45 seconds. Strain and pour the ingredients into a Martini Glass. Garnish the cocktail by dusting Cinnamon Powder on it. Embellish the mix with a Cinnamon Stick. Make your party special with different types of Vodka Cocktail Drinks. Get the best and easy Vodka drink recipes at LiveInStyle."},
{"name": "Mc Ginger Cooler", "ingredients": "Ingredients:; 45ml of McDowells No.1 Whisky; 20ml Ginger lime cordial; Dash of Soda and Sprite; 10ml Lime Juice; Recommended Glass: Old Fashioned Glass", "description": "Mix above all ingredients. Serve Mc Ginger Cooler Scotch and Whisky Cocktail chill."},
{"name": "McPineapple & Aniseed Sour", "ingredients": "Ingredients:; 45ml; McDowells; No.1 Whisky; 30ml Pineapple Juice; 1 bar spoon Aniseed; 30ml Sour Mix", "description": "Mix all the ingredients. Be sure that it has a muddled look, then shake it and strain it. Recommended Glass: Tom Collins Glass"},
{"name": "Mcpirojka", "ingredients": "45ml of McDowells No.1 Whisky; 4 Pcs of orange chunks; 8-10 mint leaves; 60ml Cranberry juice; 10ml sugar syrup; Method: Muddled", "description": "Muddle orange chunks and mint leaves in an Old Fashioned Glass. Fill it with ice and pour McDowells Whisky. Top it up with Cranberry Juice, sugar syrup and stir it. Garnish it with slice of orange. Serve Mcpirojka Scotch and Whisky cocktail chill."},
{"name": "Ginger Champagne Cocktail", "ingredients": "1/2 cup chopped fresh ginger; 2/3 cup plus 2 tablespoons sugar; 1/4 teaspoon Chinese five-spice powder; 3 tablespoons chopped crystallized ginger; 8 whole star anise; 1 bottle (750 ml) Champagne or sparkling wine", "description": "This cocktail is made in two parts. First, take half a cup of water in a saucepan and add half a cup of finely chopped ginger to it. Add 2/3 cup of sugar to this mix and bring it to a boil on a simmer flame. Cook the ingredients, until the mixture thickens to the consistency of Maple Syrup. Turn off the flame and allow the mixture to cool. Take a shallow plate and add 2 teaspoons of sugar and  teaspoon of Chinese five-spice powder to it. Rim the Champagne Flute with the made powder. Pour 1 teaspoon crystallized ginger and 1 Anise star in the rimmed glass. Add 1 teaspoon of the prepared syrup and 30ml Champagne to the glass. Garnish the mix with a mint sprig or a lime wedge."},
{"name": "Pomegranate and Cranberry Bellinis", "ingredients": "1 cup ice; 1 1/2 cups simple syrup; 1 1/4 cups pomegranate juice, chilled; 1 cup cranberry juice, chilled; 1 (750-ml) bottle Four Seasons red wine, chilled; 2 limes, thinly sliced; 1 bunch fresh mint, for garnish; 1/2 cup pomegranate seeds, for garnish", "description": "Place the ice in a 6- to 8-cup punch bowl. Add the simple syrup, pomegranate juice and cranberry juice. Stir well. Slowly pour in the red wine. Garnish with lime slices, mint sprigs and pomegranate seeds and serve. As an alternative to serving from a punch bowl, make the bellini mixture in a 6- to 8-cup pitcher. Divide the pomegranate seeds between 12 champagne flutes, add 1 slice of lime and 1 sprig of mint to each glass, and pour the bellini mixture into the prepared glasses. Serve Pomegranate and Cranberry Bellinis Wine Cocktail chill."},
{"name": "Santa Sangria Cocktail", "ingredients": "2 large Green Apples, cored and cut into thin slices; 2 cups Raspberries; 6 cups Four SeasonsRos Syrup; 1 cup Pomegranate Juice", "description": "This is a built-up cocktail made directly in a Wine Glass. Peel 2 large green apples and carefully cut out the cores. Cut them into fine slices and place them in a Wine Glass. Take a Mixing Glass and pour Rose Syrup and Pomegranate Juice into it. Stir the ingredients thoroughly and pour the mix into the prepared Wine Glass. Garnish the mix with frozen raspberries and chill it in the freezer. Add crushed ice to keep the drink chilled for a longer time."},
{"name": "Amarettine", "ingredients": "10 ml amaretto; 10 ml dry vermouth; Chilled white wine", "description": "Mix the amaretto and vermouth in a chilled tall cocktail glass. Top up with wine to taste. Serve Amarettine Wine Cocktail Drink chill."},
{"name": "Sangria Cocktail", "ingredients": "The Red Wine Sangria recipe includes using:; Four Seasons; Red Wine; a shot of brandy; Ginger ale or club soda; 2 tablespoon of sugar; a bowl of sliced oranges; Lemons and limes; Ice; In case you are planning to make a White Wine Sangria,you will need:; Four Seasons; White Wine; 2/3rd cup sugar or sugar syrup; sliced oranges or orange juice as substitute; sliced lemon and limes; some ginger ale or club soda; lots of ice", "description": "For making a Red Wine Sangria cocktail , mix the red wine and brandy along with the sugar and fruits and refrigerate it. Once the flavours are well blended, you can serve it chilled along with some additional ice if you prefer. You can also add ginger ale or club soda right before serving it to augment the flavours. To make aWhite Wine Sangria cocktail, you would need to squeeze some lime as well as lemon wedges in a pitcher of Four Seasons White Wine. Put the rest of the fruit wedges into the pitcher along with the brandy and sugar. Refrigerate it overnight and serve by adding ginger ale or club soda right before serving with lots of ice. Adding both red and white wineto yourSangria can give it an extraordinary punch."},
{"name": "Negroni", "ingredients": "30 ml gin; 30 ml campari; 30 ml sweet vermouth; Orange twist for garnish", "description": "Fill an old-fashioned glass half to two-thirds full of ice. Add liquid ingredients. Garnish with orange twist. Serve Negroni Gin Cocktail Drink chill."},
{"name": "Maiden’s Prayer", "ingredients": "30 ml gin; 30 orange juice; 1 tsp lemon juice; Lemon peel twist for dressing", "description": "Shake the first three ingredients vigorously over ice until well frosted. Strain into a chilled cocktail glass and dress with a twist of lemon peel."},
{"name": "Gin Martini Cocktail", "ingredients": "A dash of Vermouth; 60 ml Gin; Cocktail olive, to decorate", "description": "This straight-up cocktail is served shaken in a chilled Martini Glass. Fill a Cocktail Shaker with 3 to 4 ice cubes and pour the mentioned quantities of Vodka and Vermouth into it. Shake the ingredients thoroughly, until the drink becomes frosted. Strain and pour the mix into a chilled Martini Glass. Garnish the mix with two olives or a lemon peel."},
{"name": "Singapore Sling", "ingredients": "Gin; - 45 ml; Lime juice - 30 ml; Club soda - 60 ml; Simple syrup - 8 ml; Cherry brandy -15 ml; Powdered sugar, ice cubes,lemon slices, and maraschino for garnish.", "description": "The Singapore Sling Cocktail Recipe is easy to make and takes less than five minutes to prepare. To make the cocktail, add the gin, lime juice, simple syrup, and powdered sugar into a cocktail shaker filled with ice cubes. Shake the contents well and strain it into a glass half-filled with ice cubes. Add club soda into the mix. Take the cherry brandy and pour it into the glass using the back of a spoon. Garnish the drink with a lemon slice and maraschino cherry. You can also make the Singapore Sling Cocktail by adding pineapple juice into the mix and garnish the cocktail with pineapple wedges."},
{"name": "Salted Caramel Old Fashioned ", "ingredients": "60ml Talisker 10 year-old; 10ml Monin Salted Caramel syrup; 2 dashes Angostura Bitters", "description": "Simply add all ingredients to a rocks glass, add cubed ice and stir for around 20 seconds. Then twist the orange peel over the top of the drink as garnish."},
{"name": "Boilermaker", "ingredients": "150 ml draft beer (lighter is best); 45 ml Royal Challenge blended whiskey", "description": "Pour a shot of whiskey in a shot glass. Fill a pint glass with beer. Drop the shot glass into the beer and down everything in one drink. Serve Boilermaker Scotch and Whisky Cocktail chill."},
{"name": "Queen of Memphis", "ingredients": "2 ml bourbon; 1 ml Midori; 1 ml peach juice; Dash of maraschino; Ice; Melon wedge to decorate", "description": "Shake the liquid ingredients vigorously over ice until well frosted. Strain into a chilled cocktail glass and dress with a wedge of melon."},
{"name": "Lime Swizzle", "ingredients": "1 1/2 ml Drambuie; 1/4 teaspoon finely grated zest of lime; 1 teaspoon icing sugar; Few drops lime juice; Ice; Soda water", "description": "Rub the rim of a large glass with Drambuie. Mix the lime zest and sugar and dip the glass rim in this. Stir all the ingredients, including the remaining sugar and zest, together in the glass. Top up with soda water. Serve Lime Swizzle Scotch and Whisky Cocktail chill."},
{"name": "Loch Lomond", "ingredients": "1 1/2 ml whiskey; 1 ml sugar syrup; 3 dashes of Angostura bitters; Ice", "description": "Shake the first three ingredients well over ice and strain into a cocktail glass. Serve Loch Lomond Scotch and Whisky Cocktail chill."},
{"name": "Millionaire Mix", "ingredients": "1 ml rye whiskey; 1/2 ml grenadine; 1/2 ml curaao; 1/2 egg white; Ice; Dash of Prenod", "description": "Shake the first four ingredients well over ice. Strain into a small wine glass and add a dash of Prenod at the last minute. Serve Millionaire Scotch and Whiskey Cocktail chill"},
{"name": "Dandy", "ingredients": "1/2 ml rye whiskey; 1/2 ml Dubonnet; Dash of Angostura; bitters; 3 dashes of cassis; Ice; Few frozen berries", "description": "Mix the ingredients with ice and strain into an inced shot glass. Dress with berries. Serve Dandy Scotch and Whisky Cocktail chill."},
{"name": "Irish Eyes", "ingredients": "Cracked ice; 2 ml Irish whiskey; 1/2 green Chartreuse", "description": "Put some cracked ice into a mixing glass. Pour the whiskey and Chartreuse over the ice. Stir well and strain into a cocktail glass. Serve Irish Eyes Scotch and Whisky Cocktail chill."},
{"name": "The Green Man", "ingredients": "1 ml Irish whiskey; 1/2 ml blue curacao; 1 ml fresh lemon juice; Dash of egg white; Ice cubes", "description": "Shake the first four ingredients with a little ice until well frosted. Pour into a medium-sized tumbler or glass and top up with more ice. Serve The Green Man Scotch and Whisky Cocktail chill."},
{"name": "Cocktail Illusions", "ingredients": "1 measure Smirnoff Vodka; 1 measure coconut rum; measure melon liqueur; measure blue curacao; Ice; Fresh orange juice; Melon slices to decorate", "description": "Stir the first four ingredients over ice until frosted. Strain into a chilled glass or large cocktail or wine glass, and top up with more ice and orange juice to taste. Dress with slices of melon. Serve Cocktail Illusions Vodka Cocktail chill."},
{"name": "Strawberry Kiss", "ingredients": "40 ml whisky; 3 tsp strawberry syrup; 3 strawberries; Crushed ice; Single cream", "description": "Blend the first four ingredients in a blender on low speed for about 10 seconds. Pour into a cocktail glass and gently float the cream on top. Serve Strawberry Kiss Scotch and Whisky Cocktail chill."},
{"name": "Milk Tooth", "ingredients": "1 shot McDowell's No.1 whisky; 1/4 shot creme de cacao; 1/2 shot blackcurrant cordial; 2 shots sweet and sour mix; 1 shot pineapple juice", "description": "Pour McDowell's No.1 whisky, creme de cacao, blackcurrant cordial and sweet and sour into a shaker with ice cubes. Shake well and strain into an iced collins glass. Add pineapple juice, place shaker over the glass and give one hard shake; up and down. Remove shaker and serve Milk Tooth Scotch and Whisky Cocktail chill."},
{"name": "Edinburgh Fizz ", "ingredients": "50ml Glenkinchie 12 year-old; 20ml Martini Bianco Vermouth; 20ml fresh lime juice; 15ml honey; Egg white (optional)", "description": "Add all ingredients to shaker and shake hard with cubed ice. Strain over cubed ice in a highball glass and top with soda water."},
{"name": "Christmas Toddy", "ingredients": "45ml Singleton of Glen Ord 12 year-old; 20ml Red Wine; 30ml Cranberry Juice; 20ml Lemon Juice; 20ml Honey; 100ml Boiling Water", "description": "Add all ingredients into a coffee mug and garnish with an orange wedge and a cinnamon stick. This drink can also be kept warm on the stove and served as your guests arrive"},
{"name": "Pinky Cosmo", "ingredients": "1 1/2 parts Pinky; 1/2 part cranberry juice; 1/4 part triple sec; squeeze of lime juice", "description": "Stir over ice, adding a squeeze of lime. Strain into a chilled martini glass and garnish with a lime twist. Serve Pinky Cosmo Cocktail chill."},
{"name": "Pinky Midnight Mimosa", "ingredients": "1 part Pinky; 1 part champagne; 3-4 blood orange segments(without peels)", "description": "Muddle (crush) the blood oranges with the Pink in a glass. Add ice and shake well. Strain into a champagne flute and then top off with champagne. Garnish with an orange slice. Serve Pinky Midnight Mimosa Vodka Cocktail chill."},
{"name": "Mudslide Cocktail", "ingredients": "30ml Vodka; 30ml Coffee Liqueur; 30ml Irish Cream Liqueur", "description": "This cocktail is served shaken in a chilled Hurricane Glass Take a Cocktail Shaker and fill it with 3 to 4 ice cubes. Pour the mentioned quantities of Vodka, Coffee Liqueur and Irish Cream Liqueur into the shaker. Shake the ingredients thoroughly, until the mix becomes light brown in colour. Strain and pour the mix into a chilled Old Fashioned or Lowball Glass. Garnish the drink with Grated Chocolate."},
{"name": "Glass Slipper Cocktail", "ingredients": "30 ml Gin; 10ml Blue Curacao; Ice; Lime wedge", "description": "This cocktail is served shaken in a Martini Glass. Fill a Cocktail Shaker with lots of ice and pour 30 ml Gin and 10 ml Blue Curacao over it. Shake the ingredients vigorously, until the mixture gets a bluish hue. Strain and pour the ingredients into a Stemmed Glass or a Martini Glass. Rim the glass with powdered sugar and use a lime wedge to garnish. A thin lemon peel and a few drops of Orange Bitters can also be added to the mix. Arrange home party withdifferent types of home made Vodka Cocktails . Get the best and easy Vodka drink recipes at LiveInStyle."},
{"name": "Third Degree", "ingredients": "Cracked ice; 20 ml dry vermouth; 10 ml gin", "description": "Put some cracked ice into a mixing glass. Pour the vermouth over the ice and then pour the gin. Stir well to mix, then strain into a chilled cocktail glass. Serve Third Degree Vodka Cocktail chill."},
{"name": "Peppermint Cosmo", "ingredients": "1 cup pomegranate juice; Juice of 1 lime; 4 ml vodka; 1/4 teaspoon peppermint extract; 8 ice cubes; 8 mini candy canes; 2 tablespoons chopped fresh mint", "description": "Combine juices, vodka, peppermint and 1/2 cup water in a shaker with ice. Shake vigorously and strain into 8 shot glasses. Garnish with candy canes and mint. Serve Peppermint Cosmo Vodka Cocktail chill."},
{"name": "Bloody Mary Martini", "ingredients": "1 medium-sized piece fresh horseradish, peeled and julienned; 20 black peppercorns; 1 pint vodka (there will be leftover vodka); 5 cups chopped ripe tomatoes; 1/2 teaspoon celery salt; 4 celery stalks", "description": "Place horseradish and peppercorns in vodka bottle; seal; chill at least 24 hours. Puree tomatoes; drain with fine-mesh sieve; discard pulp. Add celery salt. Fill a shaker with ice; add 2 ml vodka (not peppercorns or horseradish), 1 ml tomato puree; shake. Strain into martini glass. Garnish with celery stalk. Serve Bloody Mary Martini Vodka Cocktail chill."},
{"name": "The Legendary Martini", "ingredients": "60 ml vodka; 30 ml creme de mure ( blackberry liqueur); 30 ml fresh squeezed lime juice; A dash of sugar syrup", "description": "Add all the ingredients and shake sharply. Strain into an ice-filled martini glass and serve The Legendary Martini Vodka Cocktail chill."},
{"name": "Barbed Wire", "ingredients": "3 measures vodka; 1 tsp sweet vermouth; 1/2 tsp pernod; 1/2 measure dry sherry; Ice; Lemon peel twist, to decorate", "description": "This Vodka based cocktail is served shaken. Fill a Cocktail Shaker with lots of ice and then add 90ml Vodka, 15ml Dry Sherry, a teaspoon of Sweet Vermouth and half a teaspoon of Pernod to it. Shake the mix vigorously until the outside of the shaker become frosted. Strain and pour the cocktail into a chilled Martini Glass. Cracked ice will chill the drink faster. A peel of lemon can be added to the glass to decorate the cocktail."},
{"name": "Full Monty", "ingredients": "1 measure SmirnoffVodka; 1 measure Galliano; Cracked ice; Grated ginger or ginseng root", "description": "Shake the vodka and Galliano vigorously over ice until it is well frosted. Strain into a chilled cocktail glass and sprinkle with the ginger or ginseng. Serve Full Monty Vodka Cocktail chill."},
{"name": "Coconut Breeze", "ingredients": "30 ml Black Dog whisky; 60 ml coconut milk; Crushed ice; Tender coconut pieces", "description": "Pour coconut milk, tender coconut pieces over whisky and shake well. Pour into a cocktail glass and top with crushed ice. Serve Coconut Breeze Scotch and Whisky Cocktail chill."},
{"name": "Bloody O.J", "ingredients": "50 ml Signature whiskey; 50 ml orange juice; 50 ml tomato juice; 1 dash soda water", "description": "Pour ingredients over two crushed ice cubes in an old-fashioned glass. Stir, and decorate with a bloody glove if available. Serve Bloody O.J Scotch and Whisky Cocktail chill."},
{"name": "Prince Charming", "ingredients": "15 ml Drambuie; 15 ml cognac; 15 ml fresh lime juice", "description": "This cocktail is served stirred in an iced Cocktail Glass. Fill the shaker with 3 to 4 ice cubes and add the mentioned quantities of spirits to it. Stir the ingredients briskly, until the outside of the shaker becomes frosted. Ensure that the mix has developed its signature golden brown colour. Strain and pour the mix into a chilled Martini Glass. You can garnish the cocktail with a lime wedge, but it is best served straight, without any garnish. A Pineapple spear can also be used as a garnish. Read more interesting information on Cocktails & Cocktail recipes inour cocktail directory"},
{"name": "Scottish Nightcap", "ingredients": "1  cups of pale ale; 1 teaspoon cocoa powder; 4 tablespoon whiskey; 2 egg yolks; 1 tablespoon sugar", "description": "Heat ale with cocoa powder until it start boiling in a double boiler. Whisk the egg yolks with the sugar and then gradually whisk into the hot ale. Serve Scottish Nightcap Scotch and Whisky Cocktail chill."},
{"name": "Love Potion", "ingredients": "2 pineapples, peeled and cubed; 1 kg sliced strawberries; 2 bottles (750 ml each) Vladivar vodka; 88 ml of love potion infusion; Mango pulp; Lemon slice", "description": "To make the love potion infusion: Layer fruit in a glass infusion jar. Add vodka. Save liquor bottles. Let rest for 7 days at room temperature. Using a sieve and funnel, strain liquid back into original bottles. Store in the refrigerator. To make cocktail: Add infusion into mixing glass. Shake well with ice. Strain into a martini glass. Garnish with a lemon slice. Serve Love Potion Cocktail chill."},
{"name": "Le Feu Rose", "ingredients": "1 part Pinky; 1 part St-Germain; splash of pomegranate; grenadine syrup; splash of fresh lemon juice", "description": "Fill shaker with ice and pour equal parts of Pink and St-Germain. Add a splash of pomegranate, grenadine syrup, along with a splash of fresh lemon juice. Shake well and pour into a rocks glass. Serve Le Feu Rose Vodka Cocktail chill."},
{"name": "The Apple Teaser", "ingredients": "15 ml Signature whiskey; 15 ml amaretto; 15 ml Calvados; A dash of grenadine; 10 ml apple juice; Ice; Soda recipe; Apple slice to decorate", "description": "Shake the first five ingredients together over ice until well frosted. Strain into a highball glass filled with ice and top up with a little soda water. Dress with a slice of apple. Serve The Apple Teaser Scotch and Whisky Cocktail chill."},
{"name": "Burbon Milk Punch", "ingredients": "2 ml bourbon; 2 ml milk; 1 teaspoon clear honey; Dash of vanilla extract; Ice; Freshly grated nutmeg to decorate", "description": "Shake the bourbon, milk, honey and vanilla extract over ice until well frosted. Strain into a chilled tumbler and sprinkle with freshly grated nutmeg. Serve Burbon Milk Punch Scotch and Whisky Cocktail chill."},
{"name": "Baccarat", "ingredients": "1 ml whiskey; 1 ml Dubonnet; 2 dashes of cassis; Ice", "description": "Shake the liquid ingredients vigorously over ice until frosted. Strain into a chilled cocktail glass. Serve Baccarat Scotch and Whisky Cocktail chill."},
{"name": "Sazerac", "ingredients": "Ice cubes; 1 teaspoon sugar syrup; 3 dashes of Angostura bitters; 20 ml rye whiskey; 1 teaspoon anise; Lemon peel strip", "description": "Fill a tumbler or cocktail glass with ice cubes to chill well. Mix the sugar syrup, bitters and whiskey until well blended. Empty the ice out of the glass, swirl the anise around the inside of the glass to coat lightly, and drain off any excess. Pour in the whiskey mix. Rub the strip of lemon peel along the rim, then add to the glass. Serve Sazerac Scotch and Whisky Cocktail chill."},
{"name": "Colleen", "ingredients": "2 ml Irish whiskey; 1 ml Irish mist; 1 ml triple sec; 1 teaspoon lemon juice; Ice", "description": "Shake the liquid ingredients vigorously over ice until frosted. Strain into a chilled cocktail glass. Serve Colleen Scotch and Whisky Cocktail chill."},
{"name": "Pitch Dark Cocktail", "ingredients": "60 ml Black Dog Whisky; 60 ml Coke; Dash of Grenadine; Ice", "description": "This is a built-up cocktail served in an Old Fashioned Glass. Fill an Old Fashioned Glass or Highball Glass with cracked ice. Pour 60 ml Whisky into the Glass and top it up with Coke. Pour a few drops of Grenadine in the mix and give it a light stir. Crushed ice can be used to chill the drink faster. You can also replace the Whisky with Rum or Brandy."},
{"name": "Margarita Cocktail", "ingredients": "To make the; margarita cocktail; , you would require tequila (about 45 ml), Cointreau or triple sec (about 15 ml), fresh lime juice (about 30 ml), lime wedges, salt or sugar to apply on the rim of the glass, and some ice cubes.", "description": "The classic margarita recipe is pretty simple to make. To add an exciting touch to your cocktail, you salt the rim or substitute the salt with sugar by taking a chilled margarita glass and rubbing the rim of the glass with a lime wedge. Invert the glass into a plate full of salt or icing sugar. Separately, take a few ice cubes in a shaker and add the tequila, Cointreau or triple sec, and fresh lime juice along with the ice. Shake the contents well and strain it into the glass you prepared. Garnish the cocktail with a lime wedge."},
{"name": "Mysterious Cosmo", "ingredients": "50 ml Smirnoff Strawberry; 45 ml Ginseng Vodka; 30 ml Cranberry Juice; 10 ml Lime juice", "description": "Fill a cocktail shaker with ice and pour in all the ingredients. Now shake well! Done? Now strain the contents into a chilled martini glass. Garnish with freshly cut strawberries or a lime wedge. And it's ready to serve Mysterious Cosmo Vodka Cocktail chill."},
{"name": "White Russian Cocktail Recipe", "ingredients": "To make a; White Russian Cocktail; , you need some coffee liqueur (about 20 ml), Smirnoff Vodka (about 50 ml), fresh cream (about 50 ml), and some ice. You can also use milk as substitute due to its easy availability compared to fresh cream.", "description": "The White Russian Cocktail Recipe is simple to make with the least number of ingredients required. To make the cocktail, you need to pour the coffee liqueur along with the vodka into an Old Fashioned glass filled with ice. Add some fresh cream on top of the mix and stir slowly. With a light caramel colour, the delicious cocktail would make for a wonderful drink to savour anytime of the day. You can also change the proportion of the contents according to your preference to make the perfect drink for you to relish."},
{"name": "Appletini", "ingredients": "Smirnoff; Vodka-40 ml; Apple Schnapps or Calvados -15 ml; Triple sec -15 ml; Ice; Apple slices or cherries to garnish.; Essentially, you need to add 3 parts of the vodka, 1 part apple schnapps or calvados, and triple sec to make the appletini cocktail. This ratio can come in handy if you intend to make a larger amount. If you want, you can also forego the triple sec by adding 40 ml of Smirnoff Vodka along with 30 ml of apple juice, apple cider, or apple pucker.", "description": "The appletini cocktail recipe is simple and absolutely easy to make. Add the ice (preferably crushed), Smirnoff Vodka, apple schnapps or calvadosand triple sec in a cocktail shaker. Shake it well and pour the contents into a chilled glass using a strainer. The chilled glass will ensure that the drink remains cool even without the ice. Garnish the cocktail with an apple slice of cherries, giving it the perfect touch. Your delightful appletini cocktail will be ready in no time."},
{"name": "Blue Lagoon Cocktail", "ingredients": "50 ml White Mischief Vodka; 200 ml Blue Curacao; 100 ml Lemonade; 1 orange slice; Ice cubes", "description": "In a cocktail shaker, combine all the ingredients in the defined quantity along with some ice cubes. Give it a nice shake and serve it in a Highball Glass or a Martini Glass. Garnish the brim with an orange slice. Make your party special with different types of Vodka Drinks . Get the best and easy Vodka recipes at LiveInStyle."},
{"name": "Tangy Bang", "ingredients": "60 ml vodka; 1 splash Raspberry liqueur; 180 ml orange juice", "description": "Shake up the orange juice and vodka in a shaker with ice. Splash in a drop of Raspberry liqueur. Serve Tangy Bang Vodka Cocktail chill. Mmmmenjoy!"},
{"name": "Vodkatini Cocktail", "ingredients": "1 measure Vodka; Ice; Dash dry Vermouth; Lime peel twist to garnish", "description": "This cocktail is served shaken and chilled in a Martini Glass. Take a Cocktail Shaker and fill it with lots of ice. Pour the mentioned quantities of Vodka and Dry Vermouth into the shaker. Shake the ingredients thoroughly, until the shaker becomes frosted from the outside. Strain and pour the mix into a chilled Martini Glass. Garnish the mix with a Pitted Cocktail Olive. You can also use a lemon peel as a garnish."},
{"name": "Island Girl Cocktail", "ingredients": "45 ml Vodka; 120 ml Guava Juice; 1 splash Cranberry Juice; 1 dash Orange Juice", "description": "This is a built-up cocktail served chilled in a Highball Glass. Take a Highball Glass or Tall Glass and fill it with 3 to 4 ice cubes. Pour 45ml Vodka, 120ml Guava Juice, a splash of Cranberry Juice and a dash of Orange Juice into it. Stir the ingredients thoroughly, until the cocktail develops a yellowish-orange hue. Garnish the mix with a lime wedge Mint sprigs and orange slices can also be used to garnish."},
{"name": "Chilly Willy Cocktail", "ingredients": "30 ml Melon liqueur; 30 ml Coconut Rum; 20 ml Peach Schnapps; Orange Juice; Pineapple Juice", "description": "This is a shaken cocktail served in a Hurricane Glass. Take a Cocktail Shaker and fill it with lots of cracked Ice. Pour the mentioned quantities of Melon Liqueur, Rum and Peach Schnapps into the shaker and shake the ingredients vigorously. Add Orange and Pineapple juice to the mix and shake the ingredients until the mix develops a greenish yellow hue. Strain and pour the mix into a Hurricane Glass and garnish it with a lime wedge. Some bartenders use Apple Juice instead of Pineapple Juice."},
{"name": "Blood And Sand", "ingredients": "10 ml Signature whiskey; 10 ml cherry brandy; 10 ml red vermouth; Ice; Orange juice", "description": "This fruity cocktail is served shaken. Fill a Cocktail Shaker with 3 to 4 ice cubes and pour the three spirits into it. Shake the ingredients thoroughly, until the shaker becomes frosted from the outside. Strain and pour the ingredients into a Medium Tall Glass or Collins Glass. Top up the mix with lots of Orange juice. Garnish the cocktail with pieces of orange. The orange juice poured on top of the shaken spirits gives this cocktail a layered look."},
{"name": "American Style Cocktail", "ingredients": "45ml Vodka; 150ml Cola; 150ml Orange juice; 30ml Raspberry Cordial", "description": "This cocktail is served built-up in a Tall Glass or Highball Glass. Take a chilled Highball Glass and pour 3 to 4 ice cubes and 150ml Colainto it. Gently add Orange Juice and Vodka to the mix and stir the ingredients lightly. Avoid giving a vigorous stir as the coke will bubble and spill over. Pour Raspberry Cordial over the stirred mix and garnish it with a lime wedge."},
{"name": "Afterglow", "ingredients": "30 ml vodka; 15 ml Triple Sec; Splash of Grape fruit juice; Cranberry juice", "description": "This is a built up drink made directly in a Tall Glass. Fill the Tall Glass with ice cubes till the brim and add 45ml Vodka to it. Gently pour 15ml Triple Sec and a splash of Grapefruit juice into the mix. Dilute the drink further by filling the glass with Cranberry Juice. Drop a stirrer and a straw and garnish the mix with an orange wedge. For a more concentrated version, you can use Highball Glass instead of Tall Glass. You can also use pineapple slices as a garnish. Make your party special with different types of Vodka Cocktails . Get the best and easy Vodka drink recipes at LiveInStyle."},
{"name": "Flirtini", "ingredients": "30 ml Smirnoff vodka; 30 ml Cointreau; 1 tablespoon pineapple juice; 3 teaspoons champagne; Pieces of fresh pineapple; Red cherries", "description": "Pour vodka, pineapple juice and cointreau into a martini shaker. Add ice, shake well and strain into a chilled martini glass. Garnish with pineapple pieces and cherries on a cocktail pick and serve Flirtini Vodka Cocktail chill."},
{"name": "Mars Explosions", "ingredients": "60 ml Orange juice chilled; 40 ml Vodka, frozen ice; 1 dash grenadine, chilled cocktail cherry and orange slice to decorate", "description": "Stir the orange juice and vodka over ice until well frosted. Strain into a chilled goblet or wine glass. Stir the rum and grenadine together and pour slowly into the middle of the juice so the red color spreads gently outwards. Dress with a cocktail cherry and a twist of orange peel. Serve Mars Explosions Vodka Cocktail chill."},
{"name": "Bloody Caesar", "ingredients": "30 ml vodka; Pepper; Salt; Celery salt; 1 dash Worcestershire sauce; 1 dash Tabasco sauce; Clamato juice", "description": "Take a tall glass with a little celery salt, fill it with ice and other ingredients. Garnish with a celery stick, straw & lime. Serve Bloody Caesar Vodka Cocktail chill."},
{"name": "White Whiskey", "ingredients": "1 ml bourbon; A dash of crme de menthe; A dash of white curaao; A dash of Angasutra bitters; Sugar syrup for taste; Ice cubes; Mint leaves for decorating", "description": "Shake the liquid ingredients over ice until frosted and strain into a chilled cocktail glass. Dress with mint. Serve White Whiskey Cocktail Drink chill."},
{"name": "Boston Sour", "ingredients": "1 ml lime juice; 2 ml blended whiskey; 1 teaspoon sugar syrup; 1 egg white; Ice; Lemon slice and cocktail; cherry to decorate", "description": "Shake the ingredients over ice and strain into a cocktail glass. Dress with a lemon slice and a cocktail cherry. Serve Boston Sour Scotch and Whisky Cocktail Drink chilled."},
{"name": "19th Green", "ingredients": "1 1/2 measure Irish whiskey; 1 measure green curacao; Ice dry ginger ale", "description": "Stir the whiskey and curaao in a number with the ice. Top up with some ginger ale.Serve this 19 th green Scotch and Whisky Cocktail chilled."},
{"name": "French Kiss", "ingredients": "2 ml bourbon; 1 ml apricot liqueur; 1 teaspoon grenadine; 1 teaspoon lemon juice; Ice", "description": "Shake the ingredients vigorously over ice until well frosted. Strain into a chilled cocktail glass. Serve French Kiss Scotch and Whisky Cocktail chill."},
{"name": "Mammy", "ingredients": "Juice and zest of 1 lime; 2 ml whiskey; Ice; Ginger ale; Lime peel strips for decoration", "description": "Remove some long shreds of lime zest. Stir the lime juice and whiskey over ice in a highball glass and top up with ginger ale. Dress with lime peel. Serve Mammy Scotch and Whisky Cocktail chill."},
{"name": "Irish Cow", "ingredients": "250 ml milk; 2 ml whiskey; 1 teaspoon icing sugar", "description": "Heat the milk in a small boiling point. Remove from the heat and pour into a warmed punch glass. Pour in the whiskey and sugar. Stir until sugar is dissolved. Serve Irish Cow Scotch and Whisky Cocktail chill."},
{"name": "Thistle", "ingredients": "Cracked ice; 2 dashes Angostura Bitters; 30 ml Black Dog Scotch Whiskey; 10 sweet vermouth", "description": "This is a classic cocktail served stirred in an Old Fashioned Glass. Put lots of cracked ice in a mixing glass and pour 2 Dashes of Angostura Bitters into it. Pour the mentioned quantities of Scotch and sweet Vermouth into the mix. Stir the mix vigorously, until the outer surface of the Mixing Glass becomes frosted. Strain and Pour the mix into a chilled Shot Glass or an Old Fashioned Glass. Cracked ice is used to chill the drink faster."},
{"name": "Whiskey Rickey", "ingredients": "2 ml whiskey; Dash of lime juice; Cracked ice; Soda water; Lime slice to decorate", "description": "Pour the whiskey and lime juice over the ice into a chilled highball glass. Top up with soda water. Stir gently to mix and dress with a slice of lime. Serve Whiskey Rickey Cocktail chill."},
{"name": "Southern Orange", "ingredients": "60 ml Southern Comfort; 60 ml gin; 60 ml orange curaao; 60 ml orange juice; Ice cubes; Ginger ale", "description": "Mix the first four ingredients together well and chill until required. When ready to serve pour measures into chilled tumblers or glasses filled with ice cubes and top up with ginger ale. Serve Southern Orange Scotch and Whisky Cocktail chill."},
{"name": "Absolutely Bananas", "ingredients": "50 ml vodka; 50 ml banana liqueur; 50 ml pineapple juice", "description": "Shake well with ice, strain into a chilled cocktail glass, and serve Absolutely Bananas Vodka Cocktail chill."},
{"name": "Spotted Bikini Cocktail", "ingredients": "1 ripe Passion Fruit; 60 ml Vodka; 30 ml Cold Milk; Juice of  a Lemon; Ice; 1 Slice of Lemon peel and a Cherry to decorate", "description": "This cocktail is served shaken and garnished with passion fruit pulp. Pour 3 to 4 ice cubes into a Cocktail Shaker and then add 60ml Vodka, 30ml Cold Milk and Lemon Juice to it. Shake the ingredients vigorously, until the concoction becomes hazy white. Strain and pour the mix into a Chilled Martini Glass. Add a scoop of passion fruit pulp to the drink. Allow the pulp to settle at the bottom of the glass. Garnish the drink with a lemon peel."},
{"name": "Vodka Collins", "ingredients": "30 ml vodka; Juice of 1 lime; 1 teaspoon caster sugar; 1 soda", "description": "Pour vodka, juice of lime and caster sugar into a cocktail shaker. Add ice, shake well and strain into a tall glass. Add soda to top up along with lime slices and a cherry for garnish. Serve Vodka Collins Cocktail chill."},
{"name": "Flaming Ferrari Cocktail", "ingredients": "60 ml Vodka; 30 ml Cold Coconut cream; 30 ml Grenadine Syrup", "description": "This is a built-up cocktail served alighted in a Martini Glass. Take a Martini Glass and pour 60 ml Vodka into it. Set the Vodka ablaze and allow the flame to subside. Once the flame dwindles, pour 30 ml Coconut Cream in the Glass. Add 30 ml Grenadine Syrup to the mix and give it a light stir. You can also use an Old Fashioned Glass to make this refreshing concoction."},
{"name": "New Yorker", "ingredients": "20 ml Royal Challenge whiskey; Dash of limes juice; 10 ml grenadine; Ice; Orange peel twist to decorate", "description": "This cocktail is served shaken, not stirred. Fill the shaker with 2 to 3 Ice cubes and then add mentioned quantities of Whiskey, Lime Juice and Grenadine Syrup to it. Avoid using more than 3 ice cubes as it will dilute the drink more. Many bartenders are known to add a teaspoon of Caster Sugar to the mix while shaking. Give a light shake, taking care that the ice in the shaker does not crack. Strain and pour the mix in a chilled Martini Glass. Garnish the mix with a peel of orange."},
{"name": "Pomoranza", "ingredients": "60 ml vodka; Half cucumber; Dash of lime juice 2 drops; 5 ml Sugar syrup; Glass  Old fashioned / Tall", "description": "Muddle the ingredients, shake and serve in a tall glass / old-fashioned glass with ice. Serve Pomoranza Cocktail chill."},
{"name": "Sex on the Beach", "ingredients": "45 ml; White Mischief Vodka; 15 ml Peach Schnapps; 60 ml Cranberry Juice; 60 ml Orange Juice", "description": "This is the built-up, fruity Highball made directly in the glass. Fill the glass with 3 to 4 ice cubes. Add the mentioned quantities of White MischiefVodka , Peach Schnapps, Cranberry Juice and Orange Juice on the ice. Garnish the mix by dropping 2 to 3 pieces of Lemon and stick an Orange wedge on the rim of the glass. Stir the cocktail well for blending the spirits and fruit juices properly. The Shaken variant of this cocktail is strained and served in a chilled martini glass, without any garnishing. Some of the tropical variants of this cocktail replace Pineapple Juice with Orange, and Peach Schnapps with Orange Curacao or Triple Sec."},
{"name": "Screwdriver Cocktail", "ingredients": "60 ml SmirnoffVodka; 180 ml Orange Juice; Ice; Slice of Orange", "description": "This is a built-up drink made directly in the glass itself. Add 60 ml SmirnoffVodka in a tall glass. Later, add approximately 180 ml of Orange Juice to it. Ice is added after the Orange Juice. The mix is stirred using a stirrer and then garnished with a slice of orange. To introduce a sour, lemony taste, you can squeeze lemon over the mix. Avoid putting lots of ice as it will dilute the vodka and spoil the taste of Orange juice. Some bartenders also prefer to use Martini Glass, Champagne Flute, or Highball Glass."},
{"name": "Kamikaze", "ingredients": "50 ml Smirnoff Vodka; 15 ml Triple Sec; 15 ml Lime Juice", "description": "This is a straight up drink served in a Shot Glass, instead of a stemmed glass. Fill the shaker with 3-4 ice cubes and pour 50ml Smirnoff, 15ml Triple Sec and 15ml Lime Juice in it. Shake the mix rigorously for a minute or two. Strain and pour the mix in a Shot Glass. Garnish the cocktail with a slice of lemon. Some bartenders serve this cocktail in a Martini Glass and garnish it by sticking a lemon wedge on the rim. For a sweet and salty after-taste, bartenders are also known to rim the glass with salt and sugar powder."},
{"name": "Bloody Mary", "ingredients": "Bloody Mary Recipe includes; Smirnoff; Vodka (about 30 ml); Worcestershire sauce, pepper; Tabasco sauce (as per your preference); Salt; Lemon juice (15 ml); Tomato juice (90 ml); Aslice of lemon.", "description": "To make the cocktail, you need to fill the glass with ice cubes and add to it 30 ml of chilled Smirnoff Vodka. Furthermore, add 60 ml tomato juice to the vodka along with a dash of Worcestershire sauce. Add lemon juice, salt, and pepper to the mix along with some Tabasco sauce. You can add the Tabasco sauce as per your preference on how spicy you prefer your drink to be. Stir it well. Add the lemon slice to the drink to augment the flavor or place it on the rim as a garnish. The video here gives you a step-by-step direction on how to make the Bloody Mary cocktail . The added touch of applying some salt on the rim by moving the lemon wedge along the rim of the glass by keeping the glass upside-down and then inverting the glass onto a plate of salt to give the rim a salty look and taste would beyond doubt make your experience of having the Bloody Mary cocktail an unusually extraordinary one."},
{"name": "Salty Dog Cocktail", "ingredients": "45 ml Vodka; 90 ml Grapefruit Juice; Salt", "description": "This is a built-up cocktail served stirred in a Highball Glass. Take a Highball Glass, rub the rim with a lime wedge and coat it with salt. Fill the glass up to the brimwith ice cubes. Pour the mentioned quantities of Vodka and Grapefruit Juice into the glass. Stir the ingredients thoroughly and garnish the mix with a Maraschino Cherry. You can also add a teaspoon of fine powdered sugar to the drink to sweeten it."},
{"name": "Sherry Nights", "ingredients": "1 dash of fruit juice; Icing sugar; 1 teaspoon finely grated orange zest; 1 measure medium sherry; measure whiskey; 1 measure orange juice; 2 dashes orange curacao; Ice cubes", "description": "Dip the rim of the medium-sized cocktail glass into a mixture of sugar and orange zest. Set aside until dry. Blend the remaining ingredients together in a blender for 10 seconds. Pour into the prepared cocktail glass with more ice. Serve Sherry Nights Scotch and Whisky Cocktail chill."},
{"name": "Flaming Larynx", "ingredients": "50 ml whiskey; 30 ml cranberry juice; 60 ml clamato juice", "description": "Stir ingredients together in a highball glass filled with ice cubes, and serve Flaming Larynx Scotch and Whisky Cocktail chill."},
{"name": "Chocorange Killer", "ingredients": "1/2 tsp cocoa powder; 1/2 tsp icing sugar; 3 measures of Signature whiskey; Juice of 1 orange; 150 ml sparkling water; A few drops of Angostura bitters; Sugar syrup to taste; 2-3 ice cubes; Chocolate flakes to decorate", "description": "Mix the cocoa and sugar together. Rub the rim of the glass with Signature whiskey then dip into the cocoa mixture. Set aside until dry. Mix the orange juice, sugar syrup, Signature whiskey and sparkling water. Put the ice and a few drops of bitters in the bottom of the glass. Pour on the orange fizz and dress with chocolate flakes. Serve Choco Orange Killer Scotch and Whisky Cocktail chill."},
{"name": "Saddle Up", "ingredients": "30 ml whisky; 15 ml green apple juice; Soda; Green Apple dressing", "description": "Pour the ingredients into a mixing glass with ice cubes. Stir well and strain into a chilled cocktail glass. Serve Saddle Up Scotch and Whisky Cocktail chill."},
{"name": "Signature Sin", "ingredients": "60 ml whisky; 90 ml warm apple juice; 2 cloves; 1 cinnamon stick; 2 broken cardamom pods; A twist of lemon; 5 gm sugar; Glass  Brandy balloon / Old-fashioned / Irish coffee mug", "description": "Add the spices and sugar in a glass. Then add warm apple juice and squeeze in a twist of lemon. Stir the ingredients. Add lime juice to balance the drink. Garnish with an apple slice and sprinkle nutmeg powder on top. Serve Signature Sin Scotch and Whisky Cocktail chill."},
{"name": "Japanese Slipper Cocktail", "ingredients": "45 ml Vodka; 45 ml Midori Melon Liqueur; 30 ml Lemon Juice Pure", "description": "This cocktail is served shaken in a chilled Martini Glass or a Champagne Flute. Take a Cocktail Shaker and pour 3 to 4 ice cubes into it. Pour the mentioned quantities of Vodka, Melon Liqueur and Lemon Juice into the Shaker. Shake the ingredients vigorously, until the drink gets a greenish hue. Strain and pour the mix into a Martini Glass or a Champagne Flute. Garnish the drink with a lemon peel."},
{"name": "Cosmopolitan Cocktail", "ingredients": "To make the Cosmopolitan cocktail, you would require; 60 mlSmirnoff Vodka; 15 ml Cointreau / Triple Sec; 15 ml Cranberry Juice; Dash of Lime Juice or Orange Peels; Some Ice", "description": "To make the cosmopolitan cocktail , you would need to take some ice cubes in a cocktail shaker. Add the Smirnoff vodka, Cointreau or triple sec, cranberry juice, and lime juice into the shaker. Shake the content of the shaker and strain it into a chilled martini glass. Garnish the drink by adding a lemon wedge on the glass or add an orange peel into the cocktail. You can also try a different take to jazz up your cosmopolitan drink by adding two orange wedges and half a strawberry into a glass along with a spoonful of caster sugar. Mix the contents by squashing them without squeezing the orange much to avoid bitter taste from the orange peel. Add ice, 60 ml of Smirnoff vodka, and 60 ml of cranberry juice. Shake the contents and serve in a glass. Garnish the cocktail with a strawberry dipped in caster sugar and a slice of orange."},
{"name": "Chocolate Martini Cocktail", "ingredients": "60 ml Vodka; 20 ml Crme de Cacao", "description": "This cocktail is served shaken in a Martini Glass. Take lots of cracked ice in a Cocktail Shaker and add 60ml Vodka to it. Gently pour 20ml Crme de Cacao over the mix. Shake the ingredients vigorously, until the concoction becomes milky brown in colour. Take a Chilled Martini Glass and coat its rim with powdered Cocoa and Sugar. Strain and pour the mix into the prepared glass. Garnish the cocktail with grated chocolate and a lemon peel."},
{"name": "Hot Rod", "ingredients": "45 ml Smirnoff Vodka; 3-4 lime wedges; 8-10 mint leaves; Cranberry Juice to top up; Crushed Ice", "description": "This is a straight-up drink made directly in the glass. Take 3 to 4 mint leaves and lime wedges and muddle them thoroughly in an Old Fashioned Glass. Fill the glass with crushed ice and then pour Vodka over it. Top up the drink with Cranberry Juice and stir the mix briskly. To garnish, stick a lime wedge on the rim and decorate the drink by dropping a cocktail umbrella in it. Fresh pieces of pineapple can also be used to garnish this drink."},
{"name": "Red Czar", "ingredients": "60 ml vodka; Monin Watermelon syrup; 12 mint leaves; 4 chunks of lemon; Sugar syrup; A few grains of sugar; 10 ml lime juice; Glass  Old-fashioned", "description": "Add lemon chunks and mint leaves with a little grain sugar in a glass. Muddle the lemon and the mint, but make sure you dont muddle the lemon too hard or the drink will become too bitter. Add the lime juice. Fill the glass with crushed ice and using a stirrer spread the lemon mint and the sugar uniformly. Pour the watermelon syrup over the ice and add the vodka. Balance the flavor by adding more lime juice or sugar syrup. Serve Red Czar Vodka Cocktail chill."},
{"name": "Pink Poodle", "ingredients": "45 ml vodka; 80ml Pineapple juice; 20 Strawberry Crush; Half scoop Vanilla Ice Cream; Garnish  Pineapple / Strawberry Slice; Glass  Tall", "description": "In a shaker filled with ice. Shake all the above and served in a tall glass. It could be made bright red by adding grenadine. Garnish with pineapple or strawberry slices. Serve Pink Poodle Vodka Cocktail chill."},
{"name": "Scotch Sangaree", "ingredients": "1 tsp clear honey; Sparkling water; Cracked ice; 60 ml whisky; Twist of lemon and freshly grated nutmeg to decorate", "description": "Put the honey in a chilled tumbler with a little sparkling water. Stir gently, then dress with a lemon twist and sprinkle with freshly grated nutmeg. Serve Scotch Sangaree Scotch and Whisky Cocktail chill."},
{"name": "On The Fence Cocktail", "ingredients": "10 ml Signature Whisky; Ice; Cider; A dash of Bitters", "description": "This is a built-up cocktail made directly in a Tall Glass. Take a Tall Glass and half fill it with ice cubes. Pour 10 ml Whisky and Cider on the ice and add a few drops of Bitters to the mix. Stir the ingredients rigorously, until the drink gets an orange hue. Garnish the mix with mint sprigs and lime. Crushed ice can be used instead of ice cubes."},
{"name": "Vonamor Rush", "ingredients": "45 ml vodka; 15 ml Monin Casis; 4-5 nos Black Grapes; 3-4 nos lime wedges; 4-5 Mint Leaves; 60ml Cranberry Juice; Glass  Old-fashioned", "description": "In an old-fashioned glass, muddle grapes, mint and lime. Fill the glass with crushed ice, add vodka, Monin casis and top with cranberry juice. Serve Vonamor Red Vodka Cocktail chill."},
{"name": "Green Apple Martini Cocktail", "ingredients": "60 ml Smirnoff Vodka; 15 ml Green Apple Monin syrup; Lemon juice; A slice of green apple", "description": "This cocktail is served shaken in a Martini Glass. Take a Cocktail Shaker and filled it with lots of cracked ice. Pour 60 ml Smirnoff Vodka, 15 ml Green Apple Monin Syrup and a dash of Lemon Juice into the shaker. Shake the ingredients, until the concoction gets a greenish hue. Strain and pour the mix into a Chilled Martini Glass. Garnish with a slice of Green Apple. Make your party special with different types of Vodka Cocktails . Get the best and easy Vodka recipes at LiveInStyle."},
{"name": "Long Island Iced Tea", "ingredients": "The Long Island Iced Tea Cocktail recipe essentially includes:; Smirnoff; Vodka (about 15 ml); McDowells No.1; Caribbean White Rum (about 15 ml); Gin (about 15 ml); Tequila (about 15 ml); Triple sec (about 15 ml); Cola (about 45 ml); Sweet and sour mix; Lemon wedge; Lots of ice", "description": "To make a Long Island Iced Tea Cocktail, you would need to add a lot of ice cubes in the cocktail shaker. Add about 15 ml of Smirnoff Vodka, McDowells No.1 Caribbean White Rum, Tequila, Gin, and Triple Sec, each along with a dash of sweet and sour mix to the shaker. Give it a brisk shake and pour the mix into a glass. Add 45 ml of Cola to the mix. Use a lemon wedge to garnish the drink. You can also use crushed ice for a shaken version of the Long Island Iced Tea. The chilled Long Island Iced Tea goes a long way in refreshing you, with its perfect blend of spirits. Make your party special with different types of Vodka Drinks. Get the best and easy Vodka recipes at LiveInStyle."},
{"name": "Chilli Vodka Cocktail", "ingredients": "40 ml SmirnoffVodka; 10 ml Sugar Syrup; 4 Dashes Tabasco Sauce", "description": "This cocktail is served shaken in a Shot Glass. Take a Cocktail Shaker and drop lots of ice into it. Pour 40 ml SmirnoffVodka, 10 ml Sugar Syrup and 4 dashes of Tabasco Sauce on the ice. Shake the ingredients thoroughly, until the outside of the shaker becomes frosted. Strain and pour the mix into a Shot Glass rimmed with Castor Sugar. Garnish the mix by fixing half a slit chilli on the rim."},
{"name": "Black Watch Cocktail", "ingredients": "60ml Black Dog Centenary Scotch Whisky; 30ml part Coffee Liqueur; Ice; Soda water", "description": "This cocktail is served stirred or built-up in a Highball Glass. Take a Cocktail Shaker and fill it with several lumps of ice. Pour 60ml Scotch and 30ml Coffee Liqueur into the Shaker. Shake the ingredients thoroughly, until both the spirits blend together. Strain and pour the mix into a Highball Glass. Top up the drink with a dash of Soda and garnish it with a lime wedge and mint sprigs. You can also drop a stirrer and a straw into this delicious mix."},
{"name": "Signature Affinity", "ingredients": "45 ml whisky; 15 ml Cointreau; 5 ml lime juice; Glass  Martini", "description": "Shake all the ingredients with lots of ice and strain into a chilled martini glass filled with crushed ice. Garnish with a slice of orange."},
{"name": "Long Gone Cocktail", "ingredients": "20 ml Black Dog Centenary Scotch; 10ml Drambuie; 10ml Orange Juice; A dash of orange bitters; Ice; Orange slice, to decorate", "description": "This is a shaken cocktail served chilled in a Martini Glass. Take a Cocktail Shaker and fill it with 3 to 4 ice cubes. Pour the mentioned quantities of Scotch, Drambuie and Orange Juice in it Shake the ingredients thoroughly, until the mix develops a yellowish hue. Strain and pour the drink into a chilled Martini Glass. Garnish the cocktail with an orange slice or a lemon peel."},
{"name": "The Algonquin", "ingredients": "1/2 measure Black Dog Centenary Scotch Whisky; 1/2 measure dry vermouth; 1/4 measure pineapple juice; Ice cubes", "description": "Shake the liquid ingredients over ice until frosted. Strain into an ice filled glass. Serve The Algonquin Scotch and Whisky Cocktail chill."},
{"name": "Sparklers", "ingredients": "60 ml whisky; 15 ml Drambuie; 15 ml Kahlua; Cinnamon powder", "description": "Take a cocktail glass pour a layer of Kahlua, whisky and Drambuie. Light the drink and sprinkle cinnamon powder over the drink. Serve Sparklers Scotch and Whisky Cocktail chill."},
{"name": "Jealous Maiden", "ingredients": "45 ml whisky; 20 ml Ginger lime cordial; Dash of Soda; Dash of 7UP; 15 ml Khus syrup; 10 ml lime juice (Lemoneez); Mint; Glass  Old-fashioned", "description": "Mix everything and garnish with a lime wedge. Serve Jealous Maiden Scotch and Whisky Cocktail chill."},
{"name": "Signature Peach Sour", "ingredients": "60 ml whisky; 15 ml lime juice; 15 ml Monin peach; Glass  Old-fashioned", "description": "Put all the ingredients in a shaker with lots of ice and shake well. Pour the mixture over ice in an old fashioned glass. Garnish with almond slivers. Serve Signature Peach Sour Scotch and Whisky Cocktail chill."},
{"name": "Isobella", "ingredients": "1/2 ml Black Dog Centenary Scotch Whisky; 1/4 ml brandy; 1/4 ml red vermouth; 1/8 ml Galliano; 1/8 ml mandarin liqueur; Ice; Juice of 1 ornage; Chilled soda water; Orange peel strip, to decorate", "description": "Shake the first five ingredients over ice until well frosted. Strain into a chilled cocktail glass. Dress with a strip of orange peel. Serve Isobella Scotch and Whisky Cocktail chill."},
{"name": "Black Shrub", "ingredients": "1/2 part Black Dog Centenary Scotch Whisky; 1/2 part sloe gin; Ice; Fresh cherry to decorate", "description": "Stir the liquid ingredients together with ice. Strain into a chilled cocktail glass and dress with a cherry. Serve Black Shrub Scotch and Whisky Cocktail Drink chill."},
{"name": "Whiskey Sangaree", "ingredients": "Cracked Ice; 20 ml Black Dog Centenary Scotch Whisky; 1 teaspoon sugar syrup; Soda water; 1 teaspoon ruby port; Freshly grated nutmeg", "description": "Put cracked ice into a chilled tumbler. Pour over the bourbon and sugar syrup and top up with soda water. Stir gently to mix, then float the port on top. Sprinkle freshly grated nutmeg. Serve Whiskey Sangaree Scotch and Whisky Cocktail chill."},
{"name": "Signature Apple Hook", "ingredients": "45 ml whisky; 20 ml Monin G apple; 10 ml Lime juice (Lemoneez); Topped-Tropicana apple juice; Glass - Collins", "description": "Shake all the ingredients with lots of ice and strain into a chilled collins glass filled with crushed ice. Garnish with a slice of apple. Serve Signature Apple Hook Scotch and Whisky Cocktail chill."},
{"name": "Scarlett O'Hara", "ingredients": "Cranberry ice cubes; 2 measures whiskey; 2 measures cranberry juice; 1 measure lime juice; Ice", "description": "Prepare a few ice cubes with cranberries frozen in them. Shake the next three ingredients well over ice, then strain into a chilled cocktail glass. Finish with a cranberry ice cube. Serve Scarlett O'Hara Scotch and Whisky Cocktail chill."},
{"name": "Chocostrino", "ingredients": "40 ml vodka; 10 ml Chocolate Sauce; Small scoop of vanilla ice cream; Glass  Shot glass", "description": "Shake all the above ingredients and serve in a shot glass. You can also garnish the shot glass with a strawberry which could be eaten later. Serve Chocostrino Vodka Cocktail Drin k chill."},
{"name": "Santa’s Sleigh", "ingredients": "1 1/2 parts Pinky Vodka; 1 part port; 1 part cherry liqueur; 1 part freshly squeezed half of an orange; 2 drops of almond extract; Glass; Wine Glass", "description": "Take a wine glass and rim it orange juice and dip it into granulated sugar. Add all the ingredients into the shaker and shake vigorously with ice and gently strain into sugar rimmed wine glass. Garnish with pink cherries marinated overnight in Pinky Vodka. Serve Santas Sleigh Vodka Cocktail chill."},
{"name": "Commodore", "ingredients": "40 ml Black Dog Centenary Scotch Whisky; 10 ml fresh lime juice; 2 dashes orange bitters; Sugar to taste; Ice; Lime peel strip to decorate", "description": "This delicious cocktail is served shaken. Fill a Cocktail shaker with lots of ice and add all the four ingredients to it. Shake the mix vigorously, until the outside of the shaker becomes frosted. Strain and pour the mix into an Old Fashioned Glass or Martini Glass. You can top the drink with crushed ice. Garnish the mix with a peel of lime. You can also use herbs or sprigs as a garnish."},
{"name": "Pinky Strawberry Granita", "ingredients": "100 ml vodka; 450 gm strawberries; 200 ml water; 200 gm sugar; 2 tbsp lemon juice; Garnish  Mint sprigs", "description": "Combine water and sugar in medium saucepan. Stir over medium heat until sugar dissolves. Bring to boil. Remove from heat. Chill the syrup. Blend the strawberries in a processor until smooth. Add sugar syrup, vodka and lemon juice. Pour mixture into a shallow glass bowl or baking dish. Freeze until almost firm, stirring frequently with a fork every two hours. Continue freezing granita until firm (do not stir), at least 3 hours or overnight. Using fork, scrape surface of the granita to form crystals and scoop into serving glasses. Garnish with whole strawberries and mint sprigs. Serve Pinky Strawberry Granita Vodka Cocktail chill."},
{"name": "Pinky Royale", "ingredients": "30 ml vodka; 40 ml Raspberry liqueur; 10 ml simple syrup; Peach bitters", "description": "Shake with ice, strain into champagne flute. Pour champagne directly into glass and garnish with edible flower. Serve Pinky Royale Vodka Cocktail chill."},
{"name": "Pinky's Day Off", "ingredients": "1 1/2 parts vodka parts whisky; 3 strawberries; 1/2 part agave nectar; 3/4 part lime juice; 1 part orange juice; Top with soda water", "description": "Muddle strawberries in the bottom of a mixing glass and add remaining ingredients. Strain over ice, top with soda water and garnish with strawberry. Serve Pinky's Day Off Vodka Cocktail chill."},
{"name": "Baby Bird Cocktail", "ingredients": "60 ml Vodka; 1/4 red bell pepper, muddled; 20 ml simple syrup; 20 ml lime juice; Orange juice; 3 dashes Rhubarb Bitters", "description": "This cocktail is served shaken in a Martini Glass. Muddle a slice of Bell Pepper in a Cocktail Shaker and add lots of ice to it. Pour 60 ml Vodka, 20 ml Simple Syrup, 20 ml Lime Juice and a dash of Orange Juice into the shaker. Shake the ingredients thoroughly, until the cocktail becomes yellowish orange in colour. Strain and pour the mix into a Bucket Glass or a Martini Glass. Garnish the mix with a salt-crusted bell pepper slice."},
{"name": "Pinky Confidential", "ingredients": "60 ml vodka; 30 ml raspberry liqueur; 30 ml fresh lemon juice; 15 ml simple syrup; 15 ml egg white; Powdered sugar for garnish", "description": "Pour all the ingredients into a cocktails shaker. Dry shake for 15 seconds. Add ice, shake again. Strain into a power sugar-rimmed martini glass. Serve Pinky Confidential Cocktail chill."},
{"name": "Creamy Screwdriver", "ingredients": "40 ml Vodka; 60 ml orange juice; tsp sugar syrup; 1 egg yolk; Crushed ice", "description": "Blend the liquid ingredients with the egg yolk and some crushed ice until smooth. Half fill a tall chilled tumbler with cracked ice and pour the cocktail over without straining."},
{"name": "Tartan Breeze", "ingredients": "1  part of Black Dog Centenary Scotch Whisky; part apricot brandy; 1 part orange juice; A dash of Angostura bitters; Ice cubes", "description": "Shake the liquid ingredients well together over ice. Strain into a large cocktail glass with more ice. Serve Tartan Breeze Scotch and Whisky Cocktail chill."},
{"name": "Early Christmas", "ingredients": "60 ml dark crme de cacao; 60 ml Black Dog Centenary Scotch Whisky; Glass: Old-fashioned", "description": "Blend all the ingredients in a tall glass with ice. Shake well and serve Early Christmas Scotch and Whisky Cocktail chill."},
{"name": "Vonamor Passion Vonamor Red", "ingredients": "30 ml vodka; 10ml Orange Juice; 10ml Lime Juice; 5ml Monin Grenadine; Glass  Shot glass", "description": "Shake all the above ingredients and serve in a Vonamor Passion Vonamor Red Vodka Cocktail chill."},
{"name": "Blinder", "ingredients": "60 ml Black Dog Centenary Scotch Whisky; 30 ml Grapefruit Juice; 1 tsp Grenadine Syrup", "description": "This refreshing tropical cocktail is served stirred. The drink is built-up directly in a Highball Glass. Fill the Highball Glass with lots of ice and then pour the mentioned quantities of Scotch and grapefruit juice into it. Stir the mix for some time and then pour Grenadine syrup in the centre of the glass. Crushed ice can be used instead of ice cubes. You can garnish the cocktail with a lemon wedge or fresh herb leaves."},
{"name": "Pink Heather", "ingredients": "1 measure Black Dog Centenary Scotch Whisky; 1 measure strawberry liqueur; Chilled sparkling Four Seasons wine; Fresh strawberry for decoration", "description": "Pour the whiskey and the strawberry liqueur into a chilled champagne flute. Top up with chilled sparkling wine. Dress with a strawberry. Serve Pink Heather Scotch and Whisky Cocktail chill."},
{"name": "Shamrock", "ingredients": "1 measure Whiskey; 1 measure Dry Vermouth; 3 dashes Green Chartreuse; 3 dashes crme de menthe; Cracked ice", "description": "This drink is served stirred or boxed. Fill the Cocktail shaker with lots of cracked ice and then add the mentioned quantities of Whisky, Dry Vermouth, Green Chartreuse and Crme de Menthe to it. Stir the ingredients together until the outside of the shaker becomes misty. Strain and pour the mix into a Chilled Margarita or Martini Glass. Some bartenders rim the glass with powdered sugar or salt, and garnish the drink with a wedge of lime. Green Chartreuse gives a signature taste to this mix."},
{"name": "Pinky Vespa", "ingredients": "45 ml vodka; 30 ml gin; 30 ml Pacific Rim Vin de Glaciere; 30 ml simple syrup; 1 half Myer lemon squeezed (winter seasonal)", "description": "Mix all ingredients together. Garnish with a vodka-candied Myer lemon twist (vodka, 5-spice, simple syrup, Myer lemon juice). Serve Pinky Vespa Vodka Cocktail chill."},
{"name": "Paralyzer", "ingredients": "60 ml coffee liqueur; 30 vodka milk; 60 ml Coca-Cola", "description": "Pour ingredients in order mentioned above in a tall glass and serve Paralyzer Vodka Cocktail chill."},
{"name": "Wedding Bells", "ingredients": "Cracked ice; Dash Orange bitters; 20 ml Black Dog Centenary Scotch Whiskey; 10 ml triple sec; 20 ml Lillet; Orange wedge to decorate", "description": "This is a classic cocktail served stirred. Pour lots of cracked ice into a Mixing Glass and add a dash of Orange Bitters to it. Gently pour the mentioned quantities of Scotch, Triple Sec and Lillet into the shaker. Stir the mix briskly, until the shaker becomes misted from the outside. Strain and pour the mix into a chilled Cocktail Glass. Garnish the drink with an Orange wedge and drop a straw in it. You can also drop cracked ice in the cocktail to keepit chilled."},
{"name": "Chocolate Covered Cherry Cocktail", "ingredients": "30 ml Smirnoff Vodka; 15 ml Maraschino Liqueur; 25 ml Crme de Cacao; 1 tablespoon Chocolate Sauce; 1 Chocolate covered Cherry", "description": "This cocktail is served shaken in a Martini Glass. Pour 3 to 4 ice cubes in a cocktail shaker and add Vodka, Crme de Cacao and Maraschino Liqueur to it. Shake the ingredients thoroughly, until the mix becomes chilled and gets a brownish hue. Take a Martini Glass and swirl chocolate sauce on the inside. Strain and pour the mix into the prepared glass and add 2 to 3 ice cubes to it. Garnish the drink with a chocolate covered cherry on a cocktail pick."},
{"name": "Sparkling Pear Cocktail", "ingredients": "30 ml Smirnoff Vodka; 15 ml Elderflower Liqueur; 15 ml Pear Nectar; 10 ml Fresh Lemon Juice; Pinch of Nutmeg; Splash of Sparkling Wine; Garnish  Lemon Twist", "description": "This cocktail is served shaken in a Champagne Flute. Take a Cocktail Shaker and fill it with lots of cracked ice. Pour the mentioned quantities of Vodka, Elderflower Liqueur, Pear Nectar and Lemon Juice into the Shaker. Shake the ingredients vigorously, until the drink becomes chilled. Strain and pour the mix into a Champagne Flute and top it up with Sparkling Wine. Garnish the drink with a lemon twist."},
{"name": "Rusty Nail Cocktail", "ingredients": "30ml Black Dog Centenary Scotch Whisky; 15ml Drambuie; 1 lemon twist", "description": "This cocktail is served built-up and stirred in an Old Fashioned Glass. Pour lots of ice into theglass and add 30ml Scotch to it. Stir the Scotch well with the ice and pour 15ml Drambuie into it. Stir the mix thoroughly and garnish it with a lemon twist. You can use cracked ice to keep this drink chilled for a longer time. Well-aged Whisky, Brandy or Rum can be used instead of Scotch."},
{"name": "Black Dog Mint Julep", "ingredients": "60 ml; Black Dog; Centenary Scotch Whisky; 8 mint leaves; 2 spoons sugar; Water / Soda; Glass  Tall glass", "description": "This is an old classic with a touch of refreshing mint. Crush the mint leaves and sugar in a glass with a spoon or muddler to release the flavors. Fill the glass with broken ice and add the 12 year-old Black Dog Whiskey. Add a splash of soda."},
{"name": "Artillery Punch", "ingredients": "1 1/3 whisky bottles; 1 1/3 bottles red wine; 2 litres strong black tea; 475 ml dark rum; 225 ml gin; 225 ml apricot brandy; 4 measures lemon juice; 4 measures lime juice; 4 tbsp sugar syrup; large block of ice; Orange slices to decorate", "description": "Pour the first nine ingredients into a large bowl. Refrigerate for 2 hours. To serve, place a large block of ice in a punch bowl. Pour the punch over the ice and dress with orange slices. Serve Artillery Punch Scotch and Whisky Cocktail chill."},
{"name": "Miami Beach Cocktail", "ingredients": "60 ml Signature Whiskey; 40 ml Pink Grapefruit Juice; Orange Peel Strip to Garnish", "description": "Fill the cocktail shaker with lots of ice. Add the mentioned quantities of Scotch and Grape Fruit Juice over the ice cubes. To get a uniform mix, shake the mix rigorously until the shaker becomes frosted. Serve the mix in a chilled Collins Glass with the ice. While using a Martini Glass, strain the mix before serving. Crushed Ice is not recommended as it will melt fast and dilute the spirit. Stick an Orange Peel over the rim to give a marvellous look to this cocktail. To alter the smoky taste of the Scotch, some bartenders also use Orange Curacao or Triple Sec with Grapefruit Juice."},
{"name": "Cold Kiss", "ingredients": "50 ml whiskey; 50 ml peppermint schnapps; 2 tsp white creme de cacao", "description": "Pour all ingredients into a cocktail shaker half-filled with ice cubes. Shake well, strain into a highball glass, add mint leaves and serve Cold Kiss Scotch and Whisky Cocktail chill"},
{"name": "Millionaire Cocktail", "ingredients": "2/3 ml Black Dog Centenary Scotch Whisky; 1/3 Cointreau; 2 dashes of grenadine; 1 egg white; Ice", "description": "Shake the first four ingredients over ice and strain into a cocktail glass. Serve Millionaire Scotch and Whisky Cocktail chill."},
{"name": "Mint Hint", "ingredients": "45 ml premium whisky; 3-4 chunks of orange and lime wedges; 5-8 min leaves; 20 ml of Monin mint; Orange juice; 30 ml of crme de menthe", "description": "Muddle the mint, lime, crme de menthe and orange wedges well, add in lots of ice, then the whisky and top up with orange juice. Garnish with a wedge of orange and a sprig of mint. Serve Mint Hint Scotch and Whisky Cocktail chill."},
{"name": "Bourbon Fog", "ingredients": "1 litre Whiskey; 1 litre strong black coffee; 1 litre vanilla ice cream", "description": "Lightly blend all the ingredients together in a large punch bowl. When it becomes smooth and frothy, serve Bourbon Fog Scotch and Whisky Cocktail Recipe in little mugs or small chilled glasses. This drink serves 10 people."},
{"name": "Royal Surprise", "ingredients": "45 ml whisky; 15 ml peach liqueur; 60 ml cranberry juice; Ice cubes; Cranberries or cherries for garnish; Glass: Old-fashioned glass", "description": "Combine the whisky, peach liqueur and cranberry juice in a shaker filled with ice cubes. Shake vigorously for about 8 to 10 seconds. Pour into an old-fashioned glass and garnish with cranberries or cherries. Serve Royal Surprise Scotch and Whisky Cocktail chill."},
{"name": "Manhattan Cocktail", "ingredients": "60 ml Antiquity Blue Whiskey; 15 ml sweetened Vermouth; 2 - 3 dashes of Angostura Bitters; 2 to 3 Cherries", "description": "Take a mixing glass filled with a few ice cubes. Add whiskey, vermouth, and angostura bitter into the glass and stir the contents for about three minutes. Strain the contents into a chilled cocktail or martini glass and garnish your Manhattan drink with a few Maraschino cherries and some orange peel. To make your Manhattan drink more savoury, you can try an alternative Manhattan recipe by adding a few drops of angostura bitter into the cocktail glass and swirling it around to let it cover the inside of the glass. Separately mix the whiskey, vermouth, and some maraschino cherry syrup in a tumbler filled with ice. Stir the contents and strain it into the glass coated with the angostura bitter. Garnish the drink with maraschino cherries and some orange peel for an added flavour. With a few simple steps, you can have your cocktail ready in no time."},
{"name": "Golden Lagoon", "ingredients": "60 ml whisky; 2-3 pieces of ginger; 1 tsp of orange marmalade; Soda / Sprite; Pinch of saffron; 20 ml of Monin amaretto", "description": "Muddle ginger and amaretto syrup with lots of ice in a shaker, add in the whisky and orange marmalade, shake and strain into a glass filled with ice. Add a pinch of saffron and top with soda / Sprite. Serve Golden Lagoon Scotch and Whisky Cocktail chill."},
{"name": "Blue Dragon", "ingredients": "45 ml premium whisky; 15 ml Blue Curacao; A pinch or two of cinnamon sugar; Glass  Shot glass", "description": "This is a shooter and the quantities are for two servings. Pour whisky and Blue Curacao into a wine glass. After setting the mixture alight, pour it into another wine glass from a height in a continuous stream. Ask your guest to throw a pinch or two of cinnamon sugar into the flame. Extinguish and pour the concoction into the shot glasses. Gulp that down!"},
{"name": "Tickled Pinky", "ingredients": "30 ml vodka; 15 ml lychee pure; 15 ml fresh lemon juice; 60 ml cranberry juice; Splash of simple syrup; 4 raspberries; Garnish  Raspberry; Glass  Rocks", "description": "Combine all ingredients, including raspberries, and shake over ice. Strain into a rocks glass and garnish with a skewered raspberry. Serve Tickled Pinky Vodka Cocktail chill."},
{"name": "Antiquity Collins", "ingredients": "60 ml whisky; 30 ml lemon juice; 20 ml sugar syrup; Soda water to top; A lime slice; Cocktail cherries; Glass  Collins", "description": "Build the ingredients in a Collins glass over ice. Top with soda. Garnish with lemon slice and a cherry. Serve Antiquity Collins Scotch and Whisky Cocktail chilled. Enjoy this cocktail at - Opus (Bangalore)"},
{"name": "Flying Scotsman Cocktail", "ingredients": "30ml Single Malt Whisky; 30ml Sweet Vermouth; 1 dash Bitters; 1/4 tsp sugar syrup", "description": "This cocktail is served shaken in a Martini Glass. Take a cocktail shaker and fill it with lots of cracked ice. Pour the mentioned quantities of Whisky and Sweet Vermouth in the shaker and add a few drops to Bitters to it. Shake the ingredients well, until the drink gets a brownish hue. Strain and pour the mix into a Martini Glass. Cracked ice is used to chill the drink faster."},
{"name": "Bellamy Scotch Sour", "ingredients": "180 ml; Signature Whisky; 90 ml Orange Juice; 60 ml Lemon Juice; 1 tsp Honey; 1 dash Angostura Bitters; 1 pinch Ginger; Glass  Old fashioned", "description": "Pour the Signature Whisky , Orange Juice, Lemon Juice, Honey and Angostura Bitters into a cocktail shaker. Shake well. Pour into an old-fashioned glass, garnish with ginger, and serve chill."},
{"name": "Dry Rob Roy", "ingredients": "75 ml single malt whisky; 1 1/2 tsp dry vermouth; 1 twist lemon peel; Glass  Cocktail", "description": "In a mixing glass half-filled with ice cubes, combine the whisky and vermouth. Stir well. Strain into a cocktail glass. Garnish with the lemon twist. Serve Dry Rob Roy Scotch and Whisky Cocktail chill."},
{"name": "After Nine", "ingredients": "1 measure Whiskey; 1 measure mint chocolate liqueur; 1 measure cream; Ice; Grated chocolate for sprinkling", "description": "Stir or whisk all the liquid ingredients together briefly with a little ice. Strain into a cocktail glass and sprinkle with grated chocolate. Serve After Nine Scotch and Whisky Cocktail chill."},
{"name": "Ceasefire", "ingredients": "60 ml Scotch Whisky; 30 ml Cherry Brandy; 30 ml Dry Vermouth; 10 ml Lemonade", "description": "This drink is served shaken in a chilled Martini Glass. Fill the shaker with lots of ice and then pour the mentioned amounts of Scotch, Brandy and Vermouth in it. Shake the mix adequately until you get a uniform golden colour. Strain and serve the blend in a chilled Martini Glass. Garnish the cocktail by sliding a piece of lime on the rim and by dropping a cocktail umbrella in the Glass. Some bartenders prefer to rim the Glass with salt. Finepowdered sugar with common salt can also be used to rim the Glass. As the serving is large, some bartenders also use a Margarita Glass."},
{"name": "Bobby Burns Cocktail", "ingredients": "45 ml Sweet Vermouth; 45 ml Scotch; 1 1/4 tsp Benedictine Herbal Liqueur; 1 Lemon Twist", "description": "This cocktail is served stirred with ice in an Old Fashioned Glass. Take a Mixing Glass and fill it with lots of ice. Pour the mentioned quantities of Sweet Vermouth, Scotch and Benedictine Herbal Liqueur into the Mixing Glass. Stir the ingredients thoroughly, until the drink becomes orange-brown in colour. Strain and pour the mix into an Old Fashioned Glass. Garnish the mix with a mint sprig or a lime wedge."},
{"name": "Aberdeen Angus Cocktail", "ingredients": "60 ml Black Dog Scotch; 30 ml Drambuie; 1 tbsp. Honey; 2 tbsp. Lime Juice", "description": "Stir all but the Drambuie into a coffee mug. Warm the Drambuie, ignite it and pour the burning liqueur into a coffee mug. Stir rapidly and drink. Serve Aberdeen Angus Scotch and Whisky Cocktail chill."},
{"name": "Godfather", "ingredients": "45 ml Black Dog Centenary Scotch Whiskey; 30 ml Amaretto", "description": "Put ice cubes in a Rocks Glass. Stir all the spirits together and pour over the ice cubes. Visit to know about p opular varieties of cocktail drink made with Scotch and Whisky drinks"},
{"name": "Highland Sling", "ingredients": "1 tsp superfine sugar; 2 tsp water; 30 ml lemon juice; 60 ml Scotch whisky; 1 twist lemon peel; Glass - Highball", "description": "In a shaker half-filled with ice cubes, combine the sugar, water, lemon juice, and Scotch. Shake well. Strain into a highball glass. Garnish with the lemon twist. Serve Highland Sling Scotch and Whisky Cocktail chill."},
{"name": "Don Pedro", "ingredients": "60 ml whiskey; 60 ml Kahlua coffee liqueur; 1 cup vanilla ice cream; Cream", "description": "Mix up all ingredients in a blender. Blend until smooth. Pour into a hurricane glass and serve Don Pedro Scotch and Whisky Cocktail chill."},
{"name": "Aggravation", "ingredients": "90 ml whisky; 15 ml Kahlua coffee liqueur; 15 ml heavy cream; Ice cubes", "description": "Fill a rocks glass with ice and add whisky and Kahlua. Float cream on top and stir. Serve Aggravation Scotch and Whisky Cocktail chill."},
{"name": "Gloom lifter", "ingredients": "60 ml whiskey; 30 ml lemon or orange juice; 10 ml sugar syrup; 1/2 egg white", "description": "Shake with ice and strain into a cocktail glass. Serve Gloom lifter Scotch and Whisky Cocktail chill."},
{"name": "Old Fashioned Cocktail", "ingredients": "120 ml; Signature Whiskey; 2 dashes Angostura Bitters; 1 splash water; 1 tsp Sugar; 1 Maraschino Cherry; 1 Orange Wedge", "description": "The Old Fashioned Cocktail recipe is simple and easy to make. To make the cocktail pour some water, sugar, and angostura bitter in an Old Fashioned glass. Add a cherry along with an orange wedge into the mix and squash them using the back end of a spoon. Add some whiskey into the glass with some ice cubes and stir well. Garnish the cocktail with maraschino cherries and an orange wedge. You can also try an alteration to your Old Fashioned cocktail by substituting water with club soda. Delicious and appealing, making this cocktail for hosting parties is a great way to keep your guests refreshed."},
{"name": "Formula 420", "ingredients": "120 ml whisky; 60 ml Midori melon liqueur; 7-Up soda; Ice cubes", "description": "Pour ingredients over a few ice cubes in order listed. Stir lightly. Serve Formula 420 Scotch and Whisky Cocktail chill."},
{"name": "Coffee Egg Nog", "ingredients": "60 ml whisky; 30 ml coffee liqueur; 100 ml milk; 30 ml half-and-half; 1 tsp sugar syrup; 1/2 tsp instant coffee; 1 egg", "description": "Combine all the ingredients in a blender with half a cup of crushed ice. Blend until smooth. Pour into a collins glass, sprinkle with nutmeg and serve Coffee Egg Nog Scotch and Whisky Cocktail Recipe chilled."},
{"name": "Orange climax", "ingredients": "60 ml peach schnapps; 120 ml pineapple juice; 60 ml orange juice; 30 ml whiskey", "description": "Mix one after the other, shake, and serve in a cocktail glass. Serve Orange Climax Scotch and Whisky Cocktail chill."},
{"name": "Green Dimples", "ingredients": "30 ml Whisky; 50 ml apple juice; Soda water; Apple slice to decorate", "description": "Stir the first two ingredients over ice and strain into an ice-filled highball glass. Top up with soda water and dress with a spring of mint. Serve Green Dimples Scotch and Whisky Cocktail Recipe chill."},
{"name": "Hell Hole", "ingredients": "60 ml whisky; 30 ml peach schnapps; 30 ml dry vermouth; 20 ml pineapple juice; 20 ml lemon soda", "description": "Mix the whisky, peach schnapps, dry vermouth, pineapple juice and lemon soda in an ice-filled collins glass, and serve Hell Hole Cocktail chill."},
{"name": "Blimey", "ingredients": "60 ml whisky; 10 ml lime juice; 1/2 tsp superfine sugar", "description": "Take a cocktail shaker half-filled with ice and combine all the ingredients. Shake vigorously and strain into a cocktail glass. Serve Blimey Scotch and Whisky Cocktail chill."},
{"name": "Out of the Glen", "ingredients": "30 ml scotch whisky; Juice of half lemon; 2 dashes sugar syrup; 4 dashes raspberry syrup; egg white; Ice; Soda water to taste", "description": "Shake the first five ingredients together over ice until well frosted. Strain into a highball glass filled with ice and top up with soda water to taste. Serve Out of the Glen Scotch and Whisky Cocktail chill."},
{"name": "Cameron’s Kick", "ingredients": "60 ml whisky; 40 ml Irish whiskey; Lemon juice; 2 dashes of orange bitters", "description": "Mix both the whiskies, lemon juice and orange bitters in a cocktail shaker half-filled with ice cubes. Shake well, strain into a cocktail glass, and serve. Serve Camerons Kick Scotch and Whisky Cocktail chill."},
{"name": "Beadle stone", "ingredients": "Cracked ice; 60 ml whisky; 40 ml dry vermouth", "description": "Take some cracked ice in a mixing glass and pour whisky and vermouth over the ice. Stir well to mix and strain into a chilled cocktail glass. Serve Beadle Stone Scotch and Whisky Cocktail Recipe chill."}
]