[
{"name": "Affinity", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Stir well with a bar spoon. Strain into a chilled cocktail glass."},
{"name": "Adonis", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Stir well with a bar spoon. Strain into a chilled cocktail glass."},
{"name": "Alabama Slammer", "description": "Mix ingredients in Collins glass with ice and top up with orange juice."},
{"name": "Alabazam", "description": "Pour the brandy, lemon juice, orange curacao, simple syrup and Angostura Bitters into a cocktail shaker filled with ice. Shake well. Strain into a highball glass filled with ice.Top with soda water."},
{"name": "Adult Hot Chocolate", "description": "Pour the schnapps into an Irish coffee glass. Fill with hot chocolate. Stir well. Top with whipped cream and chocolate shavings."},
{"name": "Alaskan Iced Tea", "description": "Mix ingredients in glass over ice, stir with bar spoon, garnish with lemon slice and serve in highball glass."},
{"name": "Amaretto Colada", "description": "Mix ingredients in a blender with crushed ice until smooth. Pour into chilled glass, garnish with pineapple slice and serve."},
{"name": "Alibi", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into an Old-Fashioned glass filled with ice.Top up with a splash of soda water."},
{"name": "Alexander", "description": "Mix in a cocktail shaker with ice for 10 – 15 seconds. Pour into a cocktail glass. Garnish with grated nutmeg."},
{"name": "Abaci Batida", "description": "Build in rocks glass, add all the ingredients, add lots of crushed ice and churn with a bar spoon for 20 seconds."},
{"name": "Alcoholic Dr.Pepper", "description": "Pour the beer in first, then the cola on top. Drop the shot glass of Amaretto in, when it hits the bottom of the glass, drink."},
{"name": "50 – 50", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Stir well. Strain into a chilled cocktail glass. Garnish with the olive."},
{"name": "Algonquin", "description": "Pour the ingredients into a mixing glass with ice cubes. Stir well for 20 seconds. Strain into a chilled cocktail glass."},
{"name": "Abbey Cocktail", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Stir well for 10 – 15 seconds. Strain into a cocktail glass. Garnish with cherry."},
{"name": "Angel Delight", "description": "Pour the ingredients into a cocktail shaker with ice cubes.  Shake well for 15 seconds.  Strain into a chilled cocktail glass."},
{"name": "American Collins", "description": "In a Collins glass, muddle the blueberries and the cherries in the lemon juice and simple syrup. Add premium gin and ice and stir briefly.Top up with Soda water. Garnish with a lemon wheel and bing cherry."},
{"name": "Anaconda", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well for 20 seconds and strain into a shot glass."},
{"name": "Anani Punch", "description": "Add all the ingredients to the mixing tin, add lots of ice. Shake thoroughly for 20 seconds and strain into a rocks glass."},
{"name": "Amarula and Eve", "description": "Combine all ingredients in a shaker glass filled with ice. Shake vigorously and strain into a coup glass. Garnish with lychee fruit on the rim."},
{"name": "Agent Orange", "description": "Mix both ingredients in an Old-Fashioned glass with ice and serve."},
{"name": "Air Force One", "description": "Fill a tall glass with ingredients and add ice. Stir well for 20 seconds and garnish with lemon spiral."},
{"name": "Agave Kiss", "description": "In a cocktail shaker with ice, add tequila, white crème de cacaco, double cream and chambord. Shake for 15 seconds. Pour into a chilled cocktail glass, rimmed with white chocolate add a spear of fresh raspberies and serve."},
{"name": "Adios M.F", "description": "Pour all ingredients, except the lemon-lime soda, into a chilled glass filled with ice cubes. Top with the lemon – lime soda and stir gently."},
{"name": "Admiral Perry", "description": "Add all ingredients into a mixing glass and stir with ice until chilled. Strain into a cocktail glass and garnish with slice of pear."},
{"name": "Admiral Benbow", "description": "Pour the ingredients into a mixing glass with several ice cubes. Stir well. Strain into a chilled Old-Fashioned glass with ice. Garnish with maracschino cherry."},
{"name": "20th  Century", "description": "Shake ingredients in an iced cocktail shaker, and strain into a  chilled cocktail glass. Garnish with a lemon twist."},
{"name": "Apricot Champagne Sangria", "description": "Combine all ingredients in a pitcher and serve immediately, to prevent the Champagne bubbles from going flat. You can also serve over ice if desired."},
{"name": "Apricot Fizz", "description": "Add the first 4 ingredients to the mixing tin with lots of ice. Shake thoroughly and strain over lots of ice. Top up with lemonade and garnish with a lemon wheel."},
{"name": "Arizona Breeze", "description": "Build the cocktail in a glass over lots of ice, add all of the ingredients and stir."},
{"name": "Backdraft", "description": "Pour into brandy snifter and light. Place hands over top of glass to form airtight seal that extinguishes flame. Slide straw between fingers keeping seal as tight as possible. Drink beverage through straw."},
{"name": "Bacardi", "description": "Shake ingredients together in a mixing tin with ice. Strain into a cocktail glass and serve."},
{"name": "As Night Falls", "description": "Muddle the peppercorns in a cocktail shaker. Add thinly sliced ginger and muddle again. Add the other ingredients and ice. Shake vigorously. Double strain into a chilled coupette glass. Garnish with an orange zest and a piece of star anise."},
{"name": "Atone-Mint", "description": "Muddle the mint and simple syrup in a highball glass. Fill the glass with ice. Add the vodka and lemon juice.Top off with sparkling water. Garnish with a lemon wedge."},
{"name": "Autumn Slumber Toddy", "description": "Pour the liquors, syrup and lemon into an Irish coffee glass.Top up with hot water and stir."},
{"name": "Aspenlicious", "description": "Coat a martini glass with dark chocolate syrup. Wet the rim with chocolate syrup and dip in grated white chocolate. In a pint glass, mix liquid ingredients with ice, shake and strain into the chocolate coated glass. Garnish with the grated chocolate on the surface of the cocktail."},
{"name": "Aviation", "description": "Add all ingredients into a cocktail shaker filled with ice. Shake well for 10 – 15 seconds and strain into cocktail glass. Garnish with a cherry."},
{"name": "B & B", "description": "Combine both ingredients in a snifter glass and stir for 10 seconds with a bar spoon."},
{"name": "Axis Kiss", "description": "Pour the Amaretto and crème de cassis into a Champagne flute. Gently top with Champagne."},
{"name": "B-52", "description": "Layer ingredients into a shot glass. Serve with a stirrer."},
{"name": "B-52 Gunship", "description": "Layer ingredients into a shot glass. Serve with a stirrer."},
{"name": "B-52 in the Desert", "description": "Layer ingredients into a shot glass. Serve with a stirrer."},
{"name": "Apple Cin", "description": "Add apple vodka, spiced rum, cranberry juice and simple syrup into a shaker with ice. Shake well for 15 seconds and strain into a chilled martini glass. Garnish with dash of cinnamon."},
{"name": "Apple Sour", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into an Old-Fashioned glass over ice."},
{"name": "Apocalypse Now", "description": "Pour the dry vermouth and tequila into a cocktail shaker with ice. Shake well. Strain into a shot glass. Float the Irish cream liqueur on top."},
{"name": "Aperol Sunrise", "description": "Pour the tequila and orange juice into the glass over ice. Add the Aperol orange liqueur, which will sink to the bottom. Do not stir. Garnish with orange slice and serve."},
{"name": "AntiFreeze", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "April Shower", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 seconds. Strain into a chilled cocktail glass."},
{"name": "Appletini", "description": "Mix in a shaker and then pour into a chilled cocktail glass. Garnish with apple slice and serve."},
{"name": "Bayou Slime", "description": "Muddle mint leaves and syrup together , making sure to crush the mint leaves. Place all ingredients into a shaker. Shake until well chilled and frothy. Strain into a well-chilled martini glass. Garnish with additional crushed mint leaves."},
{"name": "Beachcomber", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 20 seconds. Strain into a chilled cocktail glass."},
{"name": "Bazooka Joe", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well for 20 seconds and strain into a shot glass."},
{"name": "Beam Me Up Scotty", "description": "Pour the ingredients into a cocktail shaker with ice. Shake well for 10 – 15 seconds. Strain into a shot glass."},
{"name": "Beautiful", "description": "Build Cognac and Grand Marnier in a brandy snifter glass."},
{"name": "Bearded Lady", "description": "Shake all ingredients togther in a cocktail shaker with ice for 10 – 15 seconds. Strain into a chilled cocktail glass and serve chilled."},
{"name": "Belladonna", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well for 10 – 15 seconds. Strain into a Collins glass filled with fresh ice."},
{"name": "Belizean Pina Colada", "description": "Mix ingredients in a blender with crushed ice until smooth. Pour into chilled glass, garnish with pineapple slice and serve."},
{"name": "Bee Tea", "description": "Fill a highball glass with ice. Pour in the Barenjager and fill the glass with fresh brewed tea. Garnish with lemon wedge."},
{"name": "Bed of Roses", "description": "Combine and shake all ingredients over ice for 10 – 15 seconds. Strain into a chilled cocktail glass. Add a slice of lime to garnish."},
{"name": "Banana Boomer", "description": "Pour the ingredients into a shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled shot glass."},
{"name": "Beautiful Boat", "description": "Shake the vodka and mint in a cocktail shaker filled with ice. Double strain into a chilled cocktail glass. Float Champagne over top."},
{"name": "Banana Daiquiri Jelly Shot", "description": "Pour the lime juice, simple syrup and water into a glass container and add the gelatin. Allow this to sit for 1 minute. Microwave on high for 30 seconds. Stir thoroughly, ensuring the gelatin is dissolved. Add the rum and the banana liqueur. Stir thoroughly. Pour into shot glasses. Refrigerate until the liquid sets. Serve cold."},
{"name": "Banana Daiquiri", "description": "Pour the ingredients into a blender with a cup of ice . Blend at low speed for a few seconds then at high speed until smooth. Pour contents into a chilled hurricane glass. Garnish with maraschino cherry."},
{"name": "Banana Hammock", "description": "Make the banana dust by caramelizing sugar with banana syrup and spiced rum. Rim a coupe glass with the banana dust. Pour the rum, syrup, lime and bitters into a cocktail shaker filled with ice. Shake well. Strain into the prepared coupe glass."},
{"name": "Banana Split Martini", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well for 10 – 15 seconds. Strain into a well-chilled cocktail glass. Garnish with a banana slice."},
{"name": "Bananarita", "description": "Fill a highball glass halfway with ice. Pour the tequila to the rim of the ice. Add the banana liqueur as well as the margarita mix; finish by adding the garnish of a lime slice."},
{"name": "Big Brew", "description": "Shake the gin, lime juice and ginger with ice. Pour into a pint glass, add extra ice. Top up with ginger beer. Garnish with a mint leaf."},
{"name": "Big Bamboo", "description": "Pour all ingredients into a cocktail shaker with ice. Shake well for 10 -1 5 seconds and strain into shot glasses."},
{"name": "Black Nail", "description": "Build the ingredients in an Old-Fashioned glass filled with ice. Garnish with orange peel."},
{"name": "Black n Tan", "description": "Pour the pale ale into a pint glass. Float the stout on top to fill the glass by pouring it over a bar spoon over the pale ale."},
{"name": "Black Mushroom", "description": "Shake ingredients together in a cocktail shaker with plenty of ice for 20 seconds. Strain into shot glass."},
{"name": "Black Martini", "description": "Pour the ingredients into a cocktail shaker with ice. Shake Well. Strain into a chilled cocktail glass. Garnish with a lemon twist."},
{"name": "Black Magic", "description": "Pour the ingredients into the Old-Fashioned glass filled with ice cubes. Add dash of lemon juice. Stir gently and serve with lemon twist."},
{"name": "Black Jack", "description": "Layer the Jack Daniels on top of the black sambuca in a shot glass."},
{"name": "Black Haze", "description": "Combine equal amounts of the ingredients in a shot glass."},
{"name": "Black Cat", "description": "Pour the vodka and brandy into a highball glass filled with ice. Fill the glass with equal amount of cranberry juice and cola."},
{"name": "Black Cossack", "description": "Start with a 1/2 pint of ice cold stout. Drop 1 shot of vodka into stout followed by 1 shot of dark rum."},
{"name": "Black Cherry Breezer", "description": "Pour the ingredients into cocktail shaker with ice. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass filled with ice. Garnish with maraschino cherry."},
{"name": "Black and Red", "description": "Pour the ingredients into a mixing glass filled with ice. Stir well. Strain into an Old-Fashioned glass. Garnish with a cherry."},
{"name": "Black and Gold", "description": "Pour the Blavod black vodka into a cocktail shaker filled with ice. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass. Top up with Goldschlager."},
{"name": "Black Adder", "description": "First pour Jagermeister in a shot glass. Then carefully layer the Irish cream liqueur and then the coffee liqueur."},
{"name": "Black `n` Blue", "description": "Add the blueberries to the mixing tin, muddle with the gin. Add the other ingredients and lots of ice. Shake well and fine strain into a chilled martini glass. Top with 3 blueberries."},
{"name": "Bitter Sweet Symphony", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly for 10 – 15 seconds and strain into a chilled martini glass. Garnish with cherry."},
{"name": "Bitter Elder", "description": "Add all the ingredients to a mixing tin and add lots of ice. Shake thoroughly and strain into a Collins glass with loads of ice. Garnish with a lemon wheel."},
{"name": "Bishop Cocktail", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled red wine glass."},
{"name": "Biltmore", "description": "Soak a hazelnut in maraschino liqueuer for at least 2 hours. Muddle the pineapple in a mixing glass. Add the gin, vermouth and maraschino and fill with ice. Sir well. Strain into a chilled cocktail glass. Strain the hazelnut from the liqueur and drop in glass for a garnish."},
{"name": "Bloody Pari", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Ninja", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Pirate", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Molly", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Mariyaki", "description": "Add dashes of Teriyaki Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Margaret", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody LeRoy", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Hogger", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Fairy", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Eight", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Cab", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Dane", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Bishop", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloody Aztec", "description": "Pour tequila and crème de cacao into a cocktail shaker, add ice and mix. Pour red food colouring into bottom of a rocks glass. Pour contents of shaker into rocks glass. Do not stir."},
{"name": "Blood Orange Sazerac", "description": "Chill an Old-Fashioned glass by filling with ice and letting it sit whilst preparing the rest of the drink. In a separate mixing glass, muddle the simple syrup and orange bitters together. Add the rye whiskey to the bitters mixture and stir. Discard the ice in the chilled glass and rinse it with blood orange liqueur by pouring a small amount into the glass , swirling it around and discarding the liquid. Strain the whisky mixture from the mixing glass into the Old-Fashioned glass. Garnish with an orange twist."},
{"name": "Bloodless Mary", "description": "Add dashes of Worcestershire Sauce, Tabasco and salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Bloodhound", "description": "Shake the ingredients in a cocktail shaker with ice. Serve over crushed ice in a cocktail glass with strawberry coulis and strawberries garnish."},
{"name": "Blood Martini", "description": "Combine citrus vodka, ginger liqueur, dark grape juice, and blackberry syrup in a cocktail shaker filled with ice. Shake vigorously for 10 – 15 seconds and strain into a chilled martini glass. Garnish with blackberry and raspberry."},
{"name": "Brandy Sour (Cyprus)", "description": "Add ingredients to a tall glass and stir.Top up glass with lemonade and plenty of ice."},
{"name": "Brandy Smash", "description": "Muddle the mint, sugar and soda water in an Old-Fashioned glass. Fill the glass with ice cubes. Add the brandy and stir well. Garnish with a cherry."},
{"name": "Brandy Manhattan", "description": "Stir ingredients over ice in a mixing glass. Strain into a chilled cocktail glass, garnish with a maraschino cherry and serve straight up."},
{"name": "Brandy EggNog", "description": "Pour all ingredients into a cocktail shaker with ice. Shake well. Strain into an Old-Fashioned glass."},
{"name": "Brandy Cocktail", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a lemon peel."},
{"name": "Brandy Cobbler", "description": "Build the ingredients in an Old-Fashioned glass filled with crushed ice. Stir with a bar spoon and add lemon slices."},
{"name": "Bramble Royale", "description": "Add the first 4 ingredients to the mixing tin and add lots of ice. Shake thoroughly, strain into a Champagne flute and top up with Champagne."},
{"name": "Bourbon Lancer", "description": "Build over ice in a highball glass. Garnish with twist of lemon peel."},
{"name": "Bolo Cocktail", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Boiler Maker", "description": "Shot of Bourbon whiskey is dropped into glass of pale ale then drunk."},
{"name": "Bocce Ball", "description": "Pour the amaretto into an Old-Fashioned glass filled with ice cubes. Then fill with orange juice. Top with soda water."},
{"name": "Blushing Bride", "description": "Pour the peach schnapps and grenadine syrup into a Champagne flute. Top-up with Champagne."},
{"name": "BlueBerry Tea", "description": "Add both liqueurs to the snifter and then fill with hot tea to taste. Swaddle the brandy snifter in serviettes or a cloth to protect the hands. Add a lemon garnish."},
{"name": "Blueberry Collins", "description": "Add the blueberries to the mixing tin and muddle with gin. Add the lemon juice, sugar syrup and lots of ice. Shake well, fine strain over ice and top up with Soda Water. Garnish with 3 blueberries."},
{"name": "Caipisake", "description": "Place lime and sugar into Old-Fashioned glass and muddle (mash the two ingredients together using a muddler or a wooden spoon). Fill the glass with crushed ice and add the sake."},
{"name": "CaipirItaly", "description": "Place lime and sugar into Old-Fashioned glass and muddle (mash the two ingredients together using a muddler or a wooden spoon). Fill the glass with crushed ice and add the Campari."},
{"name": "Caipinheiger", "description": "Place lime and sugar into Old-Fashioned glass and muddle (mash the two ingredients together using a muddler or a wooden spoon). Fill the glass with crushed ice and add the Steinhager."},
{"name": "Caipiblack", "description": "Place lime and sugar into Old-Fashioned glass and muddle (mash the two ingredients together using a muddler or a wooden spoon). Fill the glass with crushed ice and add the Black Vodka."},
{"name": "Cadillac Margarita", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass rimmed with salt."},
{"name": "Café Amore", "description": "Pour Cognac and amaretto into an Irish coffee glass. Fill with hot coffee. Top with whipped cream. Garnish with shaved almonds."},
{"name": "Cable Car", "description": "Rim a chilled cocktail glass with sugar. Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into the prepared glass. Garnish with an orange peel spiral."},
{"name": "Buttery Nipple", "description": "Fill a cocktail glass with ice. Pour Irish cream liqueur into glass. Carefully pour the butterscoth schnapps on top of the Irish cream liqueur. Serve."},
{"name": "Bushwacker", "description": "Blend all ingredients with one cup of ice in a blender. Strain into a hurricane glass."},
{"name": "Burr Pom", "description": "Build the liquors, juices and bitters in a lowball glass filled with ice. Stir well. Top with ginger ale. Garnish with orange wheel."},
{"name": "Burnt Oranges", "description": "Pour the rum, puree and lemon juice into a cocktail shaker filled with ice. Shake well and strain into a highball glass filled with ice. Top with stout beer."},
{"name": "Burning Bush", "description": "Place lemon wedge in Irish coffee glass. Pour whiskey and honey over lemon. Fill with water."},
{"name": "Bumbo", "description": "Shake together ingredients in a mixing tin filled with ice. Pour into a cocktail glass and garnish with nutmeg."},
{"name": "Cherry Daiquiri", "description": "Add the cherries to the mixing tin and muddle with the rum. Add the other ingredients and lots of ice. Shake well, fine strain into martini glass and garnish with a cherry."},
{"name": "Cherry Blossom Tini", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Cherrute", "description": "Add all the ingredients to a mixing tin and add lots of ice. Shake thoroughly, strain into a martini glass and garnish with a cherry."},
{"name": "Chateau Cardillo", "description": "Pour the pear juice and black raspberry liqueur into a Champagne flute. Gently top with champagne."},
{"name": "Chartreuse Soleil", "description": "Pour the whisky and yellow chartreuse into an Old-Fashioned glass filled with ice. Stir."},
{"name": "Charmides", "description": "Muddle grapes, absinthe and bitters. Add gin, ginger syrup and lime juice. Shake and strain into an ice filled Collins glass, top with soda water. Garnish with candied ginger."},
{"name": "Chartreuse Martini", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Charro Negro", "description": "Rub rim of glass with lemon juice and dip in salt. Put 4 ice cubes into glass and add tequila and juice of half a lemon. Fill the glass with cola. Stir gently."},
{"name": "Charlie Chaplin", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a lime peel."},
{"name": "Chapel Hill", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Champanska", "description": "In a mixing glass, stir togther the vodka and lime cordial. Gently pour the Champagne into a Champagne flute. Add the vodka and lime mixture to the Champagne. Garnish with the lime twist."},
{"name": "Champagne Flamingo", "description": "Pour the Champagne and Campari into a cocktail shaker filled with ice. Shake well. Strain into a chilled Champagne flute. Top up with Champagne."},
{"name": "Champagne Fizz", "description": "Pour the gin, lemon juice and sugar into a cocktails shaker filled with ice. Shake well. Strain into a highball glass filled with ice. Top with Champagne."},
{"name": "Chalino Special", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a coupette glass. Garnish with lime slice."},
{"name": "Commodore", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Communitini", "description": "Rim a chilled cocktail glass with sugar. Muddle the mint and simple syrup in a cocktail shaker. Add ice, vodka and juice. Shake well. Strain into prepared glass and garnish with sprig of mint."},
{"name": "Comrade Collins", "description": "Mix the vodka, lemon juice and sugar syrup in a tall glass with ice. Top up with soda water, garnish and serve."},
{"name": "Commander White", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Colombia", "description": "Shake the vodka and citrus fruits in a mixer then strain into the cocktail glass. Slide the grenadine syrup down one side of the glass, where it will sink to the bottom. Slide the curacao down the other side, to lie between the vodka and grenadine syrup, and serve before the layers have a chance to mix."},
{"name": "Colleen Bawn", "description": "Beat the egg and syrup in a mixing glass. Add the other ingredients and ice. Shake vigorouly to ensure the egg is properly mixed. Strain into 2 well-chilled cocktail glasses. Dust with grated nutmeg."},
{"name": "Colt 45", "description": "Build the ingredients in a highball glass filled with ice. Stir well with a bar spoon and serve."},
{"name": "Coco Colada", "description": "In a blender add 1 cup of ice, pineapple juice and coconut cream. Blend until slushy. Pour into a chilled hurricane glass. Garnish with an orange slice."},
{"name": "Coconaut", "description": "Add all ingredients into an electric blender with ice and blend for approximately 20 seconds. Fill a rocks glass with crushed ice and strain in the mixture. Garnish with lime shell (optional to flame)."},
{"name": "Coco Margarita", "description": "Pour all ingredients in a shaker with ice. Shake for 10 – 15 seconds and pour into a chilled  margarita glass. Garnish with a pineapple wedge."},
{"name": "Club Cocktail", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass.Garnish with a lemon peel."},
{"name": "Cliffhanger", "description": "Stir the ingredients, excluding the cream, with ice and strain into shot glass. Float a thin layer of cream on top."},
{"name": "Citrus Caipirinha", "description": "Build the rocks glass and muddle the fruits with the sugar syrup. Add the cachaca with lots of crushed ice and churn well."},
{"name": "Citrus Banshee", "description": "Pour the vodka, banana liqueur, and crème de cacao into a cocktail shaker with ice. Shake well for 10 – 15 seconds. Strain into an Old-Fashioned glass. Top with cream."},
{"name": "Cinderella", "description": "Pour the juices into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds.  Strain into a chilled Collins glass filled with ice. Garnish with slices of pineapple and orange."},
{"name": "Death in the Afternoon", "description": "Absinthe is added to the glass after the Champagne."},
{"name": "Death by Chocolate", "description": "Pour all the ingredients with a cup of ice into a blender. Blend until smooth. Pour into a hurricane glass.Top with whipped cream and garnish with maraschino cherry."},
{"name": "Dancing Belly", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Dafne Martini", "description": "Pour the gin, pear vodka, blue curacao, and dry vermouth into a cocktail shaker with ice. Shake well for 10 – 15 seconds. Strain into a well-chilled cocktail glass. Add a dash of orange bitters."},
{"name": "D`Artagnan", "description": "Pour Armagnac , Grand Marnier, orange juice and simple syrup into a mixing glass with ice. Stir. Strain the chilled mix into a Champagne flute. Top up with Champagne. Garnish with an orange peel dropped into the drink."},
{"name": "D.R.F.O", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds.  Strain into an Old-Fashioned glass"},
{"name": "Cuban Rose", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass."},
{"name": "Cuban Missile Crisis", "description": "Build all ingredients in a highball glass filled with ice. Garnish with lime wedge."},
{"name": "Cuban Manhattan", "description": "Stir over ice, strain into a chilled cocktail glass, garnish, and serve straight up."},
{"name": "Cuban Breeze", "description": "Pour the amaretto and vodka into an Old-Fashioned glass filled with ice cubes. Then fill with pineapple juice."},
{"name": "Cuba Light", "description": "Build all ingredients in a highball glass filled with ice. Garnish with lime wedge."},
{"name": "Cricket", "description": "Combine ingredients in an ice-filled shaker. Shake well. Strain into Old-Fashioned glass and serve."},
{"name": "Crouching Tiger", "description": "Pour the ingredients into a cocktail shaker with ice. Shake well for 15 seconds. Strain into a shot glass and serve immediately."},
{"name": "Creamsicle", "description": "Pour vodka and triple sec into a mixing glass filled with ice. Fill with equal parts of orange juice and half and half. Shake well and then strain into a Collins glass filled with fresh ice."},
{"name": "Crantini", "description": "Pour the ingredients into a cocktail shaker with ice. Stir well. Strain into a chilled cocktail glass.Garnish by dropping cranberries in the glass."},
{"name": "Cranberry Spritzer", "description": "Add whiskey and cranberry juice in a Collins glass. Add ice, fill with soda water and garnish with a lime wedge."},
{"name": "Eddy", "description": "Pour the ingredients into a mixing glass with ice cubes. Stir well. Strain into a chilled cocktail glass."},
{"name": "Easy Bourbon Tea", "description": "Add bourbon and limoncello, to a double rocks glass. Add ice. Top with ice tea. Garnish with lemon wedge and serve."},
{"name": "Easter Egg Cocktail", "description": "Pour the blue curacao and crème de cacao over ice cubes in an Old-Fashioned glass. Float the half and half on top to taste."},
{"name": "Easter Bunny", "description": "Pour the crème de cacao and vodka into a cocktail shaker with ice. Shake well. Strain into an Old-Fashioned glass with ice cubes. Float chocolate syrup and cherry brandy on top."},
{"name": "Earthquake", "description": "Mix all ingredients in a wine goblet and serve."},
{"name": "East Side Press", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake vigorously. Strain into a chilled cocktail glass. Garnish with the pieces of ginger."},
{"name": "Dusk in Eden", "description": "Muddle together the pomegranate and syrup in a mixing glass. Add vodka and juice and fill with ice. Shake well and strain into a chilled martini glass. Garnish with pomegranate seeds."},
{"name": "Duncan Macleod", "description": "Mix the sake and Scotch whiskey in a beer glass with sugar. Add cola to fill and mix gently."},
{"name": "Dubonnet", "description": "Pour the ingredients into a mixing glass with ice cubes. Stir well. Strain into a chilled cocktail glass. Garnish with lemon twist."},
{"name": "Dry Manhattan", "description": "Stir over ice, strain into a chilled cocktail glass, garnish with a maraschino cherry and serve straight up."},
{"name": "Dracula’s Kiss", "description": "Coat the bottom of a highball glass with grenadine syrup. Add ice and vodka. Fill with cola. Garnish with cherries."},
{"name": "Dreamy Blues", "description": "Pour the crème de cacao into a well-chilled cocktail glass. Float the blue curacao on top."},
{"name": "Down East Delight", "description": "Pour the ingredients into a mixing glass with ice. Mix well. Strain into a chilled Old-Fashioned glass. Garnish with the maraschino cherry."},
{"name": "Double Vision", "description": "Add all the ingredients to the mixing tin and add lots of ice. Shake thoroughly for 10 -15 seconds and strain into a chilled martini glass."},
{"name": "Dorflinger", "description": "Pour the ingredients into a cocktail shaker filled with ice. Stir well. Strain into a chilled cocktail glass. Add an extra dash of orange bitters to taste."},
{"name": "Donald Sutherland", "description": "First fill a 650 ml glass with crushed ice until it is overflowing. Pour in Drambuie and rye whiskey. Stir gently, as to not bruise the ice. Keep stirring until a thick frost develops on the side of the glass. Garnish with a lemon twist. Serve."},
{"name": "Don Pedro", "description": "Combine all ingredients together in a blender. Blend until smooth. Pour into a hurricane glass and serve."},
{"name": "Dolomint", "description": "Pour the gin, Galliano and lime juice into a highball glass filled with ice. Top with ginger ale. Rub a mint leaf around the rim of the glass. Garnish with sprig of fresh mint."},
{"name": "El Diablo", "description": "Pour the tequila, cassis, and lime juice into a cocktail shaker filled with ice. Shake well. Strain into a Collins glass filled with ice. Top with ginger beer."},
{"name": "Flirtini", "description": "Muddle the pineapple pieces and triple sec in the bottom of a mixing glass. Add the vodka and pineapple juice. Stir well. Strain into a chilled cocktail glass.Top with Champagne and garnish with maraschino cherry."},
{"name": "Flaming Homer", "description": "Pour all the ingredients, except the cough syrup, into a highball glass. Stir. Add cough syrup. Ignite and extinguish before drinking."},
{"name": "Fizzy Apple Cocktail", "description": "Combine all three ingredients into a chilled cocktail glass and serve with ice and garnish."},
{"name": "Flaming Dr. Pepper", "description": "Layer the 2 spirits in a shot glass,with the high proof liquor on top. Light the shot and allow it to burn; then extinguish it by dropping it into the beer glass. Drink immediately."},
{"name": "Fish House Punch", "description": "Stir together sugar and 3½ cups water in a large bowl or pot until sugar is dissolved. Add lemon juice, rum, Cognac, and peach brandy and chill. Make sure it is covered for at least 3 hours. Put half-gallon ice block in a punch bowl and pour punch over it."},
{"name": "Firefly", "description": "Pour the vodka and grapefruit juice into a mixing glass with ice. Stir well. Strain into a highball glass filled with ice. Add the grenadine syrup. Stir again or allow the grenadine syrup to float up from the bottom."},
{"name": "Firecracker", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into shot glass."},
{"name": "Fireball", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into shot glass."},
{"name": "Farnell", "description": "Pour Jack Daniels into Collins glass filled with ice. Fill to desired level wih lemonade. Stir lightly and garnish with lime and mint."},
{"name": "Fancy Whiskey", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with lemon twist."},
{"name": "Fabiola", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass."},
{"name": "Everybody`s Irish", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with a cocktail olive."},
{"name": "Especial", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a rocks glass. Garnish with an orange zest twist."},
{"name": "English Rose", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with maraschino cherry."},
{"name": "Epiphany", "description": "Add all the ingredients to the mixing tin. Add lots of ice. Shake thoroughly and strain into a chilled martini glass. Garnish with 3 blackberries."},
{"name": "Envy", "description": "Pour the tequila into a glass of your choice. Fill the glass with ice cubes. Add the pineapple juice. Stir well. Top up with blue curacao and stir lightly again. Garnish with a cherry."},
{"name": "Ghostbuster", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 -15 seconds. Strain into a chilled cocktail glass."},
{"name": "Gibson", "description": "Stir well in a shaker with ice, then strain into a chilled martini glass. Garnish with silverskin onion and serve."},
{"name": "Garbo", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled highball glass."},
{"name": "General Sherman", "description": "Pour Southern Comfort into a shot glass and add a couple of drops of Tabasco sauce."},
{"name": "Fuzzy Navel", "description": "Pour the peach schnapps into a highball glass filled with ice cubes.Top up with orange juice. Stir well for 15 seconds with a bar spoon."},
{"name": "Full Moon Fever", "description": "Add the 3 rums and melon liqueur in a highball glass with ice. Add a little sour mix for flavour and fill the rest with apple juice."},
{"name": "Frisky Whiskey", "description": "In a mixing glass add the first 4 ingredients. Top with ice. Add bitters, top with a Boston shakers tin. Shake vigorously for 30 seconds. Strain into a chilled martini glass and serve."},
{"name": "Frostbite", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with a maraschino cherry."},
{"name": "Frog In a Blender", "description": "Place all the ingredients in a blender (including the lime wheels). Blend for 3-5 seconds (ingredients will not be completely blended). Pour into a chilled hurricane glass."},
{"name": "Full House", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 -15 seconds. Strain into a chilled cocktail glass."},
{"name": "Fresca", "description": "Add the first 4 ingredients to the mixing tin and add lots of ice. Shake thoroughly for 10 -15 seconds, strain into a chilled martini glass and top up with lemonade."},
{"name": "Friar Tuck", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well for 10 -15 seconds. Strain into a V-shaped glass (a slightly over sized cocktail glass works well)."},
{"name": "French Pear Martini", "description": "Rim a cocktail glass with superfine sugar. Shake liquors in a cocktail shaker filled with ice. Strain into the prepared cocktail glass. Top with Champagne."},
{"name": "French Kiss", "description": "Layer all the ingredients in a shot glass."},
{"name": "French Connection", "description": "Pour ingredients into a snifter glass with ice cubes. Stir gently with a bar spoon."},
{"name": "Fourth of July", "description": "Pour the grenadine syrup into a shot glass. Float vodka on top of the grenadine syrup. Float blue curacao on top of the vodka."},
{"name": "Freddy Fudpucker", "description": "Pour the tequila and orange juice into a highball glass almost filled with ice cubes. Pouring slowly and carefully over the back of a teaspoon, float the Galliano on top of the drink."},
{"name": "Four Men in a Boat", "description": "Mix the five spirits together in a shot glass and down immediately."},
{"name": "Goober", "description": "Shake ingredients in a cocktail shaker with ice and strain into a Collins glass filled with ice. Garnish with orange slice."},
{"name": "GoldenEye", "description": "Mix all ingredients in a cocktail shaker with ice and shake for 10 – 15 seconds. Strain into a chilled cocktail glass and serve with a twist of lemon."},
{"name": "Gong", "description": "Mix all ingredients in a cocktail shaker filled with ice and serve in a chilled cocktail glass."},
{"name": "Golden Raspberry", "description": "Pour the ingredientsinto a cocktail shaker with ice cubes. Shake well for about 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Golden Dream", "description": "Shake ingredients together in a cocktail mixer with cracked ice. Strain into a chilled cocktail glass and serve."},
{"name": "Golden Green Apple Cocktail", "description": "Add all three ingredients into a cocktail shaker. Add ice, shake vigorously for 30 seconds. Strain into a chilled martini glass."},
{"name": "Golden Doublet", "description": "Shake ingredients together with ice in a cocktail shaker. Strain into Champagne Flute and top-up with Champagne."},
{"name": "Golden Dawn", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Golden Cadillac", "description": "Pour ingredients into cocktail shaker with ice cubes. Shake well for 10 – 15  seconds and strain into a chilled cocktail glass."},
{"name": "Godmother", "description": "Pour both ingredients directly into Old-Fashioned glass filled with ice cubes."},
{"name": "Godfather", "description": "Build the ingredients in an Old-Fashioned glass with ice cubes. Stir well and serve."},
{"name": "Glitter Bomb", "description": "Pour energy drink into a medium sized glass. Add a shot of Goldschlager and serve."},
{"name": "Gladiator", "description": "Pour the two liqueurs into a shot glass. Pour the soda and juice into an Old-Fashioned glass. Drop the shot glass into the other glass and drown the drink."},
{"name": "Girl Scout Cookie", "description": "Pour the coffee liqueur into a shot glass. Float the Irish cream in top of the coffee liqueur and float the peppermint schnapps on top of the Irish cream liqueur."},
{"name": "Godchild", "description": "Pour both ingredients directly into Old-Fashioned glass filled with ice cubes."},
{"name": "GingerBread Martini", "description": "Rub the lime wedge on the rim of a frozen cocktail glass and leave the lime there for a garnish. Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into the glass."},
{"name": "Ginza Mary", "description": "Mix all ingredients with cracked ice in a mixing glass and pour into a chilled Old-Fashioned glass."},
{"name": "Hifi", "description": "Mix ingredients in a highball glass with ice. Garnish with orange slice and serve."},
{"name": "Harvey Wallbanger", "description": "Mix in a highball glass with ice. Add a splash of Galliano on top. Garnish and serve."},
{"name": "Hawaiian Sour", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a rocks glass. Garnish with a cherry."},
{"name": "Harvard Iced Tea", "description": "Mix ingredients in glass over ice, stir with bar spoon, garnish with a lemon slice and serve in a chilled highball glass."},
{"name": "Harrogate Nights", "description": "Fill a highball glass with ice then add a dash of cranberry juice. Add the rest of the ingredients to the Boston glass, shake with ice and strain into the highball glass. Garnish and serve."},
{"name": "Harrington", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with orange peel."},
{"name": "Happy New Year", "description": "Pour the brandy, port and orange juice into a cocktail shaker filled with ice. Shake well. Strain into a Champagne flute. Top with Champagne."},
{"name": "Hangmans Blood", "description": "Double measures of gin, whiskey, port, rum and brandy are poured into a pint glass. A small bottle of stout beer is added and the whole is topped up with Champagne."},
{"name": "Halloween Hpnotist", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with a lit Glowstick."},
{"name": "Halloween Harvest Punch", "description": "Add the liquid ingredients into a punch ball and mix well. Top with apple slices, blueberries and melon balls. Serve in an Old -Fashioned glass."},
{"name": "Halfpipe", "description": "In a rocks glass combine absinthe, coffee liqueur, cream liqueur. Stir with ice for 10 -15 seconds."},
{"name": "Hairy Navel", "description": "Pour the peach schnapps and vodka into an Old-Fashioned glass with ice cubes.Top up with orange juice. Stir well and serve."},
{"name": "Grog", "description": "Put all the ingredients into a heat proof mug and fill with boiling water. If preferred serve in a strong tumbler when the drink has cooled a little (so as not to break the glass)."},
{"name": "Grinch", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with a maraschino cherry."},
{"name": "Green Vesper", "description": "Shake the gin, vodka, absinthe and quinine powder in a mixing tin with plenty of cracked ice. Strain into a chilled cocktail glass and twist a large swatch of thin cut lemon peel over the top."},
{"name": "Green Lemonade", "description": "Muddle the kiwi and simple syrup in a mixing glass. Add ice, lemonade and limeade. Strain into a highball glass filled with ice. Garnish with lime wedge."},
{"name": "Hot Apple Pie", "description": "Pour the Tuaca in an Irish coffee glass. Fill with hot apple cider. Top with whipped cream. Garnish with a cinnamon stick."},
{"name": "Greentini", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with a lime wedge."},
{"name": "Irish Canadian", "description": "Pour the ingredients in a mixing glass with ice. Stir well with a bar spoon. Strain into a chilled cocktail glass."},
{"name": "Irish Buck", "description": "Combine Irish whiskey and lime juice over ice in a Collins glass. Top up with ginger ale and garnish with lime wheel."},
{"name": "Incredible Hulk", "description": "Stir together in a mixing glass with ice. Serve over ice into a chilled cocktail glass."},
{"name": "Immaculate", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass."},
{"name": "In & Out Lemontini", "description": "Pour a splash of Limoncello into a frozen cocktail glass. Swirl the liqueur around in a glass until all surfaces are coated. Shake the vodka in a cocktail shaker filled with ice. Throw away any excess Limoncello in the glass. Strain the shaken vodka into the coated cocktail glass. Garnish with a lemon twist."},
{"name": "Illusion", "description": "Pour the melon liqueur, vodka, white rum, triple sec, blue curacao and pineapple juice into a highball glass filled with ice cubes. Stir well. Top with lemonade, stir again gently, and serve."},
{"name": "Imperial Fizz", "description": "Pour the whisky, lemon juice and sugar into a cocktail shaker with ice. Shake well. Strain into a highball glass filled with ice. Fill with soda. Stir well."},
{"name": "Hurricane", "description": "Shake ingredients in a cocktail shaker with ice, then pour into chilled cocktail glass glass and serve over ice."},
{"name": "Iceberg", "description": "Pour all the ingredients into a cocktail shaker filled with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Huntress Cocktail", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled Old-Fashioned glass."},
{"name": "Hunters Cocktail", "description": "Pour the whiskey and cherry brandy into an Old-Fashioned glass with ice. Stir well. Garnish with a maraschino cherry."},
{"name": "Hot Buttered Rum", "description": "Place the butter, sugar and spices at the bottom of an Irish Coffee glass. Muddle ingredients. Pour in the rum and hot water and then stir."},
{"name": "Hot Peppermint Patty", "description": "Pour the liqueurs into Irish coffee glass. Fill with hot chocolate. Top with whipped cream. Garnish with shaved chocolate."},
{"name": "Hot Baked Apple Toddy", "description": "Place the baked apple into a warm Irish coffee glass. Add whiskey and dissolve sugar in the mix. Garnish with a cinnamon stick."},
{"name": "Hot Apple Toddy", "description": "Coat the bottom of a Irisih coffee glass with honey. Add the apple brandy. Fill with hot apple cider. Garnish with lemon, cloves and cinnamon stick."},
{"name": "Hot and Fruity Toddy", "description": "Pour the liquor, honey and lime into an Irish coffee glass. Top with hot water and add bitters. Stir. Garnish with apple wedge."},
{"name": "Horses Neck", "description": "Pour brandy and ginger ale directly into Old Fashioned glass with ice cubes. Stir gently. Garnish with lemon zest. If required, add dashes of Angostura Bitter."},
{"name": "Jersey Cocktail", "description": "Pour the whisky and syrup into an Old-Fashioned glass filled with ice. Add the bitters and stir well."},
{"name": "Jellyfish", "description": "Fill a highball glass with ice and add vodka. Float the blue curacao slowly on top. Float the white sambuca on top in the same manner.Float the cream on the very top using the back of a bar spoon. Stir very delicately to get “jellyfish” effect."},
{"name": "Jellybean", "description": "Pour the brandy into a shot glass. Float the sambuca on top of the first layer .Float the Southern Comfort on top of the second layer."},
{"name": "Jell-O Shot", "description": "Pour gelatin into a bowl. Add boiling water, stirring until the gelatin has dissolved. Stir in liquor. Refrigerate until cool. Pour into shot glasses. Refrigerate until liquid sets. Serve cold."},
{"name": "Japanese Slipper", "description": "Start with a cocktail shaker and fill it half full with crushed ice. Add melon liqueur, triple sec, and lemon juice. Shake and strain into a chilled cocktail glass. Garnish with a single cherry in the bottom of the glass."},
{"name": "Jamican Cobbler", "description": "Build the ingredients in the order listed in a wine glass filled with crushed ice. Garnish with the raspberries."},
{"name": "Jallu Collins", "description": "Mix the Jalovinna, lemon juice and sugar syrup in a tall glass with ice, top up with soda water, garnish with maraschino cherry and serve."},
{"name": "Jamaican Coffee", "description": "Brew coffee a little stronger than you usually take it. Pour coffee into a mug. Add rum and stir well. Spoon whipped cream on top of coffee. Sprinkle ground coffee on top of the cream. Serve with a spoon and straw."},
{"name": "Jager Bomb", "description": "Pour energy drink into a medium sized glass. Add a shot of Jagermeister and serve."},
{"name": "Jagertee", "description": "Heat your tea, rum, wine, orange juice, brandy, spices, and lemons in a pot and let them come to a gentle simmer for about 5 minutes. Remove from heat. Add sugar to taste and serve."},
{"name": "Jack O`Lantern", "description": "Combine all ingredients in a cocktail shaker and shake with ice. Strain into a lowball glass with ice. Float an orange wheel with a lime twist poked into the top."},
{"name": "Jack Rose", "description": "Add all ingredients into mixing tin filled with ice and shake for 10 seconds. Strain into a chilled cocktail glass, garnish and serve straight up."},
{"name": "Ja Mora", "description": "Add the first 4 ingredients to the mixing tin and add loads of ice. Shake thoroughly, strain into a chilled Champagne flute and top up with Champagne."},
{"name": "Jack Collins", "description": "Mix the Applejack, lemon juice and sugar syrup in a tall glass with ice. Top up with soda water, garnish with maraschino cherry and serve."},
{"name": "Italian Sunset", "description": "Fill a tall glass with crushed ice. Pour the Amaretto over the ice then slowly add the orange juice then top up with soda water to form layers. Add a dash of grenadine syrup then garnish with orange slice."},
{"name": "Italian Coffee", "description": "Pour the Strega into an Irish coffee glass. Fill with hot coffee. Top with whipped cream. Garnish with grated nutmeg."},
{"name": "Kremlin Colonel", "description": "Mix all ingredients, except the mint leaf, in a shaker. Strain in a highball glass. Garnish with the mint leaf."},
{"name": "Koala Mojito", "description": "In a cocktail shaker, muddle mint leaves with the syrup. Add the lime juice and stir. Add rum and crushed ice and stir. Add a splash of soda water. Garnish with eucalyptus leaves."},
{"name": "Kool Aid", "description": "Pour the melon liqueur and amaretto into a shot glass. Fill with cranberry juice and serve."},
{"name": "Kiwi Martini", "description": "Muddle the skinned kiwi with sugar syrup in a cocktail shaker. Add ice and vodka. Shake well. Strain into a chilled cocktail glass. Garnish with a slice of kiwi."},
{"name": "Kiwi Crush", "description": "Peel and quarter the kiwi and muddle with the vodka in the mixing tin. Add the other ingredients and lots of ice. Shake and fine strain into chilled martini glass  and garnish with a kiwi slice."},
{"name": "Kissy Suzuki", "description": "Pour the vodka, raspberry puree, cranberry juice, and apple juice into a cocktail shaker with ice cubes. Shake well. Strain equally into 2 highball glasses half-filled with ice cubes.Top up with lemon-lime soda. Garnish with strawberries."},
{"name": "Kir Petillant", "description": "Add the crème de cassis to the bottom of a wine glass, then top up with sparkling wine."},
{"name": "Kir Peche", "description": "Add the peach liqueur to the bottom of a wine glass, then top up with white wine."},
{"name": "Kir Breton", "description": "Add the crème de cassis to the bottom of a wine glass, then top up with Breton cider."},
{"name": "Kir Nomand", "description": "Add the crème de cassis to the bottom of a wine glass, then top up with Normandy cider."},
{"name": "Key Lime Pie Martini", "description": "Rim a chilled cocktail glass with finely crushed Graham crackers. Pour the vodka, triple sec, pineapple juice and lime cordial into a cocktail shaker with ice. Squeeze the juice from the lime into the shaker. Shake well. Strain into a cocktail glass."},
{"name": "Kioki Coffee", "description": "Brew coffee and pour into Irish coffee glass. Add brandy and coffee liqueur. Add whipped cream to the top."},
{"name": "Kir", "description": "Add the crème de cassis to the bottom of a wine glass, then top up with wine."},
{"name": "Kentucky Screwdriver", "description": "Pour the Bourbon whiskey into a Collins glass with ice. Top up with orange juice."},
{"name": "Kensington Court Special", "description": "Shake ingredients together with ice in a cocktail shaker and strain into a chilled cocktail glass."},
{"name": "Kempinsky Fizz", "description": "Add the first 3 ingredeints to the mixing tin with lots of ice. Shake thoroughly, strain over lots of ice and top up with ginger ale. Garnish with mixed berries."},
{"name": "Long Beach Iced Tea", "description": "Mix ingredients in glass over ice, stir, garnish with lemon slice and serve in highball glass."},
{"name": "Liquid Cocaine", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a shot glass."},
{"name": "Liquid Bourbon Ball", "description": "Pour the bourbon and liqueur over ice in a mixing glass. Stir. Strain into a chilled cocktail glass. Garnish with chocolate shavings."},
{"name": "Link-Up", "description": "Add ingredients into cocktail shaker and fill with ice. Shake for 10 seconds  and serve on the rocks in a cocktail glass."},
{"name": "Lindsay Lohan", "description": "Combine Jägermeister and schnapps in glass full of ice. Add cranberry juice and splash of coke to fill to top. Stir as necessary."},
{"name": "Lime Cola", "description": "Pour the lime juice into an Old-Fashioned glass filled with ice.Top with cola. Garnish with a lime wedge."},
{"name": "Light `N` Stormy", "description": "Pour the rum into a glass over ice. Pour the ginger beer over it. Squeeze in the lime wedge and drop it in."},
{"name": "Licorice Stick", "description": "Pour the vodka and sambuca into a cocktail shaker with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a short black licorice stick."},
{"name": "Lichitini", "description": "Pour the ingredients into a mixing glass filled with ice. Stir well. Strain into a chilled cocktail glass. Drop a lychee in the glass for garnish."},
{"name": "Liberal", "description": "In a mixing glass add all the ingredients except lemon twist. Add ice. Stir with bar spoon and strain into a chilled martini glass."},
{"name": "Lemon Drop", "description": "Pour vodka into shot glass. Coat a lemon wedge with sugar. Drink the shot of vodka. Follow up immediately with a bite into the sugary lemon."},
{"name": "Leite de Onca", "description": "Mix the condensed milk and the milk until they blend together. Add cachaça and let it rest. Add cocoa liqueur when it’s ready to serve."},
{"name": "Leap Year", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with a lemon twist."},
{"name": "Lavender Martini", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with lavendar sprig."},
{"name": "Lavender Lemon Drop", "description": "Lightly muddle the lavendar and simple syrup in a cocktail shaker. Add ice and other ingredients. Shake well. Strain into a chilled cocktail glass. Garnish with a lavendar sprig."},
{"name": "Margarita Jelly Shot", "description": "Pour the lime juice, simple syrup and water into a glass container and add the gelatin. Allow this to sit for one minute. Microwave on high for thrity seconds. Stir thoroughtly, ensuring the gelatin has dissolved. Add the triple sec, tequila and food colouring. Stir thoroughly.Pour into shot glasses.Refrigerate until the liquid sets. Serve cold."},
{"name": "Maracuja Batida", "description": "Halve and scoop out the Passion Fruit and muddle with the cachaca in the mixing tin. Add the other ingredients and lots of ice. Shake and fine strain and then garnish with passion fruit shell."},
{"name": "Mango Tonic", "description": "Build all the  ingredients in an ice filled highball glass. Garnish with lime wedge."},
{"name": "Mango Sour", "description": "Place all of the ingredients in a blender, and mix until they are smooth. Serve in an Old-Fashioned glass."},
{"name": "Mango Spice", "description": "Muddle jalapeno, agave syrup and mango nectar in a mixing tin.  Add remaining ingredients. Shake with ice. Fine strain into a cocktail glass. Garnish with jalapeno slice."},
{"name": "Mango Julius", "description": "Place all the ingredients into a blender with 1/2 cup of ice. Blend until smooth. Pour into a chilled hurricane glass."},
{"name": "Mango  Margarita", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled margarita glass."},
{"name": "Man `O War", "description": "Shake all ingredients well with ice in a mixing tin  and pour on the rocks in an Old-Fashioned glass. Garnish with slice of orange."},
{"name": "Mamie Taylor", "description": "Pour the whiskey and lime juice into a highball glass filled with ice. Top with ginger ale. Garnish with a lime wedge."},
{"name": "Major Bailey", "description": "Add all the ingredients to mixing tin and fill to the top with cubed ice. Shake vigorously for 10 seconds. Fill a sling glass with crushed ice and strain mixture into glass. Using a bar spoon swizzle up and down until ice is suspended in the drink. Top up with some crushed ice and garnish with lemon slices and mint."},
{"name": "M&M", "description": "Pour the coffee liqueur in the bottom of a shot glass.Top with the amaretto."},
{"name": "Mainbrace", "description": "Add all the ingredients to the mixing tin and fill with ice.  Shake thoroughly and strain into a chilled martini glass.  Garnish with orange zest twist."},
{"name": "Maidens Prayer", "description": "Add all the ingredients to the mixing tin and fill with ice. Shake thoroughly and strain into a chilled cocktail glass."},
{"name": "Magic Bus", "description": "Add all the ingredients to the mixing tin and fill with ice. Shake thoroughly and strain into a chilled martini glass."},
{"name": "Madroska", "description": "Build the cocktail in the Collins glass over lots of ice. Add all the ingredients, stir with bar spoon and garnish with an orange slice."},
{"name": "Mae West", "description": "Pour the brandy, egg and sugar into a cocktail shaker with ice cubes. Shake vigorously. Strain into a highball glass filled with ice. Top with cayenne pepper."},
{"name": "Madras", "description": "Pour the vodka and cranberry juice into a highball glass. Stir well. Top up with orange juice."},
{"name": "Midnight Smash", "description": "Muddle blackberries in a cocktail shaker. Add the juice of 1 Meyer lemon, Averna liqueur, and orange flavoured vodka. Shake vigorously over ice. Strain over ice in a highball glass. Add ginger beer. Garnish with an orange wheel."},
{"name": "Midnight Martini", "description": "Pour the ingredients into a cocktail shaker filled with ice. Stir with a bar spoon. Strain into a chilled cocktail glass. Garnish with a lemon twist."},
{"name": "Michigan Iced Tea", "description": "Mix ingredients in glass over ice, stir, garnish with lemon slice and serve in highball glass."},
{"name": "Miami Iced Tea", "description": "Build ingredients in a Collins glass. Stir and serve."},
{"name": "Michelada", "description": "Mix all ingredients in a tall high glass with lots of ice. Add beer, mix and serve."},
{"name": "Mezcal Passion", "description": "Add the lime, agave nectar and cucumber slices to a mixing glass and then muddle. Add the rest of the ingredients and then ice. Shake and strain into a rocks glass filled with ice. Garnish with a slice of cucumber and a pinch of chilli powder."},
{"name": "Mex-tini", "description": "Pour ingredients into a cocktail shaker and add crushed ice. Let stand for five seconds. Shake vigorously for five seconds. Strain into a martini glass and garnish with an orange slice."},
{"name": "Mexican Surfer", "description": "Add all the ingredients to a mixing tin and add lots of ice. Shake thoroughly, strain into a coupette glass and garnish with orange zest twist."},
{"name": "Mexican Mojito", "description": "Mint sprigs muddled with simple syrup and lime juice. Tequila added and topped with soda water. Garnish with sprig of mint leaves. Serve with a straw."},
{"name": "Mexican Martini", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a chilled coupette glass. Garnish with pineapple leaf."},
{"name": "Metropolitan", "description": "Stir over ice in a mixing glass, strain into a chilled cocktail glass, garnish with maraschino cherry and serve straight up."},
{"name": "Merry Irishman", "description": "Build ingredients in a rock glass filled with ice. Garnish and stir with a candy cane."},
{"name": "Merry Christmas", "description": "Pour the gin and juice into a Collins glass filled with ice. Stir. Top with soda water. Garnish with cranberries."},
{"name": "Melon Splash", "description": "Mix the bourbon, soda and liqueur in a mixing glass. Pour over ice in an Old-Fashioned glass. Garnish with slice of lime."},
{"name": "Melon Patch", "description": "Pour the first three ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a highball glass with ice cubes. Add the soda water. Garnish with the orange slice."},
{"name": "Melon Margarita", "description": "Pour all ingredients in a shaker with ice. Shake and pour into a margarita glass. Garnish with slice of lemon peel."},
{"name": "Melon Cucumber-tini", "description": "Muddle a few slices of cucumber over ice in a mixing glass. Pour the muddled cucumber, vodka and simple syrup into a cocktail shaker with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a cucumber slice."},
{"name": "Napolean", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Naked Lady", "description": "Put all ingredients into a shaker. Throw in the ice. Shake  until the outside of the shaker gets very cold. Double strain into a chilled cocktail glass. Garnish with the lemon zest."},
{"name": "My Fair Lady", "description": "Shake ingredients in a cocktail shaker together with ice, and strain into a chilled cocktail glass."},
{"name": "Mudslide", "description": "Fill an Old-Fashioned glass with ice. Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into the Old- Fashioned glass."},
{"name": "Muddled Rebuttal", "description": "Muddle 5 raspberries with 1 teaspoon sugar. Pour into tall glass over ice. Top with vodka and lemonade. Garnish with lemon wedge."},
{"name": "Mountain Sipper", "description": "Add all the ingredients to a mixing tin and add lots of ice. Shake thoroughly and strain into a rocks glass with loads of ice. Garnish with an orange wedge."},
{"name": "Mound Bar", "description": "Pour the coconut rum into an Irish coffee glass. Fill with hot chocolate. Stir well. Top with whipped cream."},
{"name": "Moonwalk", "description": "Shake well in a cocktail shaker with ice, strain into wine glass and top up with Champagne."},
{"name": "Monte Carlo", "description": "Stir ingredients over ice, strain into a chilled cocktail glass, garnish with a maraschino cherry and serve straight up."},
{"name": "Momotaro", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a martini glass.  Garnish with a lemon zest twist."},
{"name": "Moloko Plus", "description": "Shake all ingredients with ice in a cocktail shaker. Strain into a chilled tall glass."},
{"name": "Modern English", "description": "In a cocktail shaker filled with ice, combine all ingredients except for garnish. Shake well and strain into a martini glass. Add cinnamon stick garnish."},
{"name": "Mojito Royal", "description": "Muddle mint sprigs in a glass with sugar and lime juice. Add rum and top up with Champagne. Garnish with sprig of mint leaves. Serve with a straw."},
{"name": "Mochatini", "description": "Rim a cocktail glass with white chocolate and sugar. Pour the liqueurs and vodka into a cocktail shaker filled with ice. Shake well. Strain into the chilled cocktail glass."},
{"name": "Misty Maple Leaf", "description": "Pour the Canadian Mist and maple syrup into a cocktail shaker with ice. Shake well. Strain into an Old-Fashioned glass with ice. Add a splash of soda water."},
{"name": "Misty Pear", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with Asian pear."},
{"name": "Oriental", "description": "Add all ingredients in a cocktail shaker. Add ice and shake vigorously. Strain into a chilled martini glass. Garnish with cherry."},
{"name": "Orange Martini", "description": "Pour the ingredients into a cocktail shaker half filled with cracked ice. Shake well. Strain into a chilled cocktail glass. Garnish with the orange twist."},
{"name": "Orange Oasis", "description": "Pour the gin, brandy and orange juice into a cocktail shaker with ice. Shake well. Strain into an ice filled highball glass. Top off the glass with ginger ale. Garnish with orange slice."},
{"name": "Orange Tundra", "description": "Add the ingredients to a highball glass in the following order: vodka, cream soda, coffee liqueur, and finally orange juice. Ice may be added if required. Do not stir before serving."},
{"name": "Orange Margarita", "description": "Pour the ingredients into a blender with half a cup of ice. Blend until smooth. Pour contents into a chilled margarita glass. Garnish with orange slice."},
{"name": "Orange Blossom", "description": "Pour the ingredients into a mixing glass with ice cubes. Stir well with a bar spoon and strain into a chilled cocktail glass."},
{"name": "Orange  Julius", "description": "Place all ingredients in a blender with 1/2 cup of ice. Blend until smooth. Pour into a chilled hurricane glass."},
{"name": "One Balled Dictator", "description": "Briefly but violently shake ingredients in a mixing tin then pour into rocks glass containing one candy cinnamon ball."},
{"name": "Old Pal", "description": "Add all ingredients to a mixing glass. Add ice. Stir for 30 seconds. Strain into a chilled cocktail glass."},
{"name": "Old Lay", "description": "Pour the tequila, triple sec and lime juice into a cocktail shaker with ice. Shake well. Strain into a chilled cocktail glass. Top with grenadine syrup."},
{"name": "Old Etonian", "description": "Shake all ingredients with ice and strain into a chilled stemmed cocktail glass."},
{"name": "October Screwdriver", "description": "Pour the orange juice into a Collins glass filled with ice. Slowly float the Blavod on top."},
{"name": "Old Cuban", "description": "Muddle the rum with the mint. Add the lime and syrup. Shake thoroughly, strain into a chilled Champagne flute and top up with Champagne."},
{"name": "Obituary Cocktail", "description": "Pour the ingredients into a mixing glass filled with cracked ice. Stir well. Strain into a chilled cocktail glass."},
{"name": "Oatmeal Cookie", "description": "Pour the ingredients into a cocktail shaker with ice. Shake well and then strain into a shot glass."},
{"name": "Nutty Martini", "description": "Pour the vodka and Frangelico into a cocktail shaker half-filled with ice. Add the sugar syrup. Shake. Strain into a chilled cocktail glass."},
{"name": "Pegu", "description": "Shake ingredients together in a mixing tin with crushed ice. Strain into chilled cocktail glass, garnish with lime twist and serve."},
{"name": "Peppermint Kiss", "description": "Add all of the ingredients to a cocktail shaker. Add ice and shake for 15 seconds, strain into a Collins glass. Garnish with a basil leaf and one raspberry sitting in front of the leaf."},
{"name": "Pearl Harbour", "description": "Pour the vodka and melon liqueur into an Old-Fashioned glass filled with ice. Fill with pineapple juice. Garnish with a maraschino cherry and pineapple chunk on a skewer."},
{"name": "Pear and Elderflower Martini", "description": "Add all the ingredients to a mixing tin and add lots of ice. Shake thoroughly, strain into a chilled martini glass and garnish with pear slice."},
{"name": "Pear and Cardamom Sidecar", "description": "Crush the cardamoms and muddle with the rest of the ingredients in a mixing glass. Shake over ice and double strain into a chilled martini glass."},
{"name": "Peach Pomegranate Holiday Martini", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with cinnamon and sugar."},
{"name": "Peach Mojito", "description": "Gently muddle the mint and the rum in the glass. Add the other ingredients and lots of crushed ice. Top up with soda water, churn well, garnish and serve."},
{"name": "Peach Long Island", "description": "Mix all ingredients in glass over ice, stir, garnish with lemon slice and serve in highball glass."},
{"name": "Peach Margarita", "description": "Pour the ingredients into a blender with 1/2 cup of ice. Blend until smooth. Pour the contents into a chilled margarita glass."},
{"name": "Peach Julius", "description": "Place all ingredients into a blender with 1/2 cup of ice. Blend until smooth. Pour into a chilled hurricane glass."},
{"name": "Peach Cosmopolitan", "description": "Add all ingredients into a cocktail shaker filled with ice. Shake well and double strain into large chilled cocktail glass. Garnish with lime wedge."},
{"name": "Patriot Sangria", "description": "Pour wine in a pitcher. Toss in the fruit and add sugar and Limoncello. Carefully stir until well blended. Chill overnight. Add ginger ale and ice just before serving."},
{"name": "Passion Punch", "description": "Halve and scoop out the Passion Fruit and muddle with rum in the mixing tin. Add the other ingredients and lots of ice. Shake and fine strain into a rocks glass and then garnish with passion fruit shell."},
{"name": "Passion Fruit Vodkatini", "description": "Halve and scoop out the Passion Fruit and muddle with rum in the mixing tin. Add the other ingredients and lots of ice. Shake and fine strain into a chilled cocktail glass and then garnish with passion fruit shell."},
{"name": "Passion Fruit Martini", "description": "Halve and scoop out the Passion Fruit and muddle with the gin in the mixing tin. Add the other ingredients and lots of ice. Shake and fine strain and then garnish with passion fruit shell."},
{"name": "Passion Fruit Sangria", "description": "Pour wine in the pitcher and squeeze the juice wedges from the lemon, orange and lime into the wine.Toss in the fruit wedges and add passion fruit juice and pineapple juice. Chill overnight. Add ginger ale and thinly sliced kiwi fruit just before serving."},
{"name": "Passion Fruit Caipirinha", "description": "Build in the glass, halve and scoop out the passion fruit, add the quartered lime, and muddle with cachaca. Add all the other ingredients and churn with lots of crushed ice."},
{"name": "Pomegranate – Pineapple Fireworks", "description": "Pour the vodkas and juice into a Champagne glass. Top with Champagne."},
{"name": "Polished Princess", "description": "In the bottom of a mixing glass , muddle the cranberries and spice in the simple syrup and lemon juice. Then add remaining ingredients and dry shake. Then add ice and shake again. Strain into a chilled martini glass and add 3 floating cranberries for garnish."},
{"name": "Polar Bear Cooler", "description": "Add ingredients into cocktail shaker full of ice. Strain into a Collins glass filled with broken ice and add a spiral of lemon. Garnish with an orange wedge . Serve with straw."},
{"name": "Polar Bear in Blizzard", "description": "Shake all ingredients with crushed ice in a mixing tin.  Serve in a shot glass with a mint leaf garnish."},
{"name": "Poinsettia", "description": "Chill all the ingredients beforehand. Pour the triple sec and cranberry juice into a chilled Champagne flute. Stir well. Top with Champagne."},
{"name": "Playa Del Mar", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into coupette glass."},
{"name": "Planters Punch", "description": "Pour all ingredients into shaker filled with ice. Shake well. Pour into highball with ice. Top up with soda water. Stir gently and add a dash of Angostura Bitters. Garnish with orange slices."},
{"name": "Pixie Stick", "description": "Shake gin and melon liqueur in a cocktail shaker filled with ice. Strain into a Tom Collins  glass with ice. Fill up with lemon and lime soda and garnish with a cherry."},
{"name": "Pirates Treasure", "description": "Pour the goldschlager into a shot glass. Float the rum on top by pouring it slowly over the back of a bar spoon."},
{"name": "Pink Lady", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake vigorously. Strain into chilled cocktail glass and garnish with cherry."},
{"name": "Pink Squirrel", "description": "Pour ingredients into cocktail shaker filled with ice. Shake well and strain into a chilled cocktail glass."},
{"name": "Pink Russian", "description": "Add the crème de cassis to the bottom of a wine glass, and then top up with milk."},
{"name": "Pink Honey Martini", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled martini glass filled with ice."},
{"name": "Pink Grapefruit Margarita", "description": "Add all the ingredients to the mixing tin and add lots of ice. Shake thorughly, strain into a coupette glass and garnish with lime wheel."},
{"name": "Raspberry Margarita", "description": "Pour the ingredients into a blender with 1 cup of ice. Blend until smooth. Pour the contents into a chilled margarita glass. Garnish with fresh raspberries."},
{"name": "Raspberry Martini", "description": "Gently muddle the raspberries with the vodka in the mixing tin, add the other ingredients and lots of ice, shake and fine strain. Garnish with raspberries."},
{"name": "Raspberry Cosmopolitan", "description": "Gently muddle the raspberries with the vodka in a mixing tin, add the other ingredients and lots of ice, shake and fine strain. into a chilled martini glass. Garnish with raspberries."},
{"name": "Raspberry Collins", "description": "Gently muddle the raspberries with the gin in the mixing tin, add the lemon and sugar and lots of ice, shake, fine strain over ice and top up with soda water. Garnish with raspberries."},
{"name": "Raspberry Cobbler", "description": "Gently muddle the raspberries with the vodka in a mixing tin, add the other ingredients and lots of ice, shake and fine strain. Garnish with lemon zest twist."},
{"name": "Raspberry Caipirinha", "description": "Place the raspberries and lime juice into an Old-Fashioned glass and add sugar on top. Muddle well. Fill the glass with ice, then add the cachaca. Stir well. Garnish with a raspberry."},
{"name": "Raspberry Bellini", "description": "Muddle the raspberries, sugar and lime juice in a cocktail shaker. Fill with ice and add cachaca. Shake vigorously. Strain into a Champagne flute. Top with Champagne."},
{"name": "Quentao", "description": "Caramelize the sugar with the spices and peels, then add the liquids. Boil for a few minutes then serve hot."},
{"name": "Purple Turtle", "description": "Pour equal amounts of the ingredients into a cocktail  shaker with ice cubes. Shake well. Strain into a chilled shot glass."},
{"name": "Purple Viking", "description": "Pour the liqueurs, juice and sour mix into a highball glass filled with ice. Stir well. Top with a splash of soda water."},
{"name": "Purple Hooter", "description": "Pour the ingredients into a mixing glass with ice. Stir well. Strain into a shot glass."},
{"name": "Rabo-de-Galo", "description": "Mix the 2 ingredients and serve staright up in large shot glass."},
{"name": "Purple Haze", "description": "Pour the vodka and black raspberry liqueur into a cocktail shaker with ice. Shake well. Strain into an Old-Fashioned glass with ice."},
{"name": "Pucker Up", "description": "Muddle the juice of 1 lime with 2 slices of ginger, the Angostura bitters and the sugar syrup. Strain into a lowball glass with ice cubes and add the bourbon. Fill as required with the soda water and stir before serving."},
{"name": "Rose Kennedy Cocktail", "description": "Pour vodka, soda water, and splash of the cranberry in rocks glass on ice. Garnish the beverage with lemon wedge."},
{"name": "Rosemary", "description": "Pour ingredients into a mixing glass with ice cubes and stir well. Strain into a chilled cocktail glass and garnish with sprig of rosemary."},
{"name": "Rose", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Rose Royce", "description": "Shake ingredients well over ice in a mixing tin and pour into a Champagne flute half-filled with Champagne. Garnish with sprig of thyme."},
{"name": "Rosabel", "description": "Pour chilled sweet vermouth, and crème de cassis directly into a Champagne flute. Top with a splash of Prosecco."},
{"name": "Root Beer Float", "description": "Fill a tall glass with ice and add the liqueurs and cream. Top up with root beer. Garnish with a dollop of whipped cream and a cherry."},
{"name": "Ron Collins", "description": "Mix the rum, lemon juice and sugar syrup in a tall glass with ice, top up with soda water, garnish with maraschino cherry and serve."},
{"name": "Rock Lobster", "description": "Pour all the ingredients except the dark rum into a blender with a cup of ice. Blend until smooth. Pour into a chilled highball glass. Top up with dark rum."},
{"name": "Rob Burns", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Roasted Toasty", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled shot glass."},
{"name": "Rob Roy", "description": "Stir ingredients over ice in a mixing glass and fine strain into a chilled cocktail glass.  Garnish with maraschino cherry and serve straight up."},
{"name": "Roasted Toasted Almond", "description": "Build the vodka and liqueurs into an old fashioned glass filled with ice. Fill with cream. Shake by placing a mixing tin over the glass and giving it one or two good shakes."},
{"name": "Ripley", "description": "Gently muddle the raspberries with the vodka in the mixing tin, add the other ingredients and lots of ice, shake and fine strain. Garnish with raspberry."},
{"name": "Rimbauds Left Hand", "description": "Combine all the  ingredients in a mixing glass, dry shake first without ice. Shake with ice and strain into a coupe glass. Garnish with drops of rose water in the center."},
{"name": "Rhett Butler", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with lemon twist."},
{"name": "Resolution Martini", "description": "Pour the all the ingredients into a cocktail shaker filled with ice. Stir well. Strain into a chilled cocktail glass. Serve."},
{"name": "Sake Bomb", "description": "The shot of sake is dropped into the beer, causing it to fizz violently. Drink should be consumed immediately."},
{"name": "Reno", "description": "Pour all the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Saigon Cooler", "description": "Gently muddle the raspberries with the gin in the mixing tin, add the other ingredeints and lots of ice, shake and fine strain over lots of ice. Garnish with raspberries."},
{"name": "Sabai Sabai", "description": "Pour the Mekhong and the rest of the ingredients, except soda water, into a mixing glass. Add ice and shake vigorously for 7-8 seconds. Strain into a chilled martini glass. Top off with soda water."},
{"name": "Russian Sunrise", "description": "Pour the vodka and orange juice into glass over ice. Add the grenadine syrup, which will sink to the bottom. Do not stir. Garnish and serve."},
{"name": "Russian Spring Punch", "description": "Add the first four ingredients to the mixing tin with lots of ice, shake thoroughly, strain and top up with Champagne."},
{"name": "Rum Swizzle", "description": "Mix in pitcher with crushed ice, shake vigorously until a frothing head appears. Strain into cocktail glasses. Garnish with a slice of orange . Serves 6."},
{"name": "Russell Collins", "description": "Mix the Jagermeister, lemon juice and sugar syrup in a tall glass with ice. Top up with soda water, garnish and serve."},
{"name": "Russian Quaalude", "description": "Pour the hazelnut liqueur into a shot glass. Float the Irish cream liqueur on top of the first layer. Float the vodka on top of the second layer."},
{"name": "Rum Punch", "description": "Add the first 4 ingredients to the mixing tin with lots of ice. Shake thoroughly, strain over lots of ice and top-up with lemonade. Garnish with an orange slice."},
{"name": "Ruby Martini", "description": "Add all the ingredeints to the mixing tin and add lots of ice. Shake thoroughly, strain into a chilled martini glass and garnish with lemon wheel."},
{"name": "Ruby Negroni", "description": "Stir in a mixing glass and strain into a flute. Top with Prosecco and garnish with a raspberry."},
{"name": "Rum Cocktail", "description": "Add all of the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into chilled martini glass."},
{"name": "Rubus", "description": "Gently muddle the raspberries with the vodka in the mixing tin, add the other ingredients and lots of ice, shake and fine strain. Garnish with raspberries."},
{"name": "Ruby Manhattan", "description": "Stir  over ice in a mixing glass and strain into a chilled cocktail glass. Garnish with a maraschino cherry and serve."},
{"name": "Royal Widow", "description": "Pour both ingredients over ice into a chilled cocktail glass and serve."},
{"name": "Shirley Temple", "description": "Mix all ingredients in a cocktail shaker with ice. Shake well for 10 -1 5 seconds and strain into cocktail glass. Serve with ice."},
{"name": "Sherry Cobbler", "description": "Place the sherry, orange and syrup into a cocktail shaker filled with crushed ice. Shake well. Pour unstrained into a tall glass. Garnish with pile of fresh blueberries and serve with straw."},
{"name": "Sherron Collins", "description": "Mix the gin, lemon juice and sugar syrup in a tall glass with ice, top up with soda water and a large splash of orange juice, garnish and serve."},
{"name": "Shamrocked", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a shot glass."},
{"name": "Shamrock Smoothie", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake until frothy. Strain into a chilled cocktail glass."},
{"name": "Shady Grove Cooler", "description": "Add the first 3 ingredients to the mixing tin with lots of ice. Shake thoroughly, strain over lots of ice and top-up with ginger ale. Garnish with a lime wheel."},
{"name": "Seasonal Breeze", "description": "Add all the ingredients  over lots of ice in a Collins glass, stir with bar spoon and garnish with a freshly cut apple slice."},
{"name": "Seven and Seven", "description": "Pour whisky into Collins glass filled with ice. Fill to desired level with 7-Up soda. Stir lightly."},
{"name": "Sea Breeze", "description": "Pour cranberry into glass first filled with ice. Dry shake the vodka with grapefruit and layer on top of the cranberry. Garnish with lime wedge."},
{"name": "Screw-Up", "description": "Mix in a highball glass with ice. Add a splash of lemon-lime soda on top. Garnish and serve."},
{"name": "Screaming Viking", "description": "Pour the ingredients into a cocktail shaker filled with ice. Stir well. Strain into a chilled cocktail glass. Garnish with a celery stalk and cucumber spear."},
{"name": "Screaming Orgasm", "description": "Pour first vodka, then Irish cream, then coffee liqueur into a cocktail glass over crushed ice. Stir and serve."},
{"name": "Scotch Whiskey Skin", "description": "In a coffee cup add Scotch whiskey. Fill 1/2 way with water. Garnish with lemon peel."},
{"name": "Scorpion", "description": "Squeeze the lime juice into a cocktail shaker with ice cubes. Add all the other ingredients. Shake well. Strain into a highball glass with ice cubes. Garnish with lime wedge."},
{"name": "Scooby Snack", "description": "Pour rum, crème de banane, melon liqueur and pineapple juice into a stainless steel shaker over ice. Add whipped cream, and shake, until well mixed and sufficiently chilled. Strain into an Old-Fashioned glass and serve."},
{"name": "Spiders Kiss", "description": "Draw a chocolate web into a martini glass. Place in freezer and chill. Shake all ingredients and strain into a glass. For a blood effect drizzle grenadine syrup down the side of the glass. Garnish with a chocolate dipped orange slice."},
{"name": "Spiced Pear Caiprini", "description": "Muddle the ginger in a cocktail shaker. Fill the shaker with ice and add cachaca, nectar and lemon juice. Shake vigorously. Strain into a chilled cocktail glass. Garnish with a pinch of nutmeg and cinnamon."},
{"name": "Spicy Sangria", "description": "Pour wine in the pitcher and squeeze the juice wedges from the lime, lemon and orange into the wine. Toss in the fruit wedges and add diced mango, honey , rum and hot sauce to the mix. Chill overnight. Add citrus soda just before serving."},
{"name": "Sparkling Wine Sangria", "description": "Combine all four ingredients in a pitcher and then serve immediately, so that you don’t lose your bubbles in your sparkling wine."},
{"name": "Spanish Coffee", "description": "Brew coffee and then add brandy and coffee liqueur. Top up the coffee with whipped cream."},
{"name": "Southern Sunrise", "description": "Pour the Southern Comfort and orange juice into glass over ice. Add the grenadine syrup, which will sink to the bottom. Do not stir. Garnish and serve."},
{"name": "Southern Bride", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass and garnish with a maraschino cherry. Serve."},
{"name": "Sour Witch", "description": "In the bottom of a mixing glass muddle the sour cherries in the lime juice and the almond syrup. Add the absinthe with ice and shake very well. Strain into a chilled Champagne flute. Garnish with freshly grated nutmeg."},
{"name": "Soul Trip Tipple", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a well chilled white wine glass with raspberries dropped in the bottom."},
{"name": "Something Blue", "description": "Build all the ingredients in a Champagne flute."},
{"name": "Soul Kiss", "description": "Stir all the ingredients with ice in a cocktail shaker. Strain into a chilled cocktail glass."},
{"name": "Soul Manhattan", "description": "Stir over ice in a mixing glass, strain into a chilled cocktail glass, garnish, and serve straight up."},
{"name": "Sombrero", "description": "Pour the coffee liqueur into an ice filled Old- Fashioned glass.  Slowly stir the ice and liqueur for about 15 seconds and then carefully float the cream by pouring it over the back of a bar spoon and into the drink. Serve immediately."},
{"name": "Soda Shop Cola", "description": "Fill a highball with ice. Add cherry juice and vanilla extract. Top off with cola. Garnish with lemon wedge."},
{"name": "Snowshoe", "description": "Pour all the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a shot glass."},
{"name": "Snowball", "description": "Place one ice cube in the glass and add Advocaat. Fill up the glass with lemonade and decorate with a slice of lemon. Serve at once."},
{"name": "Snickertini", "description": "Drizzle a thin line of both the chocolate and caramel sauce on the inside of a rocks glass and place in a refrigerator to chill. Combine all ingredients into a shaker and shake over ice. Pour entire contents of shaker into glass and add straw."},
{"name": "Stoplight", "description": "Place three shot glasses on the bar. Pour one shot of vodka in each. Add a splash of cranberry to the first shot glass. A shot of orange to the next and a splash of melon liqueur to the third. Serve."},
{"name": "Stone Wall", "description": "In a highball glass add bourbon and ice. Add simple syrup, stir briefly. Top up with soda water and serve."},
{"name": "Tequila Slammer", "description": "Mix drink in a rocks glass and serve straight up.  For fun leave about a fifth of the glass empty to allow the drink to fizz, then hold a hand over the top of the glass and slam it onto a hard surface to mix it. The slamming action releases gas bubbles from the mixed drink causing it to foam vigorously. It will then quickly escape the glass if not drunk immediately."},
{"name": "Tennessee Cowboy", "description": "Build the drink over ice, stir with barspoon and serve in a highball glass."},
{"name": "Teachers Pet", "description": "Pour the Scotch whiskey and coffee liqueur into an Old-Fashioned glass filled with ice. Shake by placing a mixing tin over the glass and giving it one or two good shakes."},
{"name": "Tartini", "description": "Begin by gently muddliung the strawberries with the raspberry vodka in the mixing tin. Add the other ingredients and lots of ice, shake and fine strain. Garnish with raspberries."},
{"name": "Tangerine Margarita", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass rimmed with salt."},
{"name": "Tamagozake", "description": "Whisk the raw egg yolk and honey into 3/4 cup of hot sake."},
{"name": "Sweet Sunrise", "description": "Fill a highball glass with ice and orange juice. Slowly pour grenadine syrup over the juice , it will sink to the bottom and slowly rise to the top of the drink. Garnish with an orange slice."},
{"name": "Tall Black Russian", "description": "Pour the ingredients into the Old-Fashioned glass filled with ice cubes. Stir gently and add splash of cola."},
{"name": "T`n`T", "description": "Mix ingredients in a highball glass with wedge of lime and ice."},
{"name": "Sweet City", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a strip of orange zest."},
{"name": "Super Sleigh", "description": "Pour Xante over ice in highball glass. Fill with lemon-lime soda. Squeeze lime wedge and drop into glass."},
{"name": "Super Fruity Sangria", "description": "Pour wine in the pitcher and squeeze the juice wedges from the lemon, orange and lime into the wine. Toss in the fruit wedges and add sliced peaches, strawberries limeade/lemonade, sugar and brandy. Chill overnight. Add ginger ale and ice just before serving."},
{"name": "Sundowner", "description": "Shake all ingredients with ice in a cocktail shaker and strain into a cocktail glass."},
{"name": "Strawmerry", "description": "Gently muddle the strawberries with the vodka in the mixing tin. Add the other ingredients and lots of ice. Shake, fine strain and garnish with a strawberry."},
{"name": "Sunburst", "description": "Mix vodka and grapefruit juice in a rocks glass over ice and add dash of triple sec."},
{"name": "Strawberry Margarita", "description": "Gently muddle the strawberries with the tequila in the mixing tin. Add the other ingredients and lots of ice. Shake, fine strain and garnish with a strawberry."},
{"name": "Strawberry Flapper", "description": "Briefly blend the strawberries in a blender. Add the crème de cassis and 10 ice cubes and blend until smooth. Fill two Champagne flutes halfway with the strawberry blend. Top off with Champagne."},
{"name": "Tootsie Roll", "description": "Pour the ingredients in a cocktail shaker filled with ice. Shake well. Strain into a shot glass."},
{"name": "Tomate", "description": "Mix ingredients in an Old-Fashioned glass and serve."},
{"name": "Tiki Bar Margarita", "description": "Add all the ingredients into a mixing tin and add lots of ice. Shake thoroughly, strain into rocks glass over lots of crushed ice and churn. Garnish with pineapple slice."},
{"name": "Toasted Almond", "description": "Pour the ingredients into a cocktail shaker with ice. Shake well. Strain into ice filled Old-Fashioned glass."},
{"name": "Tom & Jerry", "description": "Beat the sugar into the egg yolk, add the rum and incorporate the egg white. Transfer into a coffee mug and fill with boiling water. Add the brandy and garnish with grated nutmeg."},
{"name": "Tiger Tail", "description": "Layer the ingredients in order in a shots glass."},
{"name": "Tijuana Manhattan", "description": "Stir over ice in a mixing glass, strain into a chilled cocktail glass, garnish with maraschino cherry, and serve straight up."},
{"name": "Ti Punch", "description": "Squeeze the lime well into the glass and drop in the remaining lime shells . Barely cover the lime with cane sugar. Add the rum and mix it with a bar spoon."},
{"name": "Three Wise Men", "description": "Mix the three spirits together in a shot glass and down immediately."},
{"name": "The Spy Who Loved Me", "description": "Pour absinthe and vodka into a Collins glass filled with ice and stir.Top with energy drink."},
{"name": "There Will Be Rum", "description": "Shake the rum, grapefruit juice and grenadine syrup in a cocktail shaker filled with ice. Strain into a Champagne glass. Fill up with Champagne.Garnish with strawberry slice on the rim."},
{"name": "The Rickey", "description": "Combine the gin, lime and shell in a highball glass. Add ice, stir and then add sparkling mineral water."},
{"name": "The Snow Honey", "description": "Combine all the ingredients and serve hot in a mug with grated nutmeg."},
{"name": "The Phlump", "description": "Pour whiskey into Collins glass filled with ice. Fill to desired level with ginger ale. Stir lightly."},
{"name": "The Raven", "description": "Pour the vodka, rum and blue curacao into a cocktail shaker with ice. Strain into a highball glass filled with fresh ice. Slowly pour the Chambord over the back of a barspoon so it floats on top."},
{"name": "The Monkey Gland", "description": "Shake well over ice cubes in a shaker, strain into a chilled cocktail glass."},
{"name": "Ward 8", "description": "Shake all ingredients in mixer  with ice. Strain into ice-filled Old-Fashioned glass to serve on the rocks."},
{"name": "Vodka McGovern", "description": "Combine the ingredients in a highball glass. Pour over the crushed ice with a squeeze of lime on top."},
{"name": "Voodoo", "description": "Pour the Tia Maria into a shot glass. Float the rum cream on top of the Tia Maria. Pour the 151 proof rum on top of the rum cream."},
{"name": "Vieux Carre Cocktail", "description": "Pour the whiskey, Cognac and vermouth into an Old-Fashioned glass half – filled with ice. Add the bitters. Add the Benedictine then stir four times with a bar spoon. Squeeze the lemon over the drink then drop it into the glass."},
{"name": "Virgin Miami Vice", "description": "Place the pineapple juice, coconut cream, half & half and half cup of ice in blender. Blend the mixture until smooth. Pour the mixture into a highball glass. Place the strawberry puree, lime juice, simple syrup, and the remaining half cup of ice into a blender. Blend the mixture until smooth. Slowly pour the strawberry-lime mix over the back of a barspoon on top of the coconut-pineapple mixture. Garnish with a strawberry."},
{"name": "Vienna Soother", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into an Old-Fashioned glass. Top with whipped cream and shaved chocolate."},
{"name": "Virgin Mary", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into glasses with ice cubes. Stir gently. Garnish with celery stalk ."},
{"name": "Victorias Secret", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Vesper Martini", "description": "Shake over ice until well chilled, then strain into a deep goblet and garnish with a thin slice of lemon peel."},
{"name": "Very Berry Sangria", "description": "Toss the wine, the berries, the blackberry liqueur and the sugar in a pitcher, cover and place in the refrigerator overnight. Pour in a bottle of chilled ginger ale just prior to serving. Add ice in either the pitcher or individual glasses."},
{"name": "Vertigo", "description": "Stir lemon juice and ginger ale over ice in a highball glass. Float Averna on top. Garnish with a lime wedge."},
{"name": "Vermouth Cassis", "description": "Pour the creme de cassis and vermouth into a highball glass filled with ice. Stir. Fill the glass with soda water and stir again."},
{"name": "Velvet Hammer", "description": "Pour the liqueurs into a highball glass filled with ice. Stir. Gently top with half and half."},
{"name": "Valencian Water", "description": "Squeeze a glass of orange juice into a pitcher. Add a bottle of semi-dry cava. Add vodka and gin. Add sugar according to taste and put in refrigerator to chill."},
{"name": "Valkyrie", "description": "Add all ingredients into mixing tin, add lots of ice, shake thoroughly and strain into glass over lots of ice. Garnish with lemon slice."},
{"name": "Yellow Fairy", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Yellow Bird", "description": "Squeeze the lime juice into a cocktail shaker with ice. Add all of the remaining ingredients. Shake well. Strain into a Collins glass with crushed ice. Garnish with the cherry."},
{"name": "Yashmak", "description": "Pour the ingredients into a mixing glass filled with ice. Stir well. Strain into a chilled highball glass filled with ice."},
{"name": "Xalapa Punch", "description": "In a sauce pan over low heat, combine the hot black tea and rind of two oranges (grate with carrot peeler or cheese grater). Heat for 5 minutes. Remove from heat and allow to cool. Add the honey and stir until dissolved. Pour into a punch bowl with ice. Add the amber rum, apple brandy and dry red wine. Garnish with diced oranges and lemons."},
{"name": "Yale Cocktail", "description": "Pour the ingredients into a mixing glass filled with ice. Stir well. Strain into a chilled cocktail glass."},
{"name": "Wolf Bite", "description": "In a cocktail shaker add absinthe, melon liqueur, pineapple juice and ice. Shake vigorously and strain into a 50 ml shot glass. Splash lemon-lime soda on top and a drizzle of grenadine syrup."},
{"name": "Witch Hunt", "description": "Build in an Old- Fashioned glass 3/4 full of ice. Stir."},
{"name": "WooWoo", "description": "Pour all ingredients into a highball glass over ice cubes, stir with bar spoon for 15 seconds and serve."},
{"name": "Witch Doctor", "description": "Build all ingredients in a highball glass filled with ice. Garnish with lime wedge."},
{"name": "Winter Cocktail", "description": "Pour the rum, juice, sugar and liqueurs into a cocktail shaker filled with ice. Shake well. Strain into a cocktail glass. Add dashes of bitters on top."},
{"name": "Widows Cork", "description": "Fill an Old-Fashioned glass part way with ice. Add ingredients to the glass and stir gently with bar spoon."},
{"name": "White Wine Sangria", "description": "Pour wine into the pitcher and squeeze the juice wedges from the orange,lemon and lime into the wine, add brandy if desired. Toss in the fruit wedges and add sugar. Chill overnight. Add ginger ale or club soda just before serving."},
{"name": "White Lady", "description": "Mix the ingredients in a shaker which is half full of ice. Strain and serve in a sugar-rimmed glass. Garnish with a strip of lemon rind."},
{"name": "White Lightning Sangria", "description": "Pour wine and vodka in the pitcher and add sliced grapes, tangerine and pineapple. Next add sugar and stir gently. Chill mixture for at least one hour. Add ginger ale just before serving."},
{"name": "White Christmas Dream", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake vigorously. Strain into a chilled cocktail glass. Garnish with a grated nutmeg on top."},
{"name": "White Christmas", "description": "Build the ingredients into a snifter glass and stir lightly. Sprinkle chocolate flakes over drink to garnish."},
{"name": "White Canadian", "description": "Pour coffee liqueur and vodka into an Old-Fashioned glass filled with ice. Float goats milk on top and stir slowly."},
{"name": "White Carnation", "description": "Pour the vodka, schnapps and orange juice into a mixing glass filled with ice. Top with soda water and a splash of cream. Garnish with an orange slice."},
{"name": "Whispers of the Frost", "description": "Pour the drinks in a wine goblet filled with ice. Add sugar to taste. Stir. Garnish with blueberries and strawberries both in the drink and on the rim."},
{"name": "Seve Ballesteros “Al Rojo Vivo”", "description": "Add all ingredients into a Boston Shaker and fill with cubed ice. Shake well for about 10 seconds and then strain into a red wine goblet. Fill with cubed and then crushed ice and garnish lavishly with orange, red apple and mint."},
{"name": "“Blue Dog” Zombie", "description": "Quarter the passion fruit and scoop out 3 quarters into a mixing tin. Add gomme syrup and lime juice and muddle together with the passion fruit pulp. Add all other ingredients and fill with ice. Shake for 10 seconds and then strain into a hurricane glass half filled with cubed ice. Top up with crushed ice and the garnish with a quarter of passion fruit."},
{"name": "Toblerone Martini", "description": "Chill martini glass with ice and soda water. Add all ingredients into a Boston shaker and fill with ice. Shake for about 10 seconds and strain into the martini glass. Cover the drink with chocolate powder."},
{"name": "Ultra Violet", "description": "Pour the gin, pomegranate liqueur and parfait amour into boston shaker, then add the elderflower cordial, lemon juice and a dash of gomme. Pick 6 leaves from a sprig of rosemary and add to other ingredients. Fill shaker with ice and shake well. Double strain into a martini glass. Garnish with a lemon twist."},
{"name": "Blue Grass Sour", "description": "Add all ingredients into a cocktail shaker. Quarter the orange and squeeze the juice into the shaker. Fill the shaker with ice and shake hard for 30 seconds to ensure the egg white is well mixed. Double strain the drink into a small barrel tumbler and garnish with an orange wagon wheel."},
{"name": "Watermelon Martini", "description": "Peel 4 chunks of watermelon and then muddle in a mixing glass. Add remaining ingredients into mixing glass. Fill the mixing glass to the top with cubed ice and then shake for 10 seconds. Double strain into martini glass. Garnish with watermelon wedge."},
{"name": "Zurracapote", "description": "In the medium saucepan, combine brown sugar, wine, lemon peel and cinnamon. Bring this mixture to boil, and reduce heat, and simmer for five minutes, stirring continuously. Drain fruit & carefully add to your wine mixture. Cover the saucepan with lid & simmer for fifteen minutes on the low heat. Remove from the heat and let it sit for 2 to 3 hours prior to serving and Zurracapote can also be served cold or hot, like desired."},
{"name": "Blackberry & Apple Crumble Bramble", "description": "Muddle the blackberries in a jug until they are a fine pulp. Add the gin, apple juice, lemon juice and vanilla syrup in a cocktail shaker along with a couple of ice cubes. Sieve the blackberries into the shaker too. Shake all the ingredients for about 15 seconds in cocktail shaker. Blend the sugar and cinnamon together on a small plate. Coat the rim of the Collins glass with lemon juice to moisten it and then roll it in the sugar so it coats the rim. Pour the cocktail into the glass, and top up with a teaspoon of creme de cassis."},
{"name": "Plum & Vanilla Fizz", "description": "Add all ingredients, except soda, into Boston tin. Shake ingredients hard and fast for 15 seconds without ice to emulsify the egg white. Add ice and shake hard for another 15-20 seconds. Add a dash of soda to a chilled Collins glass. Pour cocktail over the soda so that it “fizz’s” up through the drink. To garnish, dip a straw or stirrer in red food colouring (unflavoured) and stir a ring around the centre of the glass going out."},
{"name": "Passion Fruit Daiquiri", "description": "Add all ingredients into Boston shaker with lots of ice and shake for about 15 seconds. Shake and fine strain into a chilled martini glass and then garnish with passion fruit shell."},
{"name": "Orange Chocolate Dream", "description": "Mix the cocoa powder and sugar on a small plate. Dampen the rim of a martini glass and swirl in the powder mixture to rim. Add the chocolate liqueur and Baileys to a cocktail shaker filled most of the way with ice and shake for about 20 seconds. Strain the mixture into a martini glass and float the orange liqueur on top. Garnish with an orange twist."},
{"name": "Chocolate-covered Cherry", "description": "Pre-measure your ingredients into separate shot glasses. Pour the grenadine into a rocks glass first. "},
{"name": "The Nirvana", "description": "Fill a large glass or beer mug with crushed ice. Add all the ingredients one by one and stir until well mixed. Garnish with a raspberry and serve with a straw."},
{"name": "Zorbatini", "description": "Pour the vodka and ouzo into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a Greek olive."},
{"name": "Zipperhead", "description": "Build the ingredients in a chilled Old Fashioned glass with ice."},
{"name": "Zipper", "description": "Pour the Grand Marnier into a shot glass. Float the tequila on top of the Grand Marnier.Top with the Irish cream liqueur."},
{"name": "Zen Latte", "description": "Pour the green tea liqueur into an ice coffee glass. Top with steamed milk. Stir well. Garnish with matcha powder."},
{"name": "Zanzibar", "description": "Pour the ingredients into a shaker with cracked ice. Shake well. Strain into a chilled hurricane glass.Twist the lemon peel over the top of the drink and drop it in the glass."},
{"name": "Zambodian", "description": "Pour equal amounts of the ingredients into a shaker with ice cubes. Shake well. Strain into a chilled shot glass."},
{"name": "Zambeer", "description": "Pour the sambuca into a highball glass with ice. Top with root beer."},
{"name": "Z-28", "description": "Pour the crème de menthe into a shot glass. Float the banana liqueur on top. Top with tequila."},
{"name": "Z Street Slammer", "description": "Pour the rum, banana liqueur, pineapple juice and grenadine syrup into a cocktail shaker with ice. Shake well. Strain into an Old-Fashioned glass."},
{"name": "Yule Mule", "description": "Build the cocktail in a glass over lots of ice. Add all the ingredients and stir. Garnish with mixed berries."},
{"name": "Yorsch", "description": "Mix ingredients thoroughly and drink quickly."},
{"name": "Yellow Submarine", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a banana slice."},
{"name": "Whiskey Smash", "description": "In a mixing glass add mint and lemon. Muddle thoroughly to release juice and oils. Add simple syrup and whisky. Add ice. Shake vigorously for 20 seconds. Strain into a rocks glass filled with crushed ice. Garnish with a mint sprig."},
{"name": "Whiskey Cobbler", "description": "Build the ingredients in an Old-Fashioned glass filled with crushed ice. Stir. Add cherry and lemon slice."},
{"name": "Whiskey Sour", "description": "Shake with ice. Strain into ice-filled Old-Fashioned glass to serve on the rocks."},
{"name": "Watermelon Margarita", "description": "Pour the ingredients into a blender with cup of ice. Blend until smooth. Pour contents into a chilled margarita glass. Garnish with a watermelon wedge."},
{"name": "Warm Old-Fashioned", "description": "Place one sugar cube into the bottom of an Old-Fashioned glass and add 3 dashes of Angostura bitters directly to the sugar cube as much as possible. Add one orange slice, one cherry and a splash of soda water and muddle thoroughly. Remove the fruit remanants. Add 2 ounces of bourbon, ice and top off with warm water. Garnish with fresh orange slice and cherry."},
{"name": "Weep No More", "description": "Pour the ingredients into a cocktails shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Wedding Cake", "description": "Pour the gin, amaretto, orange juice, pineapple juice and cream in a blender with ice. Blend well. Pour into a hurricane glass."},
{"name": "Wedding Belle", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Watermelon Wave", "description": "Pour the ingredients into a pitcher. Stir well. Strain the mixture into goblets over ice. Garnish with cubes of watermelon."},
{"name": "Washington Apple", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with apple slice."},
{"name": "Va Va Voom", "description": "Add the first three ingredients to the mixing tin with lots of ice. Shake thoroughly, strain and then top up with Champagne. Garnish."},
{"name": "Union Square", "description": "Muddle the strawberries with the basil until fully mashed in a cocktail shaker. Add all other ingredients. Add ice and shake vigorously. Strain into a martini glass. Garnish with 1/2 strawberry."},
{"name": "Un-Goa", "description": "Pour the tequila into the shot glass, then the rum and finally the lime juice."},
{"name": "Twilight Dove", "description": "Pour the juices and nectar into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Top with lavendar soda."},
{"name": "U-Boot", "description": "The shot of vodka is dropped into the pint of beer then consumed quickly."},
{"name": "Tropical Cooler", "description": "Combine all ingredients in a blender with cup of ice. Blend well. Pour into a well-chilled margarita glass."},
{"name": "Tropical Colada", "description": "In a large glass, add coconut milk, lime juice, and ice. Fill the rest of the glass with the soda."},
{"name": "Trojan Horse", "description": "Pour the stout beer into a pint glass. Top with the cola."},
{"name": "Torpes", "description": "Add all ingredients to mixing tin, add lots of ice, shake thoroughly and strain. Garnish with mixed berries."},
{"name": "Toronha", "description": "Pour the ingredients into a blender with ice. Blend well. Strain into a chilled sour glass."},
{"name": "Toro Rojo", "description": "Muddle the mint and sugar together in a tall glass, and then squeeze the lime in. Mix gently and then top glass with ice. Add in rum and then top glass with energy drink."},
{"name": "Tornado", "description": "Stir the liquors with ice. Strain into a Collins glass. Add sugar and stir again. Add ice then cola. Stir three times and serve with a straw."},
{"name": "The Modernista", "description": "Add ingredients into a cocktail shaker filled with ice and shake. Strain into cocktail glass. Add twist of lemon."},
{"name": "The French Pearl", "description": "Muddle mint with the rest of the ingredients in a mixing glass. Add ice and stir well. Strain into a chilled cocktail glass."},
{"name": "The Hyp Fairy", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled shot glass."},
{"name": "The Flirt", "description": "Add all the ingredients into the mixing tin, add lots of ice, shake thoroughly and strain."},
{"name": "The Communist", "description": "Add all the ingredients into a mixing tin and fill with ice. Shake thoroughly, strain and garnish with a cherry."},
{"name": "The Coutesan", "description": "Pour the ingredients into a cocktail  shaker with ice cubes. Shake well. Strain into a chilled shot glass."},
{"name": "Texas Prairie Fire", "description": "Pour tequila in a shot glass, top off with lime juice and then add a splash of Tabasco sauce."},
{"name": "The Blenheim", "description": "Shake ingredients together with ice and strain into a cocktail glass."},
{"name": "The Adjustable Rate", "description": "Pour the ingredients into a cocktail shaker with ice. Shake well. Strain into a highball glass filled with ice. Garnish with pineapple."},
{"name": "Tequila Sunset", "description": "Pour the tequila and orange juice into glass over ice. Add the blackberry brandy, which will sink to the bottom. Do not stir. Garnish with orange slice and serve."},
{"name": "Tequila Sunrise Margarita", "description": "Pour the ingredients into a blender with one cup of ice. Blend until smooth. Pour contents into a chilled margarita glass rimmed with salt. Garnish with a lime wheel."},
{"name": "Strawberry Daiquiri", "description": "Add all ingredients into a Boston Shaker and fill with ice. Shake for about 15 seconds and then strain into a chilled martini glass. Garnish with a strawberry."},
{"name": "Strawberry  Sangria", "description": "Pour wine in the pitcher and add sliced strawberries. Next add sugar, strawberry lemonade and stir gently. Add ginger ale and ice just before serving."},
{"name": "Stone Fence Cocktail", "description": "In a double rocks glass add the bourbon and bitters and fill with ice. Top with apple cider. Stir once with a spoon to incorporate the ingredients and serve."},
{"name": "Stinger", "description": "Pour the ingredients into an Old-Fashioned glass with crushed ice. Stir well."},
{"name": "Stone Sour", "description": "Pour all ingredients into a cocktail shaker. Shake well. Strain into a chilled sour glass."},
{"name": "Staten Island Ferry", "description": "Stir ingredients together with bar spoon and serve over ice in a highball glass."},
{"name": "Starry Lime", "description": "Add apple vodka, cranberry juice, basil and lime juice into a cocktail shaker filled with ice. Shake vigorously and strain into a rocks glass filled with ice. Garnish with a fresh basil leaf."},
{"name": "Star Cocktail", "description": "Pour the ingredients into a mixing glass filled with ice cubes. Stir well. Strain into a chilled cocktail glass. Garnish with a lemon twist."},
{"name": "St. Paddys Sangria", "description": "Pour wine in the pitcher and squeeze the juice wedges from the lemon and orange into the wine. Toss in the wedges of orange, lemon and apple (leaving out seeds if possible) and add sugar, lime juice and whiskey. Chill overnight. Add club soda or ginger ale just before serving."},
{"name": "Springbok", "description": "Layer the Amarula gently on to the crème de menthe and then add a thin layer of cream."},
{"name": "Spring Fever", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a Collins glass half filled with crushed ice."},
{"name": "Sneaky Pete", "description": "Pour the coffee liqueur into an Old-Fashioned glass with ice cubes. Add the milk and rye whiskey. Stir well."},
{"name": "Smith and Wesson", "description": "Pour the coffee liqueur , vodka and half-and-half into a highball glass filled with ice. Fill with soda water."},
{"name": "Smith and Kearns", "description": "Pour the coffee liqueur and cream into a cocktail shaker with ice. Shake well. Strain into a highball glass filled with ice. Top with soda water."},
{"name": "Slippery Nipple", "description": "Pour the sambuca into a shot glass, then pour the Irish cream liqueur on top so that the two liquids do not mix."},
{"name": "Slammer Royale", "description": "Mix all ingredients in a rocks glass and serve straight up."},
{"name": "Skyscraper Manhattan", "description": "Add the first 3 ingredients to the mixing tin with lots of ice. Shake thoroughly, strain over lots of ice and top-up with ginger beer. Garnish with a cherry."},
{"name": "Skittle Bomb", "description": "The triple sec is poured into a shot glass, and the shot glass is then dropped into the energy drink."},
{"name": "Ski Lift", "description": "Pour the schnapps and rum into an Irish coffee glass. Fill the glass with hot chocolate. Top with whipped cream. Sprinkle coconut flakes on top of cream."},
{"name": "Silk Stocking", "description": "Pour the ingredients in a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Silver Bullet", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a shot glass. Squeeze the lemon twist over the shot then hang it on the rim as a garnish."},
{"name": "Scarlet O`Hara", "description": "Pour the Southern Comfort and lime juice into a Collins glass filled with ice. Fill with cranberry juice. Garnish with lime wedge."},
{"name": "Sazerac", "description": "One rocks glass is packed with ice and water to chill the glass. In a second rocks glass, muddle the sugar cube with the bitters. Add the rye to this mixture. Stir to combine. Empty the ice from the first glass. Pour the absinthe into the glass and swirl to coat the sides of the glass. Any excess absinthe is discarded. Pour the rye/sugar/bitters mixture into the coated glass. Twist a lemon peel over the glass and rub the rim of the glass with the peel. The peel can be discarded or placed in the cocktail."},
{"name": "Savoy Corpse Reviver", "description": "Shake all ingredients together with ice and strain into a chilled cocktail glass."},
{"name": "Savoy Affair", "description": "Shake ingredients together with ice, and strain into a cocktail glass, and fill with Champagne and garnish."},
{"name": "Satans Whiskers", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Saratoga Brace Up", "description": "Pour all the ingredients , except the soda water, into a cocktail shaker with ice. Shake vigorously. Strain into a highball glass. Top with soda water."},
{"name": "Santa Shot", "description": "Pour the grenadine syrup in a shot glass. Float the green crème de menthe on top and then float the peppermint schnapps on top of this. Make sure to pour the drinks slowly for the desired effect and use a bar spoon to help with layering if necessary"},
{"name": "Sangria", "description": "Pour wine in the pitcher and squeeze the juice wedges from the lemon and orange into the wine. Toss in the fruit wedges and add sugar and brandy. Chill overnight. Add ginger ale or club soda just before serving."},
{"name": "Sake Screwdriver", "description": "Mix the two ingredients in a mixing tin with ice and pour into a highball glass with 3 ice cubes. Serev chilled."},
{"name": "Saketini", "description": "Pour the ingredients into a mixing glass filled with ice. Stir well. Strain into a chilled cocktail glass. Garnish with an olive. Serve."},
{"name": "Royal Smash", "description": "Muddle mint leaves and lemon wedges in a mixing glass. Add Royal Combier and ice and shake hard. Strain over ice in a rocks glass and garnish with a fresh mint sprig."},
{"name": "Royal Manhattan", "description": "Stir over ice in a mixing glass and strain into a chilled cocktail glass. Garnish with maraschino cherry and served straight up."},
{"name": "Royal Bermuda", "description": "Mix all the ingredients in a mixing glass with ice. Strain into the cocktail glass. Garnish with lime wedge."},
{"name": "Royal Duchess", "description": "Add the pomegranate juice to Champagne flute and top up with Champagne."},
{"name": "Royal Arrival", "description": "Shake ingredients in a cocktail shaker filled with ice. Strain into cocktail glass and serve."},
{"name": "Roy Rogers", "description": "Pour the ingredients into a Collins glass filled with ice. Stir well. Garnish with maraschino cherry."},
{"name": "Rourou", "description": "Mix ingredients and serve in Old-Fashioned glass."},
{"name": "Rosy Rum Cosmo", "description": "Pour the rum, triple sec, lime juice and cranberry juice into a cocktail shaker with ice. Shake well. Strain into a chilled cocktail glass. Garnish with the mint leaf."},
{"name": "Rosy Dawn", "description": "Add all the ingredients to a mixing tin and add lots of ice. Shake thoroughly, strain into a chilled martini glass and garnish with a cherry."},
{"name": "Rossini", "description": "Add the strawberry puree to the Champagne flute. Top up with Champagne and gently stir."},
{"name": "Rosemary Mac", "description": "Pour ingredients into a mixing glass with ice cubes and stir well. Strain into a chilled cocktail glass and garnish with sprig of rosemary."},
{"name": "REDRUM", "description": "Coat martini glass with rose syrup. Muddle brandy cherries and add egg whites, fresh lime juice, simple syrup, and dry shake (no ice). Add ice and Mekhong and shake again. Pour into martini glass and sprinkle nutmeg on top and garnish with rose petal."},
{"name": "RedHeaded Slut", "description": "Combine Jägermeister and schnapps in glass full of ice. Add cranberry juice to fill to top. Stir as necessary and serve iced cold."},
{"name": "Red Sea Sunrise", "description": "Pour the lemonade, orange juice and pineapple juice into glass over ice. Add the grenadine syrup, which will sink to the bottom. Do not stir. Garnish and serve."},
{"name": "Red Lotus", "description": "Pour the vodka, lichido and cranberry juice into a cocktail shaker with ice. Shake well. Strain into a chilled Old-Fashioned glass filled with ice."},
{"name": "Red Corvette", "description": "Blend all ingredients in a blender with a cup of ice and then pour into a hurricane glass."},
{"name": "Red Cloud", "description": "Add all the ingredients into the mixing tin with lots of ice.  Shake thoroughly and fine strain into a martini glass. Garnish with lemon zest twist."},
{"name": "Red Beer", "description": "Pour the tomato juice into a beer mug. Fill with beer. Add salt to taste."},
{"name": "Raspberry Truffle", "description": "Pour the vodka, coffee liqueur and chambord into a cocktail shaker with ice.  Shake well. Strain into a chilled tall wine glass. Top with a pile of fresh whipped cream."},
{"name": "Rasputin", "description": "Build the cocktail in Collins glass over lots of ice. Stir for 10 seconds with bar spoon and serve."},
{"name": "Raspberry Press", "description": "Pour the ingredients into an Old-Fashioned glass with ice. Pour the contents into a cocktail shaker. Pour back into the glass. Garnish with the lime wedge."},
{"name": "Very Berry Mule", "description": "Gently muddle the raspberries with the vodka in the mixing tin, add the other ingredients and lots of ice, shake and fine strain into the glass over lots of ice and top up with ginger beer. Garnish with raspberries."},
{"name": "Problem Solver", "description": "In a cocktail mixing glass , add first three ingredients. Add ice, stir vigorously with a bar spoon  for 30 seconds. Strain into a chilled martini glass which has been rinsed with Fernet Branca. Garnish with an orange twist, making sure to express the orange oil directly onto the surface of the cocktail."},
{"name": "Prince of Wales", "description": "Mix ingredients in a cocktail shaker filled with ice. Pour into a Champagne glass and fill with Champagne."},
{"name": "Presbyterian", "description": "Pour Scotch whisky into a Collins glass, add 2 ice cubes, top up with ginger ale and soda water."},
{"name": "Prairie Fire", "description": "Pour the tequila into a shot glass. Add drops of Tabasco to taste."},
{"name": "PornStar", "description": "Pour both ingredients into a cocktail shaker with ice. Shake and strain into a shot glass and serve."},
{"name": "Porto Flip", "description": "Shake ingredients together in a mixer with ice. Strain into chilled cocktail glass, garnish and serve."},
{"name": "Porch Crawler", "description": "Combine all ingredients in a water cooler with ice. Adjust beer quantity to taste. Serve in plastic cups."},
{"name": "Popper", "description": "Pour the ingredients into a shot glass. Cover the glass with a napkin and your hand. Slam the glass on the bar counter. Drink while its still fizzing."},
{"name": "Pontberry Martini", "description": "Add all the ingredients into the mixing tin. Add lots of ice. Shake thoroughly and strain into chilled martini glass. Garnish with 3 blackberries."},
{"name": "Pomspresso Tini", "description": "Pour the espresso vodka and fruit juices into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Add a couple of dashes of Bitters."},
{"name": "Pompanski Martini", "description": "Add all the ingredients to the mixing tin and add lots of ice. Shake thoroughly, strain into a chilled martini glass and garnish with orange zest twist."},
{"name": "Pomegranate Poinsettia", "description": "Mix the first three ingredients in a tumbler glass with ice. Slowly add the Champagne, stirring gently."},
{"name": "Pink Gin", "description": "Coat the sides of a chilled martini glass with Angostura bitters, add chilled gin and serve."},
{"name": "Pomegranate Gin Fizz", "description": "Pour the spirits, juice, syrup, and egg white into a cocktail shaker filled with ice. Shake vigorously to ensure egg white is mixed thoroughly with the other ingredients. Strain into a chilled highball glass with ice cubes. Top off with soda water."},
{"name": "Pink Flamingo", "description": "Pour the vodka, triple sec and sloe gin into a highball glass filled with ice. Top up with orange juice. Stir well."},
{"name": "Pink Elephant", "description": "Combine all ingredients, except cream and sugar, into shaker with ice and shake. Strain into a martini glass. In a separate shaker combine cream and sugar and shake vigorously without ice. Carefully layer the cream on top of the base. Garnish with a raspberry and mint sprig on the rim."},
{"name": "Pink Campari", "description": "Fill a cocktail shaker with ice, and add all ingredients. Shake well and pour into a chilled martini glass. Garnish with skewered raspberries and lime twist."},
{"name": "Pineapple Punch", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a Collins glass. Garnish with pineapple slice."},
{"name": "Pineapple Sangria", "description": "Pour wine into a large pitcher and squeeze the juice wedges from the lemon and orange into the white wine. Toss in the fruit wedges and pineapple then add sugar. Chill overnight. Add ginger ale, rum and ice just before serving."},
{"name": "Pina Martini", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a chilled martini glass.  Garnish with lime wedge."},
{"name": "Pineapple Mojito", "description": "Muddle the pineapple, lime and mint in the bottom of a cocktail shaker. Fill the shaker with ice and add the other ingredients. Shake for 10 seconds and strain all ingredients into a chilled cocktail glass."},
{"name": "Phil Collins", "description": "Mix the lemon-lime soda, lemon juice and sugar syrup in a tall glass with ice, top up with soda water, garnish with maraschino cherry and serve."},
{"name": "Perroquet", "description": "Pour pastis and mint liqueur over ice cubes in a highball glass. Fill with cold water. Stir well and serve."},
{"name": "Perfect Storm", "description": "Combine Grand Marnier, lime juice, and bitters in a mixing glass. Add ice and shake vigorously. Strain over fresh ice into a highball glass. Top with ginger beer and swirl. Garnish with lime wedge."},
{"name": "Perfect Manhattan", "description": "Stir over ice, strain into a chilled cocktail glass, garnish with a maraschino cherry. Serve straight up."},
{"name": "Passbour Cooler", "description": "Halve and scoop out passion fruit and muddle with the bourbon in the mixing tin. Add the other ingredients and lots of ice. Shake and fine strain over lots of ice and garnish with orange zest twist."},
{"name": "Passion Cocktail", "description": "Pour the tequila, cranberry juice and lime juice, into a cocktail shaker with ice cubes. Shake well. Strain into a chilled stemmed glass. Splash with Grand Marnier. Garnish with slice of lime."},
{"name": "Park Avenue Cocktail", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a chilled cocktail glass."},
{"name": "Parisian Blond", "description": "Pour the rum, curacao and cream into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Add a drop of vanilla extract on top for garnish."},
{"name": "Paradise", "description": "Shake ingredients together in a mixing tin over ice. Strain into cocktail glass and serve chilled."},
{"name": "Panama", "description": "Shake together ingredients in a  cocktail shaker with ice and strain into a chilled cocktail glass. Garnish with nutmeg if desired."},
{"name": "Pamplemousse", "description": "Add the red grapefruit liqueur to the bottom of a wine glass and then slowly top up with sparkling wine."},
{"name": "Pamoyo", "description": "Pour the ingredients into a mixing glass with ice cubes. Stir well. Strain into a chilled shot glass."},
{"name": "Nutty Irishman", "description": "Pour equal amounts of the 2 liqueurs into a shot glass."},
{"name": "Nuts and Berries", "description": "Pour the liqueurs into an Old-Fashioned glass filled with ice. Stir well. Top up with cream."},
{"name": "Norina", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Serve in a chilled martini glass. Add a lemon twist as garnish."},
{"name": "Northern Lights", "description": "Pour the Canadian whiskey and peach schnapps into an Old-Fashioned glass filled with ice. Fill with equal parts orange juice and cranberry juice. Stir."},
{"name": "Nixon", "description": "Stir ingredients and serve on the rocks in a cocktail glass. Garnish with a peach slice."},
{"name": "Ninotchka", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Nikolaschka", "description": "Pour Cognac into brandy snifter, place lemon disk across the top of the glass and top with sugar and coffee."},
{"name": "New Zealander Sangria", "description": "Pour wine in the pitcher and squeeze the juice wedges from the lemon or limes into the wine. Toss in the sliced kiwi, tangerine and lemon and add sugar. Chill overnight. Add ginger ale or club soda just before serving."},
{"name": "New York Cocktail", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with the lemon twist."},
{"name": "New Orleans Fizz", "description": "Place all the ingredients except the soda water into a cocktail shaker with ice. Shake vigorously. Strain into a highball glass filled with ice. Top with soda water."},
{"name": "Nevada Cocktail", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Missouri Mule", "description": "Shake all ingredients together with ice in a cocktail shaker. Strain into a chilled cocktail glass."},
{"name": "Mistletoe Martini", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into two chilled cocktail glasses."},
{"name": "Mint and Honey Daiquiri", "description": "Stir the honey into the rum and lime juice in a mixing tin until it has dissolved. Add the mint and muddle gently , shake with lots of ice and fine strain into chilled martini glass."},
{"name": "Minnehaha", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass."},
{"name": "Mind Eraser", "description": "Fill the Old-Fashioned glass with ice. Pour the vodka and coffee liqueur over ice. Fill with soda water. Garnish with a lime wedge and serve with a straw."},
{"name": "Mimosa", "description": "Ensure both ingredients are well chilled, and then mix together in a Champagne flute.  Add the sparkling wine first, and then top with orange juice. This way, the cocktail mixes together on its own and won’t make a sticky mess at the top of the glass. No need to stir as this will cause the wine to become flat.  Serve cold."},
{"name": "Millenium", "description": "Pour the gin, cherry brandy and orange juice into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Add a splash of ginger ale."},
{"name": "Milk and Honey", "description": "Pour Benedictine into a mug, add ice and top up with cold milk. Garnish with cinnamon."},
{"name": "Midori Sour", "description": "Fill a tumbler with ice. Add the melon liqueur, sour mix, and lemon and lime soda, give a quick stir."},
{"name": "Melon Ball", "description": "Pour all ingredients into a mixing glass with ice. Stir well and strain into a shot glass."},
{"name": "Midnight Snowstorm", "description": "Pour white crème de menthe and hot chocolate into an Irish coffee glass. Top with whipped cream. Drizzle the green crème de menthe on top."},
{"name": "Melancia Sour", "description": "Stir and strain into a chilled sour glass. Add pinch of sea salt and lemongrass stalk as garnish."},
{"name": "May Day", "description": "Blend all the ingredients together with crushed ice. Pour the mix equally into two highball glasses. Garnish with an apple fan."},
{"name": "Maya Magic", "description": "Pour ingredients into cocktail shaker and add crushed ice. Let stand for five seconds then shake vigorously for five seconds. Strain into a martini glass. Garnish with a pineapple slice."},
{"name": "Mauresque", "description": "Mix ingredients in a cocktail shaker with ice for 10 seconds. Strain and serve in Old-Fashioned glass."},
{"name": "Matador", "description": "Mix all the ingredients in a shaker half full of ice and shake for 10 seconds. Strain and serve in a chilled cocktail glass."},
{"name": "MasterMix", "description": "Combine all ingredients with ice in a mixing glass and stir. Strain into a chilled cocktail glass. Add cherry to garnish."},
{"name": "Mary Pickford", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass."},
{"name": "Massey", "description": "In a mixing glass, add all ingredients except orange twist. Add ice, stir vigorously for 30 seconds. Strain into a chilled martini glass. Garnish with an orange twist."},
{"name": "Marquee", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a chilled martini glass.  Garnish with a flamed lemon zest."},
{"name": "Martinez", "description": "Pour the ingredients into a mixing glass with ice cubes. Stir well. Strain into a chilled cocktail glass. Twist the lemon peel over the glass and drop it into the glass."},
{"name": "Madison Avenue", "description": "Add the liquids and a few mint leaves to cocktail shaker filled with ice. Shake well. Strain into an Old-Fashioned glass with ice. Garnish with a mint sprig."},
{"name": "Macbeth", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass."},
{"name": "Mad Monk", "description": "Pour the liqueur into an Irish coffee glass. Fill with equal parts of hot chocolate and hot coffee. Stir well. Top with whipped cream."},
{"name": "Lynchburg Lemonade", "description": "Build over ice, stir with a bar spoon and serve in a Collins glass."},
{"name": "Lucid Garden", "description": "Muddle two cucumber wheels and two peeled kiwi wheels with the simple syrup into a double rocks glass. Fill with ice and add the absinthe.Top up with soda water. Garnish with an unpeeled kiwi wheel on rim of the glass."},
{"name": "Lounge Lizard", "description": "Pour the dark rum and amaretto into a Collins glass filled with ice. Top with cola. Stir well."},
{"name": "Lucky Lindy", "description": "Add the Bourbon whiskey and honey to the mixing tin, stir until the honey resolves, add the other ingredients and lots of ice. Shake well, strain over lots of ice and top up with lemonade. Garnish with lemon wheel."},
{"name": "Lorraine", "description": "Stir all the ingredients with ice and then strain into a chilled cocktail glass."},
{"name": "Love Potion#9", "description": "Pour the ingredients into a blender. Blend until smooth. Pour into a chilled margarita glass. Garnish with a strawberry."},
{"name": "Lava Lamp Martini", "description": "Pour the vodka into a cocktail shaker with ice. Shake well. Strain into a chilled cocktail glass. Mix the honey and raspberry liqueur well in a shot glass.Use a spoon to slowly drizzle the honey mixture into the vodka."},
{"name": "Laura Cocktail", "description": "Pour the ingredients into a cocktail shaker filled with ice. Stir for 30 seconds. Strain into a chilled cocktail glass."},
{"name": "LadyBoy", "description": "Build ingredients into a short tumbler glass with ice. Stir lightly and garnish with a cinnamon stick."},
{"name": "Latin Manhattan", "description": "Stir ingredients over ice and then strain into a chilled cocktail glass. Garnish with a lemon twist and serve straight up."},
{"name": "La Vie En Rouge", "description": "In a tall mixing glass, muddle 10-12 rosemary needles lightly with simple syrup. Add remaining ingredients then add ice and shake vigorously. Strain over fresh ice into a rocks glass with ice. Garnish with a rosemary sprig."},
{"name": "Lanesborough", "description": "In a mixing glass add Grand Marnier, cranberry juice and passionfruit juice. Add ice, shake vigorously and strain into a chilled Champagne flute. Top with Champagne and garnish with an orange spiral twist."},
{"name": "La Pomme", "description": "Pour all  ingredients into a mixing glass with ice and gently stir. Strain into a chilled cocktail glass and garnish with apple slice."},
{"name": "La Habanna", "description": "Pour the gin and apricot brandy into a cocktail shaker filled with ice. Add a few drops of lime juice. Shake well. Strain into a chilled cocktail glass. Garnish with a lime wedge."},
{"name": "La Cranne Creuse", "description": "Combine ingredients in a mixing glass. Add ice and stir until well chilled. Strain into a chilled cocktail glass and garnish with an orange twist."},
{"name": "La Coloniale", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with a cucumber slice."},
{"name": "Kyoto Sour", "description": "Muddle grapefruit and Tabasco in a cocktail shaker. Add sake, lemon juice and agave nectar. Shake vigorously. Strain into an Old-Fashioned glass filled with ice and garnish with a mint sprig."},
{"name": "La Boheme", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a chilled martini glass."},
{"name": "Katinka", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with mint sprig."},
{"name": "Kamikaze", "description": "Shake all ingredients together in a mixer with ice. Strain into a chilled cocktail glass and garnish with a lime slice."},
{"name": "Kahlua Colada", "description": "Mix ingredients in blender with crushed ice until smooth. Pour into chilled cocktail glass, garnish with pineapple slice and serve."},
{"name": "Just Peachy Sangria", "description": "Pour wine and schnapps in the pitcher and add sliced peach, orange, and mango. Next add sugar and stir gently. Chill mixture for at least one hour. Add ginger ale or club soda just before serving."},
{"name": "Jump Up and Kiss Me", "description": "Shake all ingredients with ice in cocktail shaker. Fill tall glass with ice, pour and serve."},
{"name": "Juan Collins", "description": "Mix the tequila, lemon juice and sugar syrup in a tall glass with ice, top up with soda water. Garnish with maraschino cherry and serve in a Collins glass."},
{"name": "Joker", "description": "Mix all ingredients with lots of ice in a mixing glass and stir for 20 seconds. Pour into a chilled cocktail glass."},
{"name": "Johnny Weissmuller", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass."},
{"name": "Jock Collins", "description": "Mix the Scotch whisky, lemon juice and sugar syrup in a tall glass with ice, top up with soda water. Garnish with maraschino cherry and serve in a tall glass."},
{"name": "Jersey Tea", "description": "Mix ingredients in glass over ice, stir with bar spoon for 20 seconds, garnish with lemon slice and serve in highball glass."},
{"name": "Irish Winter", "description": "Combine ingredients in an Irish coffee glass. Stir to combine. Top with whipped cream."},
{"name": "Jersey Flashlight", "description": "Pour the ingredients into a heat resistant mug and fill with water. Ignite the mixture with a match and stir while flaming. Extinguish by covering the cup with another heat resistant mug. Garnish with a lemon peel."},
{"name": "Irish Tea Party", "description": "Rinse rocks glass with absinthe. Add ice. Pour whiskey over the ice. Add green tea and garnish with a lime slice."},
{"name": "Irish Russian", "description": "Pour the ingredients into an Old-Fashioned glass and stir. Top with stout head."},
{"name": "Irish Punch", "description": "Combine all ingredients in a medium pot. Over medium heat, warm the mixture, stirring constantly.Transfer to a large punch bowl and serve in coffee mugs. Garnish with shaved nutmeg."},
{"name": "Irish Pride", "description": "Build the ingredients in a highball glass. Stir well with a bar spoon and serve."},
{"name": "Irish Martini", "description": "Pour the Irish whisky into a chilled cocktail glass. Swirl around the glass in order to coat the inside. Drain the excess whiskey. Pour the vodka and dry vermouth into a cocktail shaker half-filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a lemon twist."},
{"name": "Irish Ice", "description": "Add Irish cream liqueur, iced coffee and coffee ice cream to a blender. Blend on high with chipped ice until smooth. Top with espresso, a mint sprig and whipped cream."},
{"name": "Irish Gold", "description": "Build the whiskey, schnapps and juice in a Collins glass filled with ice. Top with ginger ale. Garnish with a lime wheel."},
{"name": "Irish Hammer", "description": "Pour the ingredients into a shaker with ice cubes. Shake well. Strain into a chilled shot glass."},
{"name": "Irish Frog", "description": "Pour the melon liqueur into a shot glass. Slowly float the Irish cream liqueur on top."},
{"name": "Irish Flag", "description": "Pour the crème de menthe into shot glass. Float the Irish cream liqueur on top of the crème de menthe. Float the Grand Marnier on top of the Irish cream liqueur."},
{"name": "Irish Eyes", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled Old-Fashioned glass. Garnish with maraschino cherry."},
{"name": "Horny Bull", "description": "Pour the tequila into a highball glass filled with ice.Top with orange juice."},
{"name": "Irish Coffee Drop", "description": "Pour the Irish cream liqueur into a shot glass. Pour the vodka on top. Pour the stout into a pint glass 3/4 full and let settle. Drop the shot glass into the stout and chug."},
{"name": "Honolulu", "description": "Rim a cocktail glass with sugar. Pour the ingredients into a chilled cocktail shaker filled with ice. Shake well. Strain into the prepared glass. Garnish with a lemon twist."},
{"name": "Honeymoon Cocktail", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with lemon peel."},
{"name": "Honey Dew Me", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 -1 5 seconds. Strain into a shot glass."},
{"name": "Honey Deuce", "description": "Fill chilled highball glass with crushed ice and add premium vodka.Top with lemonade to just below the rim and then add Cambord. Garnish with honeydew melon balls."},
{"name": "Hollywood", "description": "Pour the vodka and black raspberry liqueur into a Collins glass filled with ice. Fill with pineapple juice. Garnish with a pineapple chunk."},
{"name": "Holiday Hopper", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with mint leaves and raspberry."},
{"name": "Hi-Ho", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Stir well. Strain into a cocktail glass. Garnish with a lemon twist."},
{"name": "Highland Margarita", "description": "Pour all ingredients in a cocktail  shaker with ice. Shake for 10 seconds and strain into a margarita glass rimmed with salt. Garnish with a lemon wedge."},
{"name": "High Voltage", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled highball glass."},
{"name": "Green Iguana Margarita", "description": "Mix all ingredients with ice in a shaker or blender. Serve in a chilled cocktail glass and garnish with a lime wheel."},
{"name": "Green Grape Glacier", "description": "Freeze the grapes until hard. Combine 10 frozen grapes and grape juice in a blender and process for about 20 seconds or until smooth and thick. Pour the grape mix into a highball glass. Add the sparkling water. Stir gently. Garnish with the remaining 2 frozen grapes."},
{"name": "Green Hornet", "description": "Start with a rocks glass and fill it with ice. Add brandy and green creme de menthe. Stir and serve in the original glass or strain into a chilled glass without ice."},
{"name": "Green Ghoul", "description": "Add the first three ingredients into a mixing tin and fill with ice. Shake well. Line the inside of a wine glass with strands of black liquorice. Strain into Collins glass and fill with ginger beer."},
{"name": "Green Eyes", "description": "Fill a chilled cocktail glass with ice, layer the premium vodka and orange juice, stir slightly, and float the blue curacao on top. Garnish with apple slice."},
{"name": "Green Carnation", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for about 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Grateful Dead", "description": "Mix all ingredients in glass over ice and stir for 15 seconds with bar spoon. Garnish with lemon slice and serve in highball glass."},
{"name": "Grasshopper", "description": "Pour ingredients into a cocktail shaker with ice. Shake briskly and then strain into a chilled cocktail glass."},
{"name": "Grapefruit Daiquiri", "description": "Add all the ingredients to the mixing tin and add lots of ice. Shake thoroughly, strain into a chilled cocktail glass and garnish with cherry."},
{"name": "Grand Orange Collins", "description": "Mix the Grand Marnier, lemon juice, orange juice and sugar syrup in a tall glass with ice. Top up with soda water, garnish with maraschino cherry and serve."},
{"name": "Good Luck Charm", "description": "Shake all ingredients with ice in a mixing tin until well blended. Strain into a chilled cocktail glass with a sugared rim. Garnish with a lemon wheel."},
{"name": "Ginger Tea", "description": "In a mixing glass, add ginger, mint and simple syrup and muddle. Pour the Cognac and fresh tea over top and muddle a little more. Strain into an ice filled cocktail glass. Garnish with a mint leaf."},
{"name": "Ginger Rogers", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass."},
{"name": "Ginger Martini", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with a lemon twist."},
{"name": "Ginger Lime Long-Tail", "description": "Pour Mekhong and lime juice into a Collins glass. Add ice and lime wheels. Cover with a shaker tin and shake briefly.Top off with ginger beer and add bitters. Serve with a straw."},
{"name": "Ginger Bush", "description": "Pour the rum into a glass over ice. Pour the ginger beer over it. Squeeze in the lime wedge and drop it in."},
{"name": "Gin Sling", "description": "Pour the ingredients (except soda) into a cocktail shaker filled with ice. Shake into a chilled Collins glass. Top up with soda. Garnish with lemon twist."},
{"name": "Gin Berry", "description": "Add all the ingredients to the mixing tin, and fill with ice. Shake thoroughly and strain into a chilled martini glass."},
{"name": "Gin &  Sin", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Add a dash of grenadine syrup. Shake well for 10 -15 seconds. Strain into a chilled cocktail glass."},
{"name": "Four Horsemen Go Hunting", "description": "Mix the five spirits together in a shot glass and down immediately."},
{"name": "Four Horsemen", "description": "Mix the four spirits together in a shot glass and down immediately."},
{"name": "Four Horsemen and Hell Follows", "description": "Mix the five spirits together in a shot glass and down immediately."},
{"name": "Foghorn", "description": "Pour the gin and lime juice into an ice filled Old-Fashioned glass. Stir well.Top with ginger ale. Stir gently. Garnish with lime wedge."},
{"name": "Flossy Aussie", "description": "Muddle kumquats, kiwi, lime juice and simple syrup in the bottom of a mixing glass. Add kiwi juice and shake with ice.Strain into a martini glass and top with bitter lemon soda. Garnish with a fruit skewer on the rim of the glass."},
{"name": "Floridita Margarita", "description": "Add all the ingredients to the mixing tin and add lots of ice. Shake thorughly, strain into a chilled coupette glass and garnish with a lime wedge."},
{"name": "Enamorada Sunrise", "description": "Pour the lemonade and orange juice and pineapple juice into a cocktail glass over ice. Add the Campari which will sink to the bottom. Do not stir. Garnish and serve."},
{"name": "Floradora", "description": "Pour the gin, framboise liqueur and lime juice into a highball glass filled with ice. Top with ginger ale. Garnish with lime wedge."},
{"name": "Florida Sunrise", "description": "Pour the tequila and orange juice and pineapple juice into cocktail glass over ice. Add the grenadine syrup, which will sink to the bottom. Do not stir. Garnish with orange slice and serve."},
{"name": "Emerson", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Stir well. Strain into a chilled cocktail glass."},
{"name": "Emma Peel Cocktail", "description": "Add the first 2 ingredients to the mixing tin with lots of ice. Shake thoroughly, strain into a chilled Champagne flute and top up with Champagne."},
{"name": "Emerald Isle", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Embassy", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass. Garnish with lime wedge."},
{"name": "Electric Martini", "description": "Combine all ingredients in a shaker with cracked ice. Shake vigourously and strain into a chilled cocktail glass."},
{"name": "Electric Iced Tea", "description": "Mix ingredients in glass over ice, stir, garnish with lemon slice and serve in highball glass."},
{"name": "Elderflower Martini", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a chilled martini glass. Garnish with a lemon zest twist."},
{"name": "Elderflower Cocktail", "description": "Pour the liqueur and Champagne over ice in a chilled Collins glass. Top up with soda water. Stir well. Garnish with lemon twist."},
{"name": "Eden", "description": "Add the first 4 ingredients to the mixing tin with lots of ice. Shake thoroughly and strain over lots of ice. Top up with tonic water."},
{"name": "Distracted", "description": "Build the ingredients in a cocktail glass over 2 ice cubes. Add a few dashes of lemon bitters and serve."},
{"name": "Dirty Mother", "description": "Fill the rocks glass with ice. Add the brandy and the coffee liqueur and gently stir. Serve."},
{"name": "Devil`s Punch", "description": "Pour all the ingredients into a cocktail shaker with ice cubes. Shake well for 20 seconds. Strain into a highball glass."},
{"name": "Diamond Fizz", "description": "Pour the gin, lemon juice and sugar into a cocktail shaker filled with ice. Shake well for 10 – 15 seconds. Strain into a highball glass filled with ice. Top with Champagne."},
{"name": "Dirty Martini", "description": "Pour the gin and dry vermouth into a mixing glass. Slowly add the olive brine. Stir. Strain into a chilled cocktail glass. Garnish with the olive."},
{"name": "Detropolitan", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a chilled martini glass. Garnish with flamed orange zest."},
{"name": "Desert Cooler", "description": "Add the first 3 ingredients to the mixing tin with lots of ice. Shake thoroughly, strain over lots of ice and top-up with ginger beer. Garnish with a orange slice."},
{"name": "Devil Cocktail", "description": "Pour the brandy and white crème de menthe into a cocktail shaker with ice. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass. Add a pinch of Cayenne pepper on top."},
{"name": "Derby Daiquiri", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a chilled martini glass."},
{"name": "Delilah", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass."},
{"name": "Cran Daddy Shandy", "description": "Pour fresh squeezed lemonade and white cranberry juice into an ice-filled, tall glass. Top with ginger beer."},
{"name": "Country Breeze", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly for 10 – 15 seconds and strain into a Collins glass. Garnish with mixed berries."},
{"name": "Cossack", "description": "Mix ingredients gently in a shaker with ice for 10 – 15 seconds. Pour into a chilled martini glass."},
{"name": "Cosmocello", "description": "Add all ingredients into a cocktail shaker filled with ice. Shake well and double strain into large cocktail glass. Garnish with lime wedge."},
{"name": "Corzo La Futura", "description": "Pour all ingredients into a shaker with ice. Shake and pour into a margarita glass. Garnish with slice of crystalized ginger and lemon peel."},
{"name": "Corpse Reviver #2", "description": "Shake ingredients together with ice in a mixing tin for 10 -15 seconds. Strain into a cocktail glass."},
{"name": "Coronation", "description": "Pour the ingredients into a mixing glass with ice cubes. Stir well with a bar spoon. Strain into a chilled cocktail glass."},
{"name": "Corn N `Oil", "description": "Pour the rum and falernum into a glass over ice and stir well. Squeeze in the lime wedge and drop it in."},
{"name": "Corpse Reviver", "description": "Shake ingredients together in a mixer with ice for 10 – 15 seconds. Strain into chilled cocktail glass."},
{"name": "Coppertone", "description": "Build all ingredients in a highball glass filled with ice. Garnish with lime wedge."},
{"name": "Chrysanthemum", "description": "In a cocktail shaker, stir together absinthe, brandy and vermouth. Add ice and stir for one minute, then strain into a martini glass. Squeeze orange peel over drink, making sure oils fall into the glass , then drop peel into drink and serve."},
{"name": "Churchill", "description": "Shake ingredients together with ice for 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Cool Colada", "description": "Pour all ingredients into a shaker with ice. Shake vigorously and pour into a 50 ml shot glass."},
{"name": "Christmas Jones", "description": "In a blender, whizz the vodka, strawberries, sugar and pineapple juice together .Pour the mix equally into 2 highball glasses. Top up with lemon-lime soda and garnish with mint sprig."},
{"name": "Choking Hazard", "description": "In the cocktail shaker, combine; whiskey, olive juice and dry vermouth. Fill shaker with some ice and shake for one minute. Strain in a chilled martini glass and garnish with the olive skewers."},
{"name": "Chocolate Martini", "description": "Pour the ingredients into a shaker with ice cubes. Shake vigorously and strain into a chilled cocktail glass rimmed with cocoa."},
{"name": "Chocolate Kiss", "description": "Pour the liqueurs into an Irish coffee glass. Fill with hot chocolate. Stir well. Top with whipped cream."},
{"name": "Chocolate Cake", "description": "Fill a mixing glass with ice and add the liquors. Cover the glass with another and shake. Strain into a shot glass. Serve with a sugar coated lemon."},
{"name": "Chocolate and Orange Martini", "description": "Dip rim of cocktail glass into melted chocolate and allow to set. Shake the ingredients with ice in a cocktail shaker. Strain into the prepared cocktail glass."},
{"name": "Chi-Chi", "description": "Pour all ingredients into blender with 1/2 cup of ice. Blend until smooth. Pour into chilled margarita glass and garnish with pineapple."},
{"name": "Chicago Fizz", "description": "Pour all ingredients , except the soda water, into a cocktail shaker filled with ice. Shake well and strain into a chilled Collins glass. Top up with soda water."},
{"name": "Chicago Cocktail", "description": "Prepare a frosted rim glass with egg white and sugar. Shake the rest of the ingredients (except the Champagne) with ice until frosted. Strain into prepared glass and top up with Champagne."},
{"name": "Cherubs Cup", "description": "Shake and strain over ice in a Collins glass. Top up with Brut rose sparkling wine. Garnish with strawberry."},
{"name": "Cherry Hooker", "description": "Pour the cherry brandy into an ice- filled highball glass. Top up with orange juice. Stir with bar spoon. Garnish with the lime wedge."},
{"name": "Catalina Margarita", "description": "Pour the ingredients into a cocktail shaker with ice. Shake well. Strain into a chilled maragarita glass."},
{"name": "Caribou Lou", "description": "Put all ingredients into a cocktail shaker and shake for 10 – 15 seconds. Serve up with ice in a highball glass."},
{"name": "Caruso", "description": "Pour the ingredients into a mixing glass filled with ice. Stir well. Strain into a chilled cocktail glass."},
{"name": "Cardinal Cocktail", "description": "Pour the crème de cassis into a wine glass filled with ice. Fill with red wine."},
{"name": "Caribbean Sunrise", "description": "Pour the rum and orange juice into glass over ice. Add the grenadine syrup, which will sink to the bottom. Do not stir. Garnish and serve."},
{"name": "Cape Cod", "description": "Build all ingredients in a highball glass filled with ice. Garnish with lime wedge."},
{"name": "Cantarito", "description": "Rim a Collins glass with salt. Fill the glass with ice and add the tequila and juices.Top it off with grapefruit soda. Garnish with fruit wedges."},
{"name": "Candy Corn", "description": "Pour the Galliano into a shot glass, float the orange curacao on top, float the cream on top."},
{"name": "Campari Cosmo", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with an orange slice."},
{"name": "Campari Cocktail", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with a lemon twist."},
{"name": "Calimocho", "description": "Stir ingredients together over plenty of ice in a highball glass."},
{"name": "California Iced Tea", "description": "Mix ingredients in glass over ice, stir, garnish with lemon slice and serve in highball glass."},
{"name": "Caju  Amigo", "description": "Both ingredients are mixed in a shot glass and served straight."},
{"name": "Caipivodka", "description": "Place lime and sugar into Old-Fashioned glass and muddle (mash the two ingredients together using a muddler or a wooden spoon). Fill the glass with crushed ice and add the vodka."},
{"name": "Brown University", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Stir well. Strain into a chilled cocktail glass."},
{"name": "Brown Mary", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Brown Russian", "description": "Pour the ingredients into a highball glass filled with ice cubes. Stir gently and top up with ginger ale."},
{"name": "Brown Derby", "description": "Add all the ingredients to the mixing tin and add lots of ice. Shake thoroughly, strain into a martini glass and garnish with grapefruit zest."},
{"name": "Brotherly Love", "description": "Pour the gin, Licor 43 and simple syrup into an Irish coffee glass. Stir well. Add steamed milk. Garnish with nutmeg."},
{"name": "Broken Heart Martini", "description": "Rim a cocktail glass with cocoa powder. Stir together the vodka, sugar, and crème de cacao with ice in a mixing glass. Strain into the prepared cocktail glass and garnish with orange slice."},
{"name": "Broad Stripes and Bright Stars", "description": "Muddle fresh blueberries and add syrup, absinthe, juice and vodka. Add ice and shake and pour into highball glass. Drizzle liqueur and top with ginger beer. Garnish with one sugar cube."},
{"name": "Breath of Fresh Air", "description": "Place the mint leaf at the bottom of the glass. Add the vodka and then the liqueur."},
{"name": "Breakfast Martini", "description": "Add the marmalade and the gin to the mixing tin. Stir until the marmalade dissolves, add the other ingredients and lots of ice. Shake well and fine strain over ice into a martini glass. Garnish with a flamed lemon zest."},
{"name": "Brazilian Sangria", "description": "In a cocktail shaker thoroughly muddle the fruit with absinthe, cachaca, brandy, and orange liqueur . Pour into a wine glass. Float red wine on top of cocktail. Stir and serve."},
{"name": "Brave Bull", "description": "Pour tequila into Old-Fashioned glass with ice cubes. Add Kahlua. Swirl the glass gently a few times to lightly mix the ingredients before serving."},
{"name": "Brass Monkey", "description": "Stir ingredients together and serve over ice in a highball glass."},
{"name": "Blue Margarita", "description": "Rub rim of cocktail glass with lime juice. Dip rim in coarse salt. Shake tequila, blue curacao, and lime juice with ice in a cocktail shaker, strain into the salt-rimmed glass, and serve."},
{"name": "Blue Lagoon Margarita", "description": "Pour the ingredients into a cocktail shaker with ice. Shake well for 10 – 15 seconds. Strain into a chilled maragarita glass."},
{"name": "Blue Lagoon", "description": "Pour all ingredents in a shaker with ice, shake well & strain into ice-filled highball glass, garnish with lemon slice and serve."},
{"name": "Blue Hawaiian", "description": "Combine all ingredients with ice, stir or shake, then pour into a hurricane glass with the ice. For garnish score pineapple slice with a knife and insert onto rim of glass."},
{"name": "Blue Eyed Blonde", "description": "Combine ingredients in a shaker with ice. Shake for 10 – 15 seconds. Strain straight into shooter glass."},
{"name": "Blue Cosmopolitan", "description": "Add all ingredients into a cocktail shaker filled with ice. Shake well and double strain into large cocktail glass. Garnish with lime wedge."},
{"name": "Blue Carnation", "description": "Shake the ingredients with ice in a cocktail shaker. Strain into a chilled cocktail glass."},
{"name": "Blue Blazer", "description": "Fill 2 metal pint mugs with boiling water and allow to stand until well warm. Discard the hot water.Pour 50 ml of whisky into one of the metal pint mugs. Into the second metal mug pour 50 ml of boiling water. Add 2 teaspoons of demerara sugar. The warmth of the mug will result in the whisky giving off alcoholic fumes. Using a lighter or match, carefully ignite the whisky. Pour the flaming whisky from one mug into the other.Immediately pour the water and whisky back into the empty mug. Repreat this process 5-6 times until sugar, whisky and water are all well mixed. Garnish with a twist of lemon zest."},
{"name": "Blue Bayou", "description": "Pour the ingredients into a blender with a cup of ice. Blend until smooth. Pour into a chilled margarita glass. Garnish with the pineapple."},
{"name": "Blowjob", "description": "Pour the amaretto into your shot glass.  Top the amaretto with the coffee liqueur, allowing the liqueurs to combine.  Top the shot with whipped cream."},
{"name": "Blood and Sand", "description": "Pour ingredients into a cocktail shaker filled with ice. Shake well. Strain into a chilled cocktail glass. Garnish with an orange slice."},
{"name": "Bloody Scotsman", "description": "Add dashes of Worcestershire Sauce, Tabasco, salt and pepper into highball glass, then pour all ingredients into highball with ice cubes. Stir gently. Garnish with celery stalk."},
{"name": "Blind Russian", "description": "Pour coffee liqueur and vodka into an Old-Fashioned glass filled with ice. Float Irish cream liqueur on top and stir slowly."},
{"name": "Blind Pilot", "description": "In a mixing glass add all the ingredients. Add ice. Stir vigorously for 30 seconds.Strain into a stemmed cocktail glass."},
{"name": "Black Widow", "description": "Pour the cranberry juice into a highball glass filled with ice. Float the Blavod black vodka on top."},
{"name": "Black Velvet", "description": "Fill a tall Champagne flute halfway with chilled stout beer and float the Champagne on top of the stout. The effect is best achieved by pouring over a spoon turned upside down over the top of the glass, so that the liquid runs gently down the sides rather than splashing into the lower layer and mixing with it."},
{"name": "Black Stripe", "description": "Pour the dark rum and honey into an Irish coffee glass. Twist a lemon twist over the glass and drop it into the glass. Fill the glass with hot water. Garnish with cinnamon stick."},
{"name": "Black Samurai", "description": "Mix ingredients in a shot glass and serve."},
{"name": "Black Rose", "description": "Pour the tequila rose into a shot glass. Float the vodka on top."},
{"name": "Bijou", "description": "Stir ingredients in mixing glass with ice. Strain into a chilled cocktail glass."},
{"name": "Beverley Hills Iced Tea", "description": "Mix ingredients in glass over ice, stir with a bar spoon, garnish with a lemon slice and serve in highball glass."},
{"name": "Between the Sheets", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well for 10 – 15 seconds. Strain into a chilled cocktail glass."},
{"name": "Besame", "description": "Muddle limes and raspberries in a highball glass. Add Agavero. Top off with passion fruit juice. Add splash of Chambord. Pour this mix into a cocktail shaker with ice. Shake well. Strain back into the highball glass."},
{"name": "Best Party Sangria", "description": "Pour wine into a large pitcher and squeeze the juice wedges from the lemon, orange and lime into the wine. Toss in the fruit wedges and pineapple then add sugar, orange juice and gin. Chill overnight. Add ginger ale, berries and ice just before serving."},
{"name": "Berry Nice", "description": "Add the blackberries and vodka to the mixing tin and muddle well. Add the liqueur and lemon juice and lots of ice and shake well. Fine strain into Collins glass over ice and top up with ginger beer."},
{"name": "Berry Caipirinha", "description": "Build in the rocks glass , muddle the quartered lime with the blackberries, raspberries and sugar syrup. Add the cachaca and lots of crushed ice and churn well."},
{"name": "Belmont Breeze", "description": "Shake all ingredients with ice for 10 – 15 seconds in a cocktail shaker.Strain into a chilled cocktail glass. Garnish with fresh mint sprig."},
{"name": "Berry Bliss", "description": "Fill a punch bowl half way with ice. Add all ingredients, stir and garnish with strawberry slices."},
{"name": "Batida", "description": "Mix ingredients with ice in a cocktail shaker for 10 seconds. Strain into a chilled cocktail glass."},
{"name": "Basil-ica", "description": "Muddle basil with the lemon juice and simple syrup at the bottom of a mixing glass. Add gin, elderflower liqueur and the bitters. Add ice and cap the mixing glass with a Boston shaker. Shake for 10 seconds then strain into a chilled cocktail glass. To garnish, roll up the basil leaf and wrap the orange twist around and place inside the glass."},
{"name": "Barnum Cocktail", "description": "Add all the ingredients to the mixing tin, add lots of ice, shake thoroughly and strain into a martini glass. Garnish with lemon zest twist."},
{"name": "Banshee", "description": "Take your cocktail shaker and fill it half way with ice. Add white creme de cacao, creme de banane, and cream. Shake it up and strain it into a chilled cocktail glass. For a finishing touch, garnish with a slice of banana before serving."},
{"name": "Baby Guinness", "description": "Float Irish cream on top of coffee liqueur in a shot glass."},
{"name": "Bahama Mama", "description": "Pour the ingredients into a cocktail shaker filled with ice. Shake well. Pour into a Collins glass with cracked ice. Garnish with strawberry."},
{"name": "Apricot Sour", "description": "Add the jam and the bourbon to the mixing tray and stir until the jam dissolves. Add the other ingredients and lots of ice. Shake well and strain over ice. Garnish with lemon zest twist."},
{"name": "April Rain", "description": "Pour the ingredients into a cocktail shaker with ice cubes. Shake well. Strain into a chilled cocktail glass and garnish with lime peel."},
{"name": "Baltic Breeze", "description": "Add all the ingredients to the mixing tin and add lots of ice. Shake thoroughly for 10 -1 5 seconds and strain into a Collins glass. Garnish with lime wedge."},
{"name": "Bamboo", "description": "Pour the vermouth and sherry into a mixing glass filled with ice. Add the bitters. Stir well. Strain into a chilled cocktail glass.Twist a lemon peel over the drink to release its essence. Garnish with an olive."},
{"name": "Amaretto Sunrise", "description": "Pour the amaretto and orange juice into glass over ice. Add the grenadine syrup, which will sink to the bottom. Do not stir. Garnish and serve."}
]